export const area = [{
    "children": [{
        "children": [{"en": "beijing", "hk": "北京", "id": "101010100", "zh": "北京"}, {
            "en": "haidian",
            "hk": "海淀",
            "id": "101010200",
            "zh": "海淀"
        }, {"en": "chaoyang", "hk": "朝陽", "id": "101010300", "zh": "朝阳"}, {
            "en": "shunyi",
            "hk": "順義",
            "id": "101010400",
            "zh": "顺义"
        }, {"en": "huairou", "hk": "懷柔", "id": "101010500", "zh": "怀柔"}, {
            "en": "tongzhou",
            "hk": "通州",
            "id": "101010600",
            "zh": "通州"
        }, {"en": "changping", "hk": "昌平", "id": "101010700", "zh": "昌平"}, {
            "en": "yanqing",
            "hk": "延慶",
            "id": "101010800",
            "zh": "延庆"
        }, {"en": "fengtai", "hk": "丰台", "id": "101010900", "zh": "丰台"}, {
            "en": "shijingshan",
            "hk": "石景山",
            "id": "101011000",
            "zh": "石景山"
        }, {"en": "daxing", "hk": "大興", "id": "101011100", "zh": "大兴"}, {
            "en": "fangshan",
            "hk": "房山",
            "id": "101011200",
            "zh": "房山"
        }, {"en": "miyun", "hk": "密雲", "id": "101011300", "zh": "密云"}, {
            "en": "mentougou",
            "hk": "門頭溝",
            "id": "101011400",
            "zh": "门头沟"
        }, {"en": "pinggu", "hk": "平谷", "id": "101011500", "zh": "平谷"}, {
            "en": "dongcheng",
            "hk": "東城",
            "id": "101011600",
            "zh": "东城"
        }, {"en": "xicheng", "hk": "西城", "id": "101011700", "zh": "西城"}],
        "en": "beijing",
        "hk": "北京",
        "id": "1",
        "zh": "北京"
    }], "en": "beijing", "hk": "北京", "id": "0", "zh": "北京"
}, {
    "children": [{
        "children": [{"en": "shanghai", "hk": "上海", "id": "101020100", "zh": "上海"}, {
            "en": "minhang",
            "hk": "閔行",
            "id": "101020200",
            "zh": "闵行"
        }, {"en": "baoshan", "hk": "寶山", "id": "101020300", "zh": "宝山"}, {
            "en": "jiading",
            "hk": "嘉定",
            "id": "101020500",
            "zh": "嘉定"
        }, {"en": "pudongxinqu", "hk": "浦東新區", "id": "101020600", "zh": "浦东新区"}, {
            "en": "jinshan",
            "hk": "金山",
            "id": "101020700",
            "zh": "金山"
        }, {"en": "qingpu", "hk": "青浦", "id": "101020800", "zh": "青浦"}, {
            "en": "songjiang",
            "hk": "松江",
            "id": "101020900",
            "zh": "松江"
        }, {"en": "fengxian", "hk": "奉賢", "id": "101021000", "zh": "奉贤"}, {
            "en": "chongming",
            "hk": "崇明",
            "id": "101021100",
            "zh": "崇明"
        }, {"en": "xuhui", "hk": "徐匯", "id": "101021200", "zh": "徐汇"}, {
            "en": "huangpu",
            "hk": "黃浦",
            "id": "101020400",
            "zh": "黄浦"
        }, {"en": "changning", "hk": "長寧", "id": "101021300", "zh": "长宁"}, {
            "en": "jingan",
            "hk": "靜安",
            "id": "101021400",
            "zh": "静安"
        }, {"en": "putuo", "hk": "普陀", "id": "101021500", "zh": "普陀"}, {
            "en": "hongkou",
            "hk": "虹口",
            "id": "101021600",
            "zh": "虹口"
        }, {"en": "yangpu", "hk": "楊浦", "id": "101021700", "zh": "杨浦"}],
        "en": "shanghai",
        "hk": "上海",
        "id": "3",
        "zh": "上海"
    }], "en": "shanghai", "hk": "上海", "id": "2", "zh": "上海"
}, {
    "children": [{
        "children": [{"en": "tianjin", "hk": "天津", "id": "101030100", "zh": "天津"}, {
            "en": "wuqing",
            "hk": "武清",
            "id": "101030200",
            "zh": "武清"
        }, {"en": "baodi", "hk": "寶坻", "id": "101030300", "zh": "宝坻"}, {
            "en": "dongli",
            "hk": "東麗",
            "id": "101030400",
            "zh": "东丽"
        }, {"en": "xiqing", "hk": "西青", "id": "101030500", "zh": "西青"}, {
            "en": "beichen",
            "hk": "北辰",
            "id": "101030600",
            "zh": "北辰"
        }, {"en": "ninghe", "hk": "寧河", "id": "101030700", "zh": "宁河"}, {
            "en": "jinghai",
            "hk": "靜海",
            "id": "101030900",
            "zh": "静海"
        }, {"en": "jinnan", "hk": "津南", "id": "101031000", "zh": "津南"}, {
            "en": "binhaixinqu",
            "hk": "濱海新區",
            "id": "101031100",
            "zh": "滨海新区"
        }, {"en": "jizhou", "hk": "薊州", "id": "101031400", "zh": "蓟州"}, {
            "en": "heping",
            "hk": "和平",
            "id": "101030800",
            "zh": "和平"
        }, {"en": "hedong", "hk": "河東", "id": "101031200", "zh": "河东"}, {
            "en": "hexi",
            "hk": "河西",
            "id": "101031300",
            "zh": "河西"
        }, {"en": "nankai", "hk": "南開", "id": "101031500", "zh": "南开"}, {
            "en": "hebei",
            "hk": "河北",
            "id": "101031600",
            "zh": "河北"
        }, {"en": "hongqiao", "hk": "紅橋", "id": "101031700", "zh": "红桥"}],
        "en": "tianjin",
        "hk": "天津",
        "id": "5",
        "zh": "天津"
    }], "en": "tianjin", "hk": "天津", "id": "4", "zh": "天津"
}, {
    "children": [{
        "children": [{"en": "chongqing", "hk": "重慶", "id": "101040100", "zh": "重庆"}, {
            "en": "yongchuan",
            "hk": "永川",
            "id": "101040200",
            "zh": "永川"
        }, {"en": "hechuan", "hk": "合川", "id": "101040300", "zh": "合川"}, {
            "en": "nanchuan",
            "hk": "南川",
            "id": "101040400",
            "zh": "南川"
        }, {"en": "jiangjin", "hk": "江津", "id": "101040500", "zh": "江津"}, {
            "en": "yubei",
            "hk": "渝北",
            "id": "101040700",
            "zh": "渝北"
        }, {"en": "beibei", "hk": "北碚", "id": "101040800", "zh": "北碚"}, {
            "en": "banan",
            "hk": "巴南",
            "id": "101040900",
            "zh": "巴南"
        }, {"en": "changshou", "hk": "長壽", "id": "101041000", "zh": "长寿"}, {
            "en": "qianjiang",
            "hk": "黔江",
            "id": "101041100",
            "zh": "黔江"
        }, {"en": "wanzhou", "hk": "萬州", "id": "101041300", "zh": "万州"}, {
            "en": "fuling",
            "hk": "涪陵",
            "id": "101041400",
            "zh": "涪陵"
        }, {"en": "chengkou", "hk": "城口", "id": "101041600", "zh": "城口"}, {
            "en": "yunyang",
            "hk": "雲陽",
            "id": "101041700",
            "zh": "云阳"
        }, {"en": "wuxi", "hk": "巫溪", "id": "101041800", "zh": "巫溪"}, {
            "en": "fengjie",
            "hk": "奉節",
            "id": "101041900",
            "zh": "奉节"
        }, {"en": "wushan", "hk": "巫山", "id": "101042000", "zh": "巫山"}, {
            "en": "tongnan",
            "hk": "潼南",
            "id": "101042100",
            "zh": "潼南"
        }, {"en": "dianjiang", "hk": "墊江", "id": "101042200", "zh": "垫江"}, {
            "en": "liangping",
            "hk": "梁平",
            "id": "101042300",
            "zh": "梁平"
        }, {"en": "zhongxian", "hk": "忠縣", "id": "101042400", "zh": "忠县"}, {
            "en": "shizhu",
            "hk": "石柱",
            "id": "101042500",
            "zh": "石柱"
        }, {"en": "dazu", "hk": "大足", "id": "101042600", "zh": "大足"}, {
            "en": "rongchang",
            "hk": "榮昌",
            "id": "101042700",
            "zh": "荣昌"
        }, {"en": "tongliang", "hk": "銅梁", "id": "101042800", "zh": "铜梁"}, {
            "en": "bishan",
            "hk": "璧山",
            "id": "101042900",
            "zh": "璧山"
        }, {"en": "fengdu", "hk": "豐都", "id": "101043000", "zh": "丰都"}, {
            "en": "wulong",
            "hk": "武隆",
            "id": "101043100",
            "zh": "武隆"
        }, {"en": "pengshui", "hk": "彭水", "id": "101043200", "zh": "彭水"}, {
            "en": "qijiang",
            "hk": "綦江",
            "id": "101043300",
            "zh": "綦江"
        }, {"en": "youyang", "hk": "酉陽", "id": "101043400", "zh": "酉阳"}, {
            "en": "xiushan",
            "hk": "秀山",
            "id": "101043600",
            "zh": "秀山"
        }, {"en": "yuzhong", "hk": "渝中", "id": "101041200", "zh": "渝中"}, {
            "en": "dadukou",
            "hk": "大渡口",
            "id": "101043500",
            "zh": "大渡口"
        }, {"en": "jiangbei", "hk": "江北", "id": "101043700", "zh": "江北"}, {
            "en": "shapingba",
            "hk": "沙坪壩",
            "id": "101043800",
            "zh": "沙坪坝"
        }, {"en": "jiulongpo", "hk": "九龍坡", "id": "101043900", "zh": "九龙坡"}, {
            "en": "nanan",
            "hk": "南岸",
            "id": "101044000",
            "zh": "南岸"
        }, {"en": "kaizhou", "hk": "開州", "id": "101044100", "zh": "开州"}],
        "en": "chongqing",
        "hk": "重慶",
        "id": "7",
        "zh": "重庆"
    }], "en": "chongqing", "hk": "重慶", "id": "6", "zh": "重庆"
}, {
    "children": [{
        "children": [{"en": "hongkong", "hk": "香港", "id": "101320101", "zh": "香港"}, {
            "en": "jiulong",
            "hk": "九龍",
            "id": "101320102",
            "zh": "九龙"
        }, {"en": "xinjie", "hk": "新界", "id": "101320103", "zh": "新界"}],
        "en": "hongkong",
        "hk": "香港",
        "id": "9",
        "zh": "香港"
    }], "en": "hongkong", "hk": "香港", "id": "8", "zh": "香港"
}, {
    "children": [{
        "children": [{"en": "macao", "hk": "澳門", "id": "101330101", "zh": "澳门"}, {
            "en": "dangzidao",
            "hk": "氹仔島",
            "id": "101330102",
            "zh": "氹仔岛"
        }, {"en": "luhuandao", "hk": "路環島", "id": "101330103", "zh": "路环岛"}],
        "en": "macao",
        "hk": "澳門",
        "id": "11",
        "zh": "澳门"
    }], "en": "macao", "hk": "澳門", "id": "10", "zh": "澳门"
}, {
    "children": [{
        "children": [{"en": "Taibei", "hk": "台北", "id": "101340101", "zh": "台北"}, {
            "en": "taoyuan",
            "hk": "桃園",
            "id": "101340102",
            "zh": "桃园"
        }, {"en": "xinzhu", "hk": "新竹", "id": "101340103", "zh": "新竹"}, {
            "en": "yilan",
            "hk": "宜蘭",
            "id": "101340104",
            "zh": "宜兰"
        }], "en": "taibei", "hk": "台北", "id": "13", "zh": "台北"
    }, {
        "children": [{"en": "gaoxiong", "hk": "高雄", "id": "101340201", "zh": "高雄"}, {
            "en": "jiayi",
            "hk": "嘉義",
            "id": "101340202",
            "zh": "嘉义"
        }, {"en": "tainan", "hk": "台南", "id": "101340203", "zh": "台南"}, {
            "en": "taidong",
            "hk": "台東",
            "id": "101340204",
            "zh": "台东"
        }, {"en": "pingdong", "hk": "屏東", "id": "101340205", "zh": "屏东"}],
        "en": "gaoxiong",
        "hk": "高雄",
        "id": "14",
        "zh": "高雄"
    }, {
        "children": [{"en": "taizhong", "hk": "台中", "id": "101340401", "zh": "台中"}, {
            "en": "miaoli",
            "hk": "苗栗",
            "id": "101340402",
            "zh": "苗栗"
        }, {"en": "zhanghua", "hk": "彰化", "id": "101340403", "zh": "彰化"}, {
            "en": "nantou",
            "hk": "南投",
            "id": "101340404",
            "zh": "南投"
        }, {"en": "hualian", "hk": "花蓮", "id": "101340405", "zh": "花莲"}, {
            "en": "yunlin",
            "hk": "雲林",
            "id": "101340406",
            "zh": "云林"
        }], "en": "taizhong", "hk": "台中", "id": "15", "zh": "台中"
    }], "en": "taiwan", "hk": "台灣", "id": "12", "zh": "台湾"
}, {
    "children": [{
        "children": [{"en": "haerbin", "hk": "哈爾濱", "id": "101050101", "zh": "哈尔滨"}, {
            "en": "shuangcheng",
            "hk": "雙城",
            "id": "101050102",
            "zh": "双城"
        }, {"en": "hulan", "hk": "呼蘭", "id": "101050103", "zh": "呼兰"}, {
            "en": "acheng",
            "hk": "阿城",
            "id": "101050104",
            "zh": "阿城"
        }, {"en": "binxian", "hk": "賓縣", "id": "101050105", "zh": "宾县"}, {
            "en": "yilan",
            "hk": "依蘭",
            "id": "101050106",
            "zh": "依兰"
        }, {"en": "bayan", "hk": "巴彥", "id": "101050107", "zh": "巴彦"}, {
            "en": "tonghe",
            "hk": "通河",
            "id": "101050108",
            "zh": "通河"
        }, {"en": "fangzheng", "hk": "方正", "id": "101050109", "zh": "方正"}, {
            "en": "yanshou",
            "hk": "延壽",
            "id": "101050110",
            "zh": "延寿"
        }, {"en": "shangzhi", "hk": "尚志", "id": "101050111", "zh": "尚志"}, {
            "en": "wuchang",
            "hk": "五常",
            "id": "101050112",
            "zh": "五常"
        }, {"en": "mulan", "hk": "木蘭", "id": "101050113", "zh": "木兰"}, {
            "en": "daoli",
            "hk": "道裡",
            "id": "101050114",
            "zh": "道里"
        }, {"en": "nangang", "hk": "南崗", "id": "101050115", "zh": "南岗"}, {
            "en": "daowai",
            "hk": "道外",
            "id": "101050116",
            "zh": "道外"
        }, {"en": "pingfang", "hk": "平房", "id": "101050117", "zh": "平房"}, {
            "en": "songbei",
            "hk": "松北",
            "id": "101050118",
            "zh": "松北"
        }, {"en": "xiangfang", "hk": "香坊", "id": "101050119", "zh": "香坊"}],
        "en": "haerbin",
        "hk": "哈爾濱",
        "id": "17",
        "zh": "哈尔滨"
    }, {
        "children": [{"en": "qiqihaer", "hk": "齊齊哈爾", "id": "101050201", "zh": "齐齐哈尔"}, {
            "en": "nehe",
            "hk": "訥河",
            "id": "101050202",
            "zh": "讷河"
        }, {"en": "longjiang", "hk": "龍江", "id": "101050203", "zh": "龙江"}, {
            "en": "gannan",
            "hk": "甘南",
            "id": "101050204",
            "zh": "甘南"
        }, {"en": "fuyu", "hk": "富裕", "id": "101050205", "zh": "富裕"}, {
            "en": "yian",
            "hk": "依安",
            "id": "101050206",
            "zh": "依安"
        }, {"en": "baiquan", "hk": "拜泉", "id": "101050207", "zh": "拜泉"}, {
            "en": "keshan",
            "hk": "克山",
            "id": "101050208",
            "zh": "克山"
        }, {"en": "kedong", "hk": "克東", "id": "101050209", "zh": "克东"}, {
            "en": "tailai",
            "hk": "泰來",
            "id": "101050210",
            "zh": "泰来"
        }, {"en": "longsha", "hk": "龍沙", "id": "101050211", "zh": "龙沙"}, {
            "en": "jianhua",
            "hk": "建華",
            "id": "101050212",
            "zh": "建华"
        }, {"en": "tiefeng", "hk": "鐵鋒", "id": "101050213", "zh": "铁锋"}, {
            "en": "angangxi",
            "hk": "昂昂溪",
            "id": "101050214",
            "zh": "昂昂溪"
        }, {"en": "fulaerji", "hk": "富拉爾基", "id": "101050215", "zh": "富拉尔基"}, {
            "en": "nianzishan",
            "hk": "碾子山",
            "id": "101050216",
            "zh": "碾子山"
        }, {"en": "meilisi", "hk": "梅里斯", "id": "101050217", "zh": "梅里斯"}],
        "en": "qiqihaer",
        "hk": "齊齊哈爾",
        "id": "18",
        "zh": "齐齐哈尔"
    }, {
        "children": [{"en": "mudanjiang", "hk": "牡丹江", "id": "101050301", "zh": "牡丹江"}, {
            "en": "hailin",
            "hk": "海林",
            "id": "101050302",
            "zh": "海林"
        }, {"en": "muling", "hk": "穆棱", "id": "101050303", "zh": "穆棱"}, {
            "en": "linkou",
            "hk": "林口",
            "id": "101050304",
            "zh": "林口"
        }, {"en": "suifenhe", "hk": "綏芬河", "id": "101050305", "zh": "绥芬河"}, {
            "en": "ningan",
            "hk": "寧安",
            "id": "101050306",
            "zh": "宁安"
        }, {"en": "dongning", "hk": "東寧", "id": "101050307", "zh": "东宁"}, {
            "en": "dongan",
            "hk": "東安",
            "id": "101050308",
            "zh": "东安"
        }, {"en": "yangming", "hk": "陽明", "id": "101050309", "zh": "阳明"}, {
            "en": "aimin",
            "hk": "愛民",
            "id": "101050310",
            "zh": "爱民"
        }, {"en": "xian", "hk": "西安", "id": "101050311", "zh": "西安"}],
        "en": "mudanjiang",
        "hk": "牡丹江",
        "id": "19",
        "zh": "牡丹江"
    }, {
        "children": [{"en": "jiamusi", "hk": "佳木斯", "id": "101050401", "zh": "佳木斯"}, {
            "en": "tangyuan",
            "hk": "湯原",
            "id": "101050402",
            "zh": "汤原"
        }, {"en": "fuyuan", "hk": "撫遠", "id": "101050403", "zh": "抚远"}, {
            "en": "huachuan",
            "hk": "樺川",
            "id": "101050404",
            "zh": "桦川"
        }, {"en": "huanan", "hk": "樺南", "id": "101050405", "zh": "桦南"}, {
            "en": "tongjiang",
            "hk": "同江",
            "id": "101050406",
            "zh": "同江"
        }, {"en": "fujin", "hk": "富錦", "id": "101050407", "zh": "富锦"}, {
            "en": "xiangyang",
            "hk": "向陽",
            "id": "101050408",
            "zh": "向阳"
        }, {"en": "qianjin", "hk": "前進", "id": "101050409", "zh": "前进"}, {
            "en": "dongfeng",
            "hk": "東風",
            "id": "101050410",
            "zh": "东风"
        }, {"en": "jiaoqu", "hk": "郊區", "id": "101050411", "zh": "郊区"}],
        "en": "jiamusi",
        "hk": "佳木斯",
        "id": "20",
        "zh": "佳木斯"
    }, {
        "children": [{"en": "suihua", "hk": "綏化", "id": "101050501", "zh": "绥化"}, {
            "en": "zhaodong",
            "hk": "肇東",
            "id": "101050502",
            "zh": "肇东"
        }, {"en": "anda", "hk": "安達", "id": "101050503", "zh": "安达"}, {
            "en": "hailun",
            "hk": "海倫",
            "id": "101050504",
            "zh": "海伦"
        }, {"en": "mingshui", "hk": "明水", "id": "101050505", "zh": "明水"}, {
            "en": "wangkui",
            "hk": "望奎",
            "id": "101050506",
            "zh": "望奎"
        }, {"en": "lanxi", "hk": "蘭西", "id": "101050507", "zh": "兰西"}, {
            "en": "qinggang",
            "hk": "青岡",
            "id": "101050508",
            "zh": "青冈"
        }, {"en": "qingan", "hk": "慶安", "id": "101050509", "zh": "庆安"}, {
            "en": "suiling",
            "hk": "綏棱",
            "id": "101050510",
            "zh": "绥棱"
        }, {"en": "beilin", "hk": "北林", "id": "101050511", "zh": "北林"}],
        "en": "suihua",
        "hk": "綏化",
        "id": "21",
        "zh": "绥化"
    }, {
        "children": [{"en": "heihe", "hk": "黑河", "id": "101050601", "zh": "黑河"}, {
            "en": "nenjiang",
            "hk": "嫩江",
            "id": "101050602",
            "zh": "嫩江"
        }, {"en": "sunwu", "hk": "孫吳", "id": "101050603", "zh": "孙吴"}, {
            "en": "xunke",
            "hk": "遜克",
            "id": "101050604",
            "zh": "逊克"
        }, {"en": "wudalianchi", "hk": "五大連池", "id": "101050605", "zh": "五大连池"}, {
            "en": "beian",
            "hk": "北安",
            "id": "101050606",
            "zh": "北安"
        }, {"en": "aihui", "hk": "愛輝", "id": "101050607", "zh": "爱辉"}],
        "en": "heihe",
        "hk": "黑河",
        "id": "22",
        "zh": "黑河"
    }, {
        "children": [{"en": "daxinganling", "hk": "大興安嶺", "id": "101050701", "zh": "大兴安岭"}, {
            "en": "tahe",
            "hk": "塔河",
            "id": "101050702",
            "zh": "塔河"
        }, {"en": "mohe", "hk": "漠河", "id": "101050703", "zh": "漠河"}, {
            "en": "huma",
            "hk": "呼瑪",
            "id": "101050704",
            "zh": "呼玛"
        }, {"en": "huzhong", "hk": "呼中", "id": "101050705", "zh": "呼中"}, {
            "en": "xinlin",
            "hk": "新林",
            "id": "101050706",
            "zh": "新林"
        }, {"en": "jiagedaqi", "hk": "加格達奇", "id": "101050708", "zh": "加格达奇"}],
        "en": "daxinganling",
        "hk": "大興安嶺",
        "id": "23",
        "zh": "大兴安岭"
    }, {
        "children": [{"en": "yichun", "hk": "伊春", "id": "101050801", "zh": "伊春"}, {
            "en": "wuyiling",
            "hk": "烏伊岭",
            "id": "101050802",
            "zh": "乌伊岭"
        }, {"en": "wuying", "hk": "五營", "id": "101050803", "zh": "五营"}, {
            "en": "tieli",
            "hk": "鐵力",
            "id": "101050804",
            "zh": "铁力"
        }, {"en": "jiayin", "hk": "嘉蔭", "id": "101050805", "zh": "嘉荫"}, {
            "en": "nancha",
            "hk": "南岔",
            "id": "101050806",
            "zh": "南岔"
        }, {"en": "youhao", "hk": "友好", "id": "101050807", "zh": "友好"}, {
            "en": "xilin",
            "hk": "西林",
            "id": "101050808",
            "zh": "西林"
        }, {"en": "cuiluan", "hk": "翠巒", "id": "101050809", "zh": "翠峦"}, {
            "en": "xinqing",
            "hk": "新青",
            "id": "101050810",
            "zh": "新青"
        }, {"en": "meixi", "hk": "美溪", "id": "101050811", "zh": "美溪"}, {
            "en": "jinshantun",
            "hk": "金山屯",
            "id": "101050812",
            "zh": "金山屯"
        }, {"en": "wumahe", "hk": "烏馬河", "id": "101050813", "zh": "乌马河"}, {
            "en": "tangwanghe",
            "hk": "湯旺河",
            "id": "101050814",
            "zh": "汤旺河"
        }, {"en": "dailing", "hk": "帶嶺", "id": "101050815", "zh": "带岭"}, {
            "en": "hongxing",
            "hk": "紅星",
            "id": "101050816",
            "zh": "红星"
        }, {"en": "shangganling", "hk": "上甘嶺", "id": "101050817", "zh": "上甘岭"}],
        "en": "yichun",
        "hk": "伊春",
        "id": "24",
        "zh": "伊春"
    }, {
        "children": [{"en": "daqing", "hk": "大慶", "id": "101050901", "zh": "大庆"}, {
            "en": "lindian",
            "hk": "林甸",
            "id": "101050902",
            "zh": "林甸"
        }, {"en": "zhaozhou", "hk": "肇州", "id": "101050903", "zh": "肇州"}, {
            "en": "zhaoyuan",
            "hk": "肇源",
            "id": "101050904",
            "zh": "肇源"
        }, {"en": "duerbote", "hk": "杜爾伯特", "id": "101050905", "zh": "杜尔伯特"}, {
            "en": "saertu",
            "hk": "薩爾圖",
            "id": "101050906",
            "zh": "萨尔图"
        }, {"en": "longfeng", "hk": "龍鳳", "id": "101050907", "zh": "龙凤"}, {
            "en": "ranghulu",
            "hk": "讓胡路",
            "id": "101050908",
            "zh": "让胡路"
        }, {"en": "honggang", "hk": "紅崗", "id": "101050909", "zh": "红岗"}, {
            "en": "datong",
            "hk": "大同",
            "id": "101050910",
            "zh": "大同"
        }], "en": "daqing", "hk": "大慶", "id": "25", "zh": "大庆"
    }, {
        "children": [{"en": "qitaihe", "hk": "七台河", "id": "101051002", "zh": "七台河"}, {
            "en": "boli",
            "hk": "勃利",
            "id": "101051003",
            "zh": "勃利"
        }, {"en": "xinxing", "hk": "新興", "id": "101051001", "zh": "新兴"}, {
            "en": "taoshan",
            "hk": "桃山",
            "id": "101051004",
            "zh": "桃山"
        }, {"en": "qiezihe", "hk": "茄子河", "id": "101051005", "zh": "茄子河"}],
        "en": "qitaihe",
        "hk": "七台河",
        "id": "26",
        "zh": "七台河"
    }, {
        "children": [{"en": "jixi", "hk": "雞西", "id": "101051101", "zh": "鸡西"}, {
            "en": "hulin",
            "hk": "虎林",
            "id": "101051102",
            "zh": "虎林"
        }, {"en": "mishan", "hk": "密山", "id": "101051103", "zh": "密山"}, {
            "en": "jidong",
            "hk": "雞東",
            "id": "101051104",
            "zh": "鸡东"
        }, {"en": "jiguan", "hk": "雞冠", "id": "101051105", "zh": "鸡冠"}, {
            "en": "hengshan",
            "hk": "恆山",
            "id": "101051106",
            "zh": "恒山"
        }, {"en": "didao", "hk": "滴道", "id": "101051107", "zh": "滴道"}, {
            "en": "lishu",
            "hk": "梨樹",
            "id": "101051108",
            "zh": "梨树"
        }, {"en": "chengzihe", "hk": "城子河", "id": "101051109", "zh": "城子河"}, {
            "en": "mashan",
            "hk": "麻山",
            "id": "101051110",
            "zh": "麻山"
        }], "en": "jixi", "hk": "雞西", "id": "27", "zh": "鸡西"
    }, {
        "children": [{"en": "hegang", "hk": "鶴崗", "id": "101051201", "zh": "鹤岗"}, {
            "en": "suibin",
            "hk": "綏濱",
            "id": "101051202",
            "zh": "绥滨"
        }, {"en": "luobei", "hk": "蘿北", "id": "101051203", "zh": "萝北"}, {
            "en": "xiangyang",
            "hk": "向陽",
            "id": "101051204",
            "zh": "向阳"
        }, {"en": "gongnong", "hk": "工農", "id": "101051205", "zh": "工农"}, {
            "en": "nanshan",
            "hk": "南山",
            "id": "101051206",
            "zh": "南山"
        }, {"en": "xingan", "hk": "興安", "id": "101051207", "zh": "兴安"}, {
            "en": "dongshan",
            "hk": "東山",
            "id": "101051208",
            "zh": "东山"
        }, {"en": "xingshan", "hk": "興山", "id": "101051209", "zh": "兴山"}],
        "en": "hegang",
        "hk": "鶴崗",
        "id": "28",
        "zh": "鹤岗"
    }, {
        "children": [{"en": "shuangyashan", "hk": "雙鴨山", "id": "101051301", "zh": "双鸭山"}, {
            "en": "jixian",
            "hk": "集賢",
            "id": "101051302",
            "zh": "集贤"
        }, {"en": "baoqing", "hk": "寶清", "id": "101051303", "zh": "宝清"}, {
            "en": "raohe",
            "hk": "饒河",
            "id": "101051304",
            "zh": "饶河"
        }, {"en": "youyi", "hk": "友誼", "id": "101051305", "zh": "友谊"}, {
            "en": "jianshan",
            "hk": "尖山",
            "id": "101051306",
            "zh": "尖山"
        }, {"en": "lingdong", "hk": "嶺東", "id": "101051307", "zh": "岭东"}, {
            "en": "sifangtai",
            "hk": "四方台",
            "id": "101051308",
            "zh": "四方台"
        }, {"en": "baoshan", "hk": "寶山", "id": "101051309", "zh": "宝山"}],
        "en": "shuangyashan",
        "hk": "雙鴨山",
        "id": "29",
        "zh": "双鸭山"
    }], "en": "heilongjiang", "hk": "黑龍江", "id": "16", "zh": "黑龙江"
}, {
    "children": [{
        "children": [{"en": "changchun", "hk": "長春", "id": "101060101", "zh": "长春"}, {
            "en": "nongan",
            "hk": "農安",
            "id": "101060102",
            "zh": "农安"
        }, {"en": "dehui", "hk": "德惠", "id": "101060103", "zh": "德惠"}, {
            "en": "jiutai",
            "hk": "九台",
            "id": "101060104",
            "zh": "九台"
        }, {"en": "yushu", "hk": "榆樹", "id": "101060105", "zh": "榆树"}, {
            "en": "shuangyang",
            "hk": "雙陽",
            "id": "101060106",
            "zh": "双阳"
        }, {"en": "erdao", "hk": "二道", "id": "101060107", "zh": "二道"}, {
            "en": "nanguan",
            "hk": "南關",
            "id": "101060108",
            "zh": "南关"
        }, {"en": "kuancheng", "hk": "寬城", "id": "101060109", "zh": "宽城"}, {
            "en": "chaoyang",
            "hk": "朝陽",
            "id": "101060110",
            "zh": "朝阳"
        }, {"en": "lvyuan", "hk": "綠園", "id": "101060111", "zh": "绿园"}],
        "en": "changchun",
        "hk": "長春",
        "id": "31",
        "zh": "长春"
    }, {
        "children": [{"en": "jilin", "hk": "吉林", "id": "101060201", "zh": "吉林"}, {
            "en": "shulan",
            "hk": "舒蘭",
            "id": "101060202",
            "zh": "舒兰"
        }, {"en": "yongji", "hk": "永吉", "id": "101060203", "zh": "永吉"}, {
            "en": "jiaohe",
            "hk": "蛟河",
            "id": "101060204",
            "zh": "蛟河"
        }, {"en": "panshi", "hk": "磐石", "id": "101060205", "zh": "磐石"}, {
            "en": "huadian",
            "hk": "樺甸",
            "id": "101060206",
            "zh": "桦甸"
        }, {"en": "changyi", "hk": "昌邑", "id": "101060207", "zh": "昌邑"}, {
            "en": "longtan",
            "hk": "龍潭",
            "id": "101060208",
            "zh": "龙潭"
        }, {"en": "chuanying", "hk": "船營", "id": "101060209", "zh": "船营"}, {
            "en": "fengman",
            "hk": "豐滿",
            "id": "101060210",
            "zh": "丰满"
        }], "en": "jilin", "hk": "吉林", "id": "32", "zh": "吉林"
    }, {
        "children": [{"en": "siping", "hk": "四平", "id": "101060401", "zh": "四平"}, {
            "en": "shuangliao",
            "hk": "雙遼",
            "id": "101060402",
            "zh": "双辽"
        }, {"en": "lishu", "hk": "梨樹", "id": "101060403", "zh": "梨树"}, {
            "en": "gongzhuling",
            "hk": "公主嶺",
            "id": "101060404",
            "zh": "公主岭"
        }, {"en": "yitong", "hk": "伊通", "id": "101060405", "zh": "伊通"}, {
            "en": "tiexi",
            "hk": "鐵西",
            "id": "101060406",
            "zh": "铁西"
        }, {"en": "tiedong", "hk": "鐵東", "id": "101060407", "zh": "铁东"}],
        "en": "siping",
        "hk": "四平",
        "id": "33",
        "zh": "四平"
    }, {
        "children": [{"en": "tonghua", "hk": "通化", "id": "101060501", "zh": "通化"}, {
            "en": "meihekou",
            "hk": "梅河口",
            "id": "101060502",
            "zh": "梅河口"
        }, {"en": "liuhe", "hk": "柳河", "id": "101060503", "zh": "柳河"}, {
            "en": "huinan",
            "hk": "輝南",
            "id": "101060504",
            "zh": "辉南"
        }, {"en": "jian", "hk": "集安", "id": "101060505", "zh": "集安"}, {
            "en": "tonghuaxian",
            "hk": "通化縣",
            "id": "101060506",
            "zh": "通化县"
        }, {"en": "dongchang", "hk": "東昌", "id": "101060507", "zh": "东昌"}, {
            "en": "erdaojiang",
            "hk": "二道江",
            "id": "101060508",
            "zh": "二道江"
        }], "en": "tonghua", "hk": "通化", "id": "34", "zh": "通化"
    }, {
        "children": [{"en": "baicheng", "hk": "白城", "id": "101060601", "zh": "白城"}, {
            "en": "taonan",
            "hk": "洮南",
            "id": "101060602",
            "zh": "洮南"
        }, {"en": "daan", "hk": "大安", "id": "101060603", "zh": "大安"}, {
            "en": "zhenlai",
            "hk": "鎮賚",
            "id": "101060604",
            "zh": "镇赉"
        }, {"en": "tongyu", "hk": "通榆", "id": "101060605", "zh": "通榆"}, {
            "en": "taobei",
            "hk": "洮北",
            "id": "101060606",
            "zh": "洮北"
        }], "en": "baicheng", "hk": "白城", "id": "35", "zh": "白城"
    }, {
        "children": [{"en": "liaoyuan", "hk": "遼源", "id": "101060701", "zh": "辽源"}, {
            "en": "dongfeng",
            "hk": "東豐",
            "id": "101060702",
            "zh": "东丰"
        }, {"en": "dongliao", "hk": "東遼", "id": "101060703", "zh": "东辽"}, {
            "en": "longshan",
            "hk": "龍山",
            "id": "101060704",
            "zh": "龙山"
        }, {"en": "xian", "hk": "西安", "id": "101060705", "zh": "西安"}],
        "en": "liaoyuan",
        "hk": "遼源",
        "id": "36",
        "zh": "辽源"
    }, {
        "children": [{"en": "songyuan", "hk": "松原", "id": "101060801", "zh": "松原"}, {
            "en": "qianan",
            "hk": "乾安",
            "id": "101060802",
            "zh": "乾安"
        }, {"en": "qianguo", "hk": "前郭", "id": "101060803", "zh": "前郭"}, {
            "en": "changling",
            "hk": "長嶺",
            "id": "101060804",
            "zh": "长岭"
        }, {"en": "fuyu", "hk": "扶餘", "id": "101060805", "zh": "扶余"}, {
            "en": "ningjiang",
            "hk": "寧江",
            "id": "101060806",
            "zh": "宁江"
        }], "en": "songyuan", "hk": "松原", "id": "37", "zh": "松原"
    }, {
        "children": [{"en": "baishan", "hk": "白山", "id": "101060901", "zh": "白山"}, {
            "en": "jingyu",
            "hk": "靖宇",
            "id": "101060902",
            "zh": "靖宇"
        }, {"en": "linjiang", "hk": "臨江", "id": "101060903", "zh": "临江"}, {
            "en": "changbai",
            "hk": "長白",
            "id": "101060905",
            "zh": "长白"
        }, {"en": "fusong", "hk": "撫松", "id": "101060906", "zh": "抚松"}, {
            "en": "jiangyuan",
            "hk": "江源",
            "id": "101060907",
            "zh": "江源"
        }, {"en": "hunjiang", "hk": "渾江", "id": "101060908", "zh": "浑江"}, {
            "en": "donggang",
            "hk": "東崗",
            "id": "101060904",
            "zh": "东岗"
        }], "en": "baishan", "hk": "白山", "id": "38", "zh": "白山"
    }, {
        "children": [{"en": "yanji", "hk": "延吉", "id": "101060301", "zh": "延吉"}, {
            "en": "dunhua",
            "hk": "敦化",
            "id": "101060302",
            "zh": "敦化"
        }, {"en": "antu", "hk": "安圖", "id": "101060303", "zh": "安图"}, {
            "en": "wangqing",
            "hk": "汪清",
            "id": "101060304",
            "zh": "汪清"
        }, {"en": "helong", "hk": "和龍", "id": "101060305", "zh": "和龙"}, {
            "en": "longjing",
            "hk": "龍井",
            "id": "101060307",
            "zh": "龙井"
        }, {"en": "hunchun", "hk": "琿春", "id": "101060308", "zh": "珲春"}, {
            "en": "tumen",
            "hk": "圖們",
            "id": "101060309",
            "zh": "图们"
        }, {"en": "yanbian", "hk": "延邊", "id": "101060306", "zh": "延边"}],
        "en": "yanbian",
        "hk": "延邊",
        "id": "39",
        "zh": "延边"
    }], "en": "jilin", "hk": "吉林", "id": "30", "zh": "吉林"
}, {
    "children": [{
        "children": [{"en": "shenyang", "hk": "瀋陽", "id": "101070101", "zh": "沈阳"}, {
            "en": "liaozhong",
            "hk": "遼中",
            "id": "101070103",
            "zh": "辽中"
        }, {"en": "kangping", "hk": "康平", "id": "101070104", "zh": "康平"}, {
            "en": "faku",
            "hk": "法庫",
            "id": "101070105",
            "zh": "法库"
        }, {"en": "xinmin", "hk": "新民", "id": "101070106", "zh": "新民"}, {
            "en": "hunnan",
            "hk": "渾南",
            "id": "101070102",
            "zh": "浑南"
        }, {"en": "heping", "hk": "和平", "id": "101070107", "zh": "和平"}, {
            "en": "shenhe",
            "hk": "沈河",
            "id": "101070108",
            "zh": "沈河"
        }, {"en": "dadong", "hk": "大東", "id": "101070109", "zh": "大东"}, {
            "en": "huanggu",
            "hk": "皇姑",
            "id": "101070110",
            "zh": "皇姑"
        }, {"en": "tiexi", "hk": "鐵西", "id": "101070111", "zh": "铁西"}, {
            "en": "sujiatun",
            "hk": "蘇家屯",
            "id": "101070112",
            "zh": "苏家屯"
        }, {"en": "shenbeixinqu", "hk": "沈北新區", "id": "101070113", "zh": "沈北新区"}, {
            "en": "yuhong",
            "hk": "於洪",
            "id": "101070114",
            "zh": "于洪"
        }], "en": "shenyang", "hk": "瀋陽", "id": "41", "zh": "沈阳"
    }, {
        "children": [{"en": "dalian", "hk": "大連", "id": "101070201", "zh": "大连"}, {
            "en": "wafangdian",
            "hk": "瓦房店",
            "id": "101070202",
            "zh": "瓦房店"
        }, {"en": "jinzhou", "hk": "金州", "id": "101070203", "zh": "金州"}, {
            "en": "pulandian",
            "hk": "普蘭店",
            "id": "101070204",
            "zh": "普兰店"
        }, {"en": "lvshun", "hk": "旅順", "id": "101070205", "zh": "旅顺"}, {
            "en": "changhai",
            "hk": "長海",
            "id": "101070206",
            "zh": "长海"
        }, {"en": "zhuanghe", "hk": "莊河", "id": "101070207", "zh": "庄河"}, {
            "en": "zhongshan",
            "hk": "中山",
            "id": "101070208",
            "zh": "中山"
        }, {"en": "xigang", "hk": "西崗", "id": "101070209", "zh": "西岗"}, {
            "en": "shahekou",
            "hk": "沙河口",
            "id": "101070210",
            "zh": "沙河口"
        }, {"en": "ganjingzi", "hk": "甘井子", "id": "101070211", "zh": "甘井子"}],
        "en": "dalian",
        "hk": "大連",
        "id": "42",
        "zh": "大连"
    }, {
        "children": [{"en": "anshan", "hk": "鞍山", "id": "101070301", "zh": "鞍山"}, {
            "en": "taian",
            "hk": "台安",
            "id": "101070302",
            "zh": "台安"
        }, {"en": "xiuyan", "hk": "岫岩", "id": "101070303", "zh": "岫岩"}, {
            "en": "haicheng",
            "hk": "海城",
            "id": "101070304",
            "zh": "海城"
        }, {"en": "tiedong", "hk": "鐵東", "id": "101070305", "zh": "铁东"}, {
            "en": "tiexi",
            "hk": "鐵西",
            "id": "101070306",
            "zh": "铁西"
        }, {"en": "lishan", "hk": "立山", "id": "101070307", "zh": "立山"}, {
            "en": "qianshan",
            "hk": "千山",
            "id": "101070308",
            "zh": "千山"
        }], "en": "anshan", "hk": "鞍山", "id": "43", "zh": "鞍山"
    }, {
        "children": [{"en": "fushun", "hk": "撫順", "id": "101070401", "zh": "抚顺"}, {
            "en": "xinbin",
            "hk": "新賓",
            "id": "101070402",
            "zh": "新宾"
        }, {"en": "qingyuan", "hk": "清原", "id": "101070403", "zh": "清原"}, {
            "en": "xinfu",
            "hk": "新撫",
            "id": "101070405",
            "zh": "新抚"
        }, {"en": "dongzhou", "hk": "東洲", "id": "101070406", "zh": "东洲"}, {
            "en": "wanghua",
            "hk": "望花",
            "id": "101070407",
            "zh": "望花"
        }, {"en": "shuncheng", "hk": "順城", "id": "101070408", "zh": "顺城"}],
        "en": "fushun",
        "hk": "撫順",
        "id": "44",
        "zh": "抚顺"
    }, {
        "children": [{"en": "benxi", "hk": "本溪", "id": "101070501", "zh": "本溪"}, {
            "en": "benxixian",
            "hk": "本溪縣",
            "id": "101070502",
            "zh": "本溪县"
        }, {"en": "huanren", "hk": "桓仁", "id": "101070504", "zh": "桓仁"}, {
            "en": "pingshan",
            "hk": "平山",
            "id": "101070503",
            "zh": "平山"
        }, {"en": "xihu", "hk": "溪湖", "id": "101070505", "zh": "溪湖"}, {
            "en": "mingshan",
            "hk": "明山",
            "id": "101070506",
            "zh": "明山"
        }, {"en": "nanfen", "hk": "南芬", "id": "101070507", "zh": "南芬"}],
        "en": "benxi",
        "hk": "本溪",
        "id": "45",
        "zh": "本溪"
    }, {
        "children": [{"en": "dandong", "hk": "丹東", "id": "101070601", "zh": "丹东"}, {
            "en": "fengcheng",
            "hk": "鳳城",
            "id": "101070602",
            "zh": "凤城"
        }, {"en": "kuandian", "hk": "寬甸", "id": "101070603", "zh": "宽甸"}, {
            "en": "donggang",
            "hk": "東港",
            "id": "101070604",
            "zh": "东港"
        }, {"en": "yuanbao", "hk": "元寶", "id": "101070605", "zh": "元宝"}, {
            "en": "zhenxing",
            "hk": "振興",
            "id": "101070606",
            "zh": "振兴"
        }, {"en": "zhenan", "hk": "振安", "id": "101070607", "zh": "振安"}],
        "en": "dandong",
        "hk": "丹東",
        "id": "46",
        "zh": "丹东"
    }, {
        "children": [{"en": "jinzhou", "hk": "錦州", "id": "101070701", "zh": "锦州"}, {
            "en": "linghai",
            "hk": "凌海",
            "id": "101070702",
            "zh": "凌海"
        }, {"en": "yixian", "hk": "義縣", "id": "101070704", "zh": "义县"}, {
            "en": "heishan",
            "hk": "黑山",
            "id": "101070705",
            "zh": "黑山"
        }, {"en": "beizhen", "hk": "北鎮", "id": "101070706", "zh": "北镇"}, {
            "en": "guta",
            "hk": "古塔",
            "id": "101070703",
            "zh": "古塔"
        }, {"en": "linghe", "hk": "凌河", "id": "101070707", "zh": "凌河"}, {
            "en": "taihe",
            "hk": "太和",
            "id": "101070708",
            "zh": "太和"
        }], "en": "jinzhou", "hk": "錦州", "id": "47", "zh": "锦州"
    }, {
        "children": [{"en": "yingkou", "hk": "營口", "id": "101070801", "zh": "营口"}, {
            "en": "dashiqiao",
            "hk": "大石橋",
            "id": "101070802",
            "zh": "大石桥"
        }, {"en": "gaizhou", "hk": "蓋州", "id": "101070803", "zh": "盖州"}, {
            "en": "zhanqian",
            "hk": "站前",
            "id": "101070804",
            "zh": "站前"
        }, {"en": "xishi", "hk": "西市", "id": "101070805", "zh": "西市"}, {
            "en": "bayuquan",
            "hk": "鮁魚圈",
            "id": "101070806",
            "zh": "鲅鱼圈"
        }, {"en": "laobian", "hk": "老邊", "id": "101070807", "zh": "老边"}],
        "en": "yingkou",
        "hk": "營口",
        "id": "48",
        "zh": "营口"
    }, {
        "children": [{"en": "fuxin", "hk": "阜新", "id": "101070901", "zh": "阜新"}, {
            "en": "zhangwu",
            "hk": "彰武",
            "id": "101070902",
            "zh": "彰武"
        }, {"en": "haizhou", "hk": "海州", "id": "101070903", "zh": "海州"}, {
            "en": "xinqiu",
            "hk": "新邱",
            "id": "101070904",
            "zh": "新邱"
        }, {"en": "taiping", "hk": "太平", "id": "101070905", "zh": "太平"}, {
            "en": "qinghemen",
            "hk": "清河門",
            "id": "101070906",
            "zh": "清河门"
        }, {"en": "xihe", "hk": "細河", "id": "101070907", "zh": "细河"}], "en": "fuxin", "hk": "阜新", "id": "49", "zh": "阜新"
    }, {
        "children": [{"en": "liaoyang", "hk": "遼陽", "id": "101071001", "zh": "辽阳"}, {
            "en": "liaoyangxian",
            "hk": "遼陽縣",
            "id": "101071002",
            "zh": "辽阳县"
        }, {"en": "dengta", "hk": "燈塔", "id": "101071003", "zh": "灯塔"}, {
            "en": "gongchangling",
            "hk": "弓長嶺",
            "id": "101071004",
            "zh": "弓长岭"
        }, {"en": "baita", "hk": "白塔", "id": "101071005", "zh": "白塔"}, {
            "en": "wensheng",
            "hk": "文聖",
            "id": "101071006",
            "zh": "文圣"
        }, {"en": "hongwei", "hk": "宏偉", "id": "101071007", "zh": "宏伟"}, {
            "en": "taizihe",
            "hk": "太子河",
            "id": "101071008",
            "zh": "太子河"
        }], "en": "liaoyang", "hk": "遼陽", "id": "50", "zh": "辽阳"
    }, {
        "children": [{"en": "tieling", "hk": "鐵嶺", "id": "101071101", "zh": "铁岭"}, {
            "en": "kaiyuan",
            "hk": "開原",
            "id": "101071102",
            "zh": "开原"
        }, {"en": "changtu", "hk": "昌圖", "id": "101071103", "zh": "昌图"}, {
            "en": "xifeng",
            "hk": "西豐",
            "id": "101071104",
            "zh": "西丰"
        }, {"en": "tiefa", "hk": "調兵山", "id": "101071105", "zh": "调兵山"}, {
            "en": "yinzhou",
            "hk": "銀州",
            "id": "101071106",
            "zh": "银州"
        }, {"en": "qinghe", "hk": "清河", "id": "101071107", "zh": "清河"}],
        "en": "tieling",
        "hk": "鐵嶺",
        "id": "51",
        "zh": "铁岭"
    }, {
        "children": [{"en": "chaoyang", "hk": "朝陽", "id": "101071201", "zh": "朝阳"}, {
            "en": "lingyuan",
            "hk": "凌源",
            "id": "101071203",
            "zh": "凌源"
        }, {"en": "kazuo", "hk": "喀左", "id": "101071204", "zh": "喀左"}, {
            "en": "beipiao",
            "hk": "北票",
            "id": "101071205",
            "zh": "北票"
        }, {"en": "jianpingxian", "hk": "建平縣", "id": "101071207", "zh": "建平县"}, {
            "en": "shuangta",
            "hk": "雙塔",
            "id": "101071202",
            "zh": "双塔"
        }, {"en": "longcheng", "hk": "龍城", "id": "101071206", "zh": "龙城"}],
        "en": "chaoyang",
        "hk": "朝陽",
        "id": "52",
        "zh": "朝阳"
    }, {
        "children": [{"en": "panjin", "hk": "盤錦", "id": "101071301", "zh": "盘锦"}, {
            "en": "dawa",
            "hk": "大窪",
            "id": "101071302",
            "zh": "大洼"
        }, {"en": "panshan", "hk": "盤山", "id": "101071303", "zh": "盘山"}, {
            "en": "shuangtaizi",
            "hk": "雙台子",
            "id": "101071304",
            "zh": "双台子"
        }, {"en": "xinglongtai", "hk": "興隆台", "id": "101071305", "zh": "兴隆台"}],
        "en": "panjin",
        "hk": "盤錦",
        "id": "53",
        "zh": "盘锦"
    }, {
        "children": [{"en": "huludao", "hk": "葫蘆島", "id": "101071401", "zh": "葫芦岛"}, {
            "en": "jianchang",
            "hk": "建昌",
            "id": "101071402",
            "zh": "建昌"
        }, {"en": "suizhong", "hk": "綏中", "id": "101071403", "zh": "绥中"}, {
            "en": "xingcheng",
            "hk": "興城",
            "id": "101071404",
            "zh": "兴城"
        }, {"en": "lianshan", "hk": "連山", "id": "101071405", "zh": "连山"}, {
            "en": "longgang",
            "hk": "龍港",
            "id": "101071406",
            "zh": "龙港"
        }, {"en": "nanpiao", "hk": "南票", "id": "101071407", "zh": "南票"}],
        "en": "huludao",
        "hk": "葫蘆島",
        "id": "54",
        "zh": "葫芦岛"
    }], "en": "liaoning", "hk": "遼寧", "id": "40", "zh": "辽宁"
}, {
    "children": [{
        "children": [{"en": "huhehaote", "hk": "呼和浩特", "id": "101080101", "zh": "呼和浩特"}, {
            "en": "tuzuoqi",
            "hk": "土左旗",
            "id": "101080102",
            "zh": "土左旗"
        }, {"en": "tuoxian", "hk": "託縣", "id": "101080103", "zh": "托县"}, {
            "en": "helin",
            "hk": "和林",
            "id": "101080104",
            "zh": "和林"
        }, {"en": "qingshuihe", "hk": "清水河", "id": "101080105", "zh": "清水河"}, {
            "en": "saihan",
            "hk": "賽罕",
            "id": "101080106",
            "zh": "赛罕"
        }, {"en": "wuchuan", "hk": "武川", "id": "101080107", "zh": "武川"}, {
            "en": "xincheng",
            "hk": "新城",
            "id": "101080108",
            "zh": "新城"
        }, {"en": "huimin", "hk": "回民", "id": "101080109", "zh": "回民"}, {
            "en": "yuquan",
            "hk": "玉泉",
            "id": "101080110",
            "zh": "玉泉"
        }], "en": "huhehaote", "hk": "呼和浩特", "id": "56", "zh": "呼和浩特"
    }, {
        "children": [{"en": "baotou", "hk": "包頭", "id": "101080201", "zh": "包头"}, {
            "en": "baiyunebo",
            "hk": "白雲鄂博",
            "id": "101080202",
            "zh": "白云鄂博"
        }, {"en": "tuyouqi", "hk": "土右旗", "id": "101080204", "zh": "土右旗"}, {
            "en": "guyang",
            "hk": "固陽",
            "id": "101080205",
            "zh": "固阳"
        }, {"en": "damaoqi", "hk": "達茂旗", "id": "101080206", "zh": "达茂旗"}, {
            "en": "donghe",
            "hk": "東河",
            "id": "101080208",
            "zh": "东河"
        }, {"en": "kundoulun", "hk": "昆都崙", "id": "101080209", "zh": "昆都仑"}, {
            "en": "qingshan",
            "hk": "青山",
            "id": "101080210",
            "zh": "青山"
        }, {"en": "shiguai", "hk": "石拐", "id": "101080211", "zh": "石拐"}, {
            "en": "jiuyuan",
            "hk": "九原",
            "id": "101080212",
            "zh": "九原"
        }, {"en": "mandula", "hk": "滿都拉", "id": "101080203", "zh": "满都拉"}, {
            "en": "xilamuren",
            "hk": "希拉穆仁",
            "id": "101080207",
            "zh": "希拉穆仁"
        }], "en": "baotou", "hk": "包頭", "id": "57", "zh": "包头"
    }, {
        "children": [{"en": "wuhai", "hk": "烏海", "id": "101080301", "zh": "乌海"}, {
            "en": "haibowan",
            "hk": "海勃灣",
            "id": "101080302",
            "zh": "海勃湾"
        }, {"en": "hainan", "hk": "海南", "id": "101080303", "zh": "海南"}, {
            "en": "wuda",
            "hk": "烏達",
            "id": "101080304",
            "zh": "乌达"
        }], "en": "wuhai", "hk": "烏海", "id": "58", "zh": "乌海"
    }, {
        "children": [{"en": "tongliao", "hk": "通遼", "id": "101080501", "zh": "通辽"}, {
            "en": "kezuozhongqi",
            "hk": "科左中旗",
            "id": "101080503",
            "zh": "科左中旗"
        }, {"en": "kezuohouqi", "hk": "科左後旗", "id": "101080504", "zh": "科左后旗"}, {
            "en": "kailu",
            "hk": "開魯",
            "id": "101080506",
            "zh": "开鲁"
        }, {"en": "kulun", "hk": "庫倫", "id": "101080507", "zh": "库伦"}, {
            "en": "naiman",
            "hk": "奈曼",
            "id": "101080508",
            "zh": "奈曼"
        }, {"en": "zhalute", "hk": "扎魯特", "id": "101080509", "zh": "扎鲁特"}, {
            "en": "huolinguole",
            "hk": "霍林郭勒",
            "id": "101080512",
            "zh": "霍林郭勒"
        }, {"en": "keerqin", "hk": "科爾沁", "id": "101080510", "zh": "科尔沁"}, {
            "en": "shebotu",
            "hk": "舍伯吐",
            "id": "101080502",
            "zh": "舍伯吐"
        }, {"en": "qinglongshan", "hk": "青龍山", "id": "101080505", "zh": "青龙山"}, {
            "en": "bayaertuhushuo",
            "hk": "巴雅爾吐胡碩",
            "id": "101080511",
            "zh": "巴雅尔吐胡硕"
        }], "en": "tongliao", "hk": "通遼", "id": "59", "zh": "通辽"
    }, {
        "children": [{"en": "chifeng", "hk": "赤峰", "id": "101080601", "zh": "赤峰"}, {
            "en": "aluqi",
            "hk": "阿魯旗",
            "id": "101080603",
            "zh": "阿鲁旗"
        }, {"en": "balinzuoqi", "hk": "巴林左旗", "id": "101080605", "zh": "巴林左旗"}, {
            "en": "balinyouqi",
            "hk": "巴林右旗",
            "id": "101080606",
            "zh": "巴林右旗"
        }, {"en": "linxi", "hk": "林西", "id": "101080607", "zh": "林西"}, {
            "en": "keshiketeng",
            "hk": "克什克騰",
            "id": "101080608",
            "zh": "克什克腾"
        }, {"en": "wengniute", "hk": "翁牛特", "id": "101080609", "zh": "翁牛特"}, {
            "en": "kalaqin",
            "hk": "喀喇沁",
            "id": "101080611",
            "zh": "喀喇沁"
        }, {"en": "ningcheng", "hk": "寧城", "id": "101080613", "zh": "宁城"}, {
            "en": "aohan",
            "hk": "敖漢",
            "id": "101080614",
            "zh": "敖汉"
        }, {"en": "hongshan", "hk": "紅山", "id": "101080602", "zh": "红山"}, {
            "en": "yuanbaoshan",
            "hk": "元寶山",
            "id": "101080616",
            "zh": "元宝山"
        }, {"en": "songshan", "hk": "松山", "id": "101080617", "zh": "松山"}, {
            "en": "gangzi",
            "hk": "崗子",
            "id": "101080610",
            "zh": "岗子"
        }, {"en": "balihan", "hk": "八裡罕", "id": "101080612", "zh": "八里罕"}, {
            "en": "fuhe",
            "hk": "富河",
            "id": "101080618",
            "zh": "富河"
        }, {"en": "baoguotu", "hk": "寶國圖", "id": "101080619", "zh": "宝国图"}],
        "en": "chifeng",
        "hk": "赤峰",
        "id": "60",
        "zh": "赤峰"
    }, {
        "children": [{"en": "eerduosi", "hk": "鄂爾多斯", "id": "101080701", "zh": "鄂尔多斯"}, {
            "en": "dalate",
            "hk": "達拉特",
            "id": "101080703",
            "zh": "达拉特"
        }, {"en": "zhungeer", "hk": "準格爾", "id": "101080704", "zh": "准格尔"}, {
            "en": "eqianqi",
            "hk": "鄂前旗",
            "id": "101080705",
            "zh": "鄂前旗"
        }, {"en": "etuoke", "hk": "鄂托克", "id": "101080708", "zh": "鄂托克"}, {
            "en": "hangjinqi",
            "hk": "杭錦旗",
            "id": "101080709",
            "zh": "杭锦旗"
        }, {"en": "wushenqi", "hk": "烏審旗", "id": "101080710", "zh": "乌审旗"}, {
            "en": "yijinhuoluo",
            "hk": "伊金霍洛",
            "id": "101080711",
            "zh": "伊金霍洛"
        }, {"en": "dongsheng", "hk": "東勝", "id": "101080713", "zh": "东胜"}, {
            "en": "henan",
            "hk": "河南",
            "id": "101080706",
            "zh": "河南"
        }, {"en": "yihewusu", "hk": "伊和烏素", "id": "101080707", "zh": "伊和乌素"}, {
            "en": "wushenzhao",
            "hk": "烏審召",
            "id": "101080712",
            "zh": "乌审召"
        }, {"en": "kangbashi", "hk": "康巴什", "id": "101080714", "zh": "康巴什"}],
        "en": "eerduosi",
        "hk": "鄂爾多斯",
        "id": "61",
        "zh": "鄂尔多斯"
    }, {
        "children": [{"en": "jining", "hk": "集寧", "id": "101080401", "zh": "集宁"}, {
            "en": "zhuozi",
            "hk": "卓資",
            "id": "101080402",
            "zh": "卓资"
        }, {"en": "huade", "hk": "化德", "id": "101080403", "zh": "化德"}, {
            "en": "shangdu",
            "hk": "商都",
            "id": "101080404",
            "zh": "商都"
        }, {"en": "xinghe", "hk": "興和", "id": "101080406", "zh": "兴和"}, {
            "en": "liangcheng",
            "hk": "涼城",
            "id": "101080407",
            "zh": "凉城"
        }, {"en": "chayouqianqi", "hk": "察右前旗", "id": "101080408", "zh": "察右前旗"}, {
            "en": "chayouzhongqi",
            "hk": "察右中旗",
            "id": "101080409",
            "zh": "察右中旗"
        }, {"en": "chayouhouqi", "hk": "察右後旗", "id": "101080410", "zh": "察右后旗"}, {
            "en": "siziwangqi",
            "hk": "四子王旗",
            "id": "101080411",
            "zh": "四子王旗"
        }, {"en": "fengzhen", "hk": "豐鎮", "id": "101080412", "zh": "丰镇"}, {
            "en": "wulanchabu",
            "hk": "烏蘭察布",
            "id": "101080405",
            "zh": "乌兰察布"
        }], "en": "wulanchabu", "hk": "烏蘭察布", "id": "62", "zh": "乌兰察布"
    }, {
        "children": [{"en": "linhe", "hk": "臨河", "id": "101080801", "zh": "临河"}, {
            "en": "wuyuan",
            "hk": "五原",
            "id": "101080802",
            "zh": "五原"
        }, {"en": "dengkou", "hk": "磴口", "id": "101080803", "zh": "磴口"}, {
            "en": "wuqianqi",
            "hk": "烏前旗",
            "id": "101080804",
            "zh": "乌前旗"
        }, {"en": "wuzhongqi", "hk": "烏中旗", "id": "101080806", "zh": "乌中旗"}, {
            "en": "wuhouqi",
            "hk": "烏後旗",
            "id": "101080807",
            "zh": "乌后旗"
        }, {"en": "hangjinhouqi", "hk": "杭錦後旗", "id": "101080810", "zh": "杭锦后旗"}, {
            "en": "bayannaoer",
            "hk": "巴彥淖爾",
            "id": "101080811",
            "zh": "巴彦淖尔"
        }, {"en": "dashetai", "hk": "大佘太", "id": "101080805", "zh": "大佘太"}, {
            "en": "hailisu",
            "hk": "海力素",
            "id": "101080808",
            "zh": "海力素"
        }, {"en": "narenbaolige", "hk": "那仁寶力格", "id": "101080809", "zh": "那仁宝力格"}],
        "en": "bayannaoer",
        "hk": "巴彥淖爾",
        "id": "63",
        "zh": "巴彦淖尔"
    }, {
        "children": [{"en": "xilinhaote", "hk": "錫林浩特", "id": "101080901", "zh": "锡林浩特"}, {
            "en": "erlianhaote",
            "hk": "二連浩特",
            "id": "101080903",
            "zh": "二连浩特"
        }, {"en": "abaga", "hk": "阿巴嘎", "id": "101080904", "zh": "阿巴嘎"}, {
            "en": "suzuoqi",
            "hk": "蘇左旗",
            "id": "101080906",
            "zh": "苏左旗"
        }, {"en": "suyouqi", "hk": "蘇右旗", "id": "101080907", "zh": "苏右旗"}, {
            "en": "dongwuqi",
            "hk": "東烏旗",
            "id": "101080909",
            "zh": "东乌旗"
        }, {"en": "xiwuqi", "hk": "西烏旗", "id": "101080910", "zh": "西乌旗"}, {
            "en": "taipusiqi",
            "hk": "太僕寺",
            "id": "101080911",
            "zh": "太仆寺"
        }, {"en": "xianghuang", "hk": "鑲黃旗", "id": "101080912", "zh": "镶黄旗"}, {
            "en": "zhengxiangbaiqi",
            "hk": "正鑲白旗",
            "id": "101080913",
            "zh": "正镶白旗"
        }, {"en": "zhenglanqi", "hk": "正藍旗", "id": "101080914", "zh": "正蓝旗"}, {
            "en": "duolun",
            "hk": "多倫",
            "id": "101080915",
            "zh": "多伦"
        }, {"en": "xilinguole", "hk": "錫林郭勒", "id": "101080902", "zh": "锡林郭勒"}, {
            "en": "zhurihe",
            "hk": "朱日和",
            "id": "101080908",
            "zh": "朱日和"
        }, {"en": "wulagai", "hk": "烏拉蓋", "id": "101080917", "zh": "乌拉盖"}],
        "en": "xilinguole",
        "hk": "錫林郭勒",
        "id": "64",
        "zh": "锡林郭勒"
    }, {
        "children": [{"en": "hailaer", "hk": "海拉爾", "id": "101081001", "zh": "海拉尔"}, {
            "en": "arongqi",
            "hk": "阿榮旗",
            "id": "101081003",
            "zh": "阿荣旗"
        }, {"en": "molidawa", "hk": "莫力達瓦", "id": "101081004", "zh": "莫力达瓦"}, {
            "en": "elunchunqi",
            "hk": "鄂倫春旗",
            "id": "101081005",
            "zh": "鄂伦春旗"
        }, {"en": "ewenkeqi", "hk": "鄂溫克旗", "id": "101081006", "zh": "鄂温克旗"}, {
            "en": "chenqi",
            "hk": "陳旗",
            "id": "101081007",
            "zh": "陈旗"
        }, {"en": "xinzuoqi", "hk": "新左旗", "id": "101081008", "zh": "新左旗"}, {
            "en": "xinyouqi",
            "hk": "新右旗",
            "id": "101081009",
            "zh": "新右旗"
        }, {"en": "manzhouli", "hk": "滿洲里", "id": "101081010", "zh": "满洲里"}, {
            "en": "yakeshi",
            "hk": "牙克石",
            "id": "101081011",
            "zh": "牙克石"
        }, {"en": "zhalantun", "hk": "扎蘭屯", "id": "101081012", "zh": "扎兰屯"}, {
            "en": "eerguna",
            "hk": "額爾古納",
            "id": "101081014",
            "zh": "额尔古纳"
        }, {"en": "genhe", "hk": "根河", "id": "101081015", "zh": "根河"}, {
            "en": "hulunbeier",
            "hk": "呼倫貝爾",
            "id": "101081013",
            "zh": "呼伦贝尔"
        }, {"en": "zhalainuoer", "hk": "扎賚諾爾", "id": "101081017", "zh": "扎赉诺尔"}, {
            "en": "boketu",
            "hk": "博克圖",
            "id": "101080916",
            "zh": "博克图"
        }, {"en": "xiaoergou", "hk": "小二溝", "id": "101081002", "zh": "小二沟"}, {
            "en": "tulihe",
            "hk": "圖裡河",
            "id": "101081016",
            "zh": "图里河"
        }], "en": "hulunbeier", "hk": "呼倫貝爾", "id": "65", "zh": "呼伦贝尔"
    }, {
        "children": [{"en": "wulanhaote", "hk": "烏蘭浩特", "id": "101081101", "zh": "乌兰浩特"}, {
            "en": "aershan",
            "hk": "阿爾山",
            "id": "101081102",
            "zh": "阿尔山"
        }, {"en": "keyouzhongqi", "hk": "科右中旗", "id": "101081103", "zh": "科右中旗"}, {
            "en": "zhanlaite",
            "hk": "扎賚特",
            "id": "101081105",
            "zh": "扎赉特"
        }, {"en": "tuquan", "hk": "突泉", "id": "101081107", "zh": "突泉"}, {
            "en": "keyouqianqi",
            "hk": "科右前旗",
            "id": "101081109",
            "zh": "科右前旗"
        }, {"en": "xinganmeng", "hk": "興安盟", "id": "101081108", "zh": "兴安盟"}, {
            "en": "huerle",
            "hk": "胡爾勒",
            "id": "101081104",
            "zh": "胡尔勒"
        }, {"en": "suolun", "hk": "索倫", "id": "101081106", "zh": "索伦"}, {
            "en": "gaoliban",
            "hk": "高力板",
            "id": "101081110",
            "zh": "高力板"
        }], "en": "xinganmeng", "hk": "興安盟", "id": "66", "zh": "兴安盟"
    }, {
        "children": [{"en": "azuoqi", "hk": "阿左旗", "id": "101081201", "zh": "阿左旗"}, {
            "en": "ayouqi",
            "hk": "阿右旗",
            "id": "101081202",
            "zh": "阿右旗"
        }, {"en": "ejina", "hk": "額濟納", "id": "101081203", "zh": "额济纳"}, {
            "en": "alashanmeng",
            "hk": "阿拉善盟",
            "id": "101081213",
            "zh": "阿拉善盟"
        }, {"en": "guanzihu", "hk": "拐子湖", "id": "101081204", "zh": "拐子湖"}, {
            "en": "jilantai",
            "hk": "吉蘭太",
            "id": "101081205",
            "zh": "吉兰太"
        }, {"en": "bayannuorigong", "hk": "巴彥諾日公", "id": "101081209", "zh": "巴彦诺日公"}, {
            "en": "yabulai",
            "hk": "雅布賴",
            "id": "101081210",
            "zh": "雅布赖"
        }, {"en": "wusitai", "hk": "烏斯太", "id": "101081211", "zh": "乌斯太"}, {
            "en": "luanjingtan",
            "hk": "孿井灘",
            "id": "101081212",
            "zh": "孪井滩"
        }], "en": "alashanmeng", "hk": "阿拉善盟", "id": "67", "zh": "阿拉善盟"
    }], "en": "namenggu", "hk": "內蒙古", "id": "55", "zh": "内蒙古"
}, {
    "children": [{
        "children": [{"en": "shijiazhuang", "hk": "石家莊", "id": "101090101", "zh": "石家庄"}, {
            "en": "jingxing",
            "hk": "井陘",
            "id": "101090102",
            "zh": "井陉"
        }, {"en": "zhengding", "hk": "正定", "id": "101090103", "zh": "正定"}, {
            "en": "luancheng",
            "hk": "欒城",
            "id": "101090104",
            "zh": "栾城"
        }, {"en": "xingtang", "hk": "行唐", "id": "101090105", "zh": "行唐"}, {
            "en": "lingshou",
            "hk": "靈壽",
            "id": "101090106",
            "zh": "灵寿"
        }, {"en": "gaoyi", "hk": "高邑", "id": "101090107", "zh": "高邑"}, {
            "en": "shenze",
            "hk": "深澤",
            "id": "101090108",
            "zh": "深泽"
        }, {"en": "zanhuang", "hk": "贊皇", "id": "101090109", "zh": "赞皇"}, {
            "en": "wuji",
            "hk": "無極",
            "id": "101090110",
            "zh": "无极"
        }, {"en": "pingshan", "hk": "平山", "id": "101090111", "zh": "平山"}, {
            "en": "yuanshi",
            "hk": "元氏",
            "id": "101090112",
            "zh": "元氏"
        }, {"en": "zhaoxian", "hk": "趙縣", "id": "101090113", "zh": "赵县"}, {
            "en": "xinji",
            "hk": "辛集",
            "id": "101090114",
            "zh": "辛集"
        }, {"en": "gaocheng", "hk": "藁城", "id": "101090115", "zh": "藁城"}, {
            "en": "jinzhou",
            "hk": "晉州",
            "id": "101090116",
            "zh": "晋州"
        }, {"en": "xinle", "hk": "新樂", "id": "101090117", "zh": "新乐"}, {
            "en": "luquan",
            "hk": "鹿泉",
            "id": "101090118",
            "zh": "鹿泉"
        }, {"en": "changan", "hk": "長安", "id": "101090119", "zh": "长安"}, {
            "en": "qiaoxi",
            "hk": "橋西",
            "id": "101090120",
            "zh": "桥西"
        }, {"en": "xinhua", "hk": "新華", "id": "101090121", "zh": "新华"}, {
            "en": "jingxingkuangqu",
            "hk": "井陘礦區",
            "id": "101090122",
            "zh": "井陉矿区"
        }, {"en": "yuhua", "hk": "裕華", "id": "101090123", "zh": "裕华"}],
        "en": "shijiazhuang",
        "hk": "石家莊",
        "id": "69",
        "zh": "石家庄"
    }, {
        "children": [{"en": "baoding", "hk": "保定", "id": "101090201", "zh": "保定"}, {
            "en": "mancheng",
            "hk": "滿城",
            "id": "101090202",
            "zh": "满城"
        }, {"en": "fuping", "hk": "阜平", "id": "101090203", "zh": "阜平"}, {
            "en": "xushui",
            "hk": "徐水",
            "id": "101090204",
            "zh": "徐水"
        }, {"en": "tangxian", "hk": "唐縣", "id": "101090205", "zh": "唐县"}, {
            "en": "gaoyang",
            "hk": "高陽",
            "id": "101090206",
            "zh": "高阳"
        }, {"en": "laiyuan", "hk": "淶源", "id": "101090209", "zh": "涞源"}, {
            "en": "wangdu",
            "hk": "望都",
            "id": "101090210",
            "zh": "望都"
        }, {"en": "yixian", "hk": "易縣", "id": "101090212", "zh": "易县"}, {
            "en": "quyang",
            "hk": "曲陽",
            "id": "101090214",
            "zh": "曲阳"
        }, {"en": "lixian", "hk": "蠡縣", "id": "101090215", "zh": "蠡县"}, {
            "en": "shunping",
            "hk": "順平",
            "id": "101090216",
            "zh": "顺平"
        }, {"en": "zhuozhou", "hk": "涿州", "id": "101090218", "zh": "涿州"}, {
            "en": "dingzhou",
            "hk": "定州",
            "id": "101090219",
            "zh": "定州"
        }, {"en": "anguo", "hk": "安國", "id": "101090220", "zh": "安国"}, {
            "en": "gaobeidian",
            "hk": "高碑店",
            "id": "101090221",
            "zh": "高碑店"
        }, {"en": "laishui", "hk": "淶水", "id": "101090222", "zh": "涞水"}, {
            "en": "dingxing",
            "hk": "定興",
            "id": "101090223",
            "zh": "定兴"
        }, {"en": "qingyuan", "hk": "清苑", "id": "101090224", "zh": "清苑"}, {
            "en": "boye",
            "hk": "博野",
            "id": "101090225",
            "zh": "博野"
        }, {"en": "jingxiu", "hk": "競秀", "id": "101090208", "zh": "竞秀"}, {
            "en": "lianchi",
            "hk": "蓮池",
            "id": "101090213",
            "zh": "莲池"
        }], "en": "baoding", "hk": "保定", "id": "70", "zh": "保定"
    }, {
        "children": [{"en": "zhangjiakou", "hk": "張家口", "id": "101090301", "zh": "张家口"}, {
            "en": "xuanhua",
            "hk": "宣化",
            "id": "101090302",
            "zh": "宣化"
        }, {"en": "zhangbei", "hk": "張北", "id": "101090303", "zh": "张北"}, {
            "en": "kangbao",
            "hk": "康保",
            "id": "101090304",
            "zh": "康保"
        }, {"en": "guyuan", "hk": "沽源", "id": "101090305", "zh": "沽源"}, {
            "en": "shangyi",
            "hk": "尚義",
            "id": "101090306",
            "zh": "尚义"
        }, {"en": "yuxian", "hk": "蔚縣", "id": "101090307", "zh": "蔚县"}, {
            "en": "yangyuan",
            "hk": "陽原",
            "id": "101090308",
            "zh": "阳原"
        }, {"en": "huaian", "hk": "懷安", "id": "101090309", "zh": "怀安"}, {
            "en": "wanquan",
            "hk": "萬全",
            "id": "101090310",
            "zh": "万全"
        }, {"en": "huailai", "hk": "懷來", "id": "101090311", "zh": "怀来"}, {
            "en": "zhuolu",
            "hk": "涿鹿",
            "id": "101090312",
            "zh": "涿鹿"
        }, {"en": "chicheng", "hk": "赤城", "id": "101090313", "zh": "赤城"}, {
            "en": "chongli",
            "hk": "崇禮",
            "id": "101090314",
            "zh": "崇礼"
        }, {"en": "qiaodong", "hk": "橋東", "id": "101090315", "zh": "桥东"}, {
            "en": "qiaoxi",
            "hk": "橋西",
            "id": "101090316",
            "zh": "桥西"
        }, {"en": "xiahuayuan", "hk": "下花園", "id": "101090317", "zh": "下花园"}],
        "en": "zhangjiakou",
        "hk": "張家口",
        "id": "71",
        "zh": "张家口"
    }, {
        "children": [{"en": "chengde", "hk": "承德", "id": "101090402", "zh": "承德"}, {
            "en": "chengdexian",
            "hk": "承德縣",
            "id": "101090403",
            "zh": "承德县"
        }, {"en": "xinglong", "hk": "興隆", "id": "101090404", "zh": "兴隆"}, {
            "en": "pingquan",
            "hk": "平泉",
            "id": "101090405",
            "zh": "平泉"
        }, {"en": "luanping", "hk": "灤平", "id": "101090406", "zh": "滦平"}, {
            "en": "longhua",
            "hk": "隆化",
            "id": "101090407",
            "zh": "隆化"
        }, {"en": "fengning", "hk": "豐寧", "id": "101090408", "zh": "丰宁"}, {
            "en": "kuancheng",
            "hk": "寬城",
            "id": "101090409",
            "zh": "宽城"
        }, {"en": "weichang", "hk": "圍場", "id": "101090410", "zh": "围场"}, {
            "en": "shuangqiao",
            "hk": "雙橋",
            "id": "101090401",
            "zh": "双桥"
        }, {"en": "shuangluan", "hk": "雙灤", "id": "101090411", "zh": "双滦"}, {
            "en": "yingshouyingzikuang",
            "hk": "鷹手營子礦",
            "id": "101090412",
            "zh": "鹰手营子矿"
        }], "en": "chengde", "hk": "承德", "id": "72", "zh": "承德"
    }, {
        "children": [{"en": "tangshan", "hk": "唐山", "id": "101090501", "zh": "唐山"}, {
            "en": "fengnan",
            "hk": "豐南",
            "id": "101090502",
            "zh": "丰南"
        }, {"en": "fengrun", "hk": "豐潤", "id": "101090503", "zh": "丰润"}, {
            "en": "luanxian",
            "hk": "灤縣",
            "id": "101090504",
            "zh": "滦县"
        }, {"en": "luannan", "hk": "灤南", "id": "101090505", "zh": "滦南"}, {
            "en": "leting",
            "hk": "樂亭",
            "id": "101090506",
            "zh": "乐亭"
        }, {"en": "qianxi", "hk": "遷西", "id": "101090507", "zh": "迁西"}, {
            "en": "yutian",
            "hk": "玉田",
            "id": "101090508",
            "zh": "玉田"
        }, {"en": "caofeidian", "hk": "曹妃甸", "id": "101090509", "zh": "曹妃甸"}, {
            "en": "zunhua",
            "hk": "遵化",
            "id": "101090510",
            "zh": "遵化"
        }, {"en": "qianan", "hk": "遷安", "id": "101090511", "zh": "迁安"}, {
            "en": "lunan",
            "hk": "路南",
            "id": "101090513",
            "zh": "路南"
        }, {"en": "lubei", "hk": "路北", "id": "101090514", "zh": "路北"}, {
            "en": "guye",
            "hk": "古冶",
            "id": "101090515",
            "zh": "古冶"
        }, {"en": "kaiping", "hk": "開平", "id": "101090516", "zh": "开平"}],
        "en": "tangshan",
        "hk": "唐山",
        "id": "73",
        "zh": "唐山"
    }, {
        "children": [{"en": "langfang", "hk": "廊坊", "id": "101090601", "zh": "廊坊"}, {
            "en": "guan",
            "hk": "固安",
            "id": "101090602",
            "zh": "固安"
        }, {"en": "yongqing", "hk": "永清", "id": "101090603", "zh": "永清"}, {
            "en": "xianghe",
            "hk": "香河",
            "id": "101090604",
            "zh": "香河"
        }, {"en": "dacheng", "hk": "大城", "id": "101090605", "zh": "大城"}, {
            "en": "wenan",
            "hk": "文安",
            "id": "101090606",
            "zh": "文安"
        }, {"en": "dachang", "hk": "大廠", "id": "101090607", "zh": "大厂"}, {
            "en": "bazhou",
            "hk": "霸州",
            "id": "101090608",
            "zh": "霸州"
        }, {"en": "sanhe", "hk": "三河", "id": "101090609", "zh": "三河"}, {
            "en": "anci",
            "hk": "安次",
            "id": "101090610",
            "zh": "安次"
        }, {"en": "guangyang", "hk": "廣陽", "id": "101090611", "zh": "广阳"}],
        "en": "langfang",
        "hk": "廊坊",
        "id": "74",
        "zh": "廊坊"
    }, {
        "children": [{"en": "cangzhou", "hk": "滄州", "id": "101090701", "zh": "沧州"}, {
            "en": "qingxian",
            "hk": "青縣",
            "id": "101090702",
            "zh": "青县"
        }, {"en": "dongguang", "hk": "東光", "id": "101090703", "zh": "东光"}, {
            "en": "haixing",
            "hk": "海興",
            "id": "101090704",
            "zh": "海兴"
        }, {"en": "yanshan", "hk": "鹽山", "id": "101090705", "zh": "盐山"}, {
            "en": "suning",
            "hk": "肅寧",
            "id": "101090706",
            "zh": "肃宁"
        }, {"en": "nanpi", "hk": "南皮", "id": "101090707", "zh": "南皮"}, {
            "en": "wuqiao",
            "hk": "吳橋",
            "id": "101090708",
            "zh": "吴桥"
        }, {"en": "xianxian", "hk": "獻縣", "id": "101090709", "zh": "献县"}, {
            "en": "mengcun",
            "hk": "孟村",
            "id": "101090710",
            "zh": "孟村"
        }, {"en": "botou", "hk": "泊頭", "id": "101090711", "zh": "泊头"}, {
            "en": "renqiu",
            "hk": "任丘",
            "id": "101090712",
            "zh": "任丘"
        }, {"en": "huanghua", "hk": "黃驊", "id": "101090713", "zh": "黄骅"}, {
            "en": "hejian",
            "hk": "河間",
            "id": "101090714",
            "zh": "河间"
        }, {"en": "cangxian", "hk": "滄縣", "id": "101090716", "zh": "沧县"}, {
            "en": "xinhua",
            "hk": "新華",
            "id": "101090715",
            "zh": "新华"
        }, {"en": "yunhe", "hk": "運河", "id": "101090717", "zh": "运河"}],
        "en": "cangzhou",
        "hk": "滄州",
        "id": "75",
        "zh": "沧州"
    }, {
        "children": [{"en": "hengshui", "hk": "衡水", "id": "101090801", "zh": "衡水"}, {
            "en": "zaoqiang",
            "hk": "棗強",
            "id": "101090802",
            "zh": "枣强"
        }, {"en": "wuyi", "hk": "武邑", "id": "101090803", "zh": "武邑"}, {
            "en": "wuqiang",
            "hk": "武強",
            "id": "101090804",
            "zh": "武强"
        }, {"en": "raoyang", "hk": "饒陽", "id": "101090805", "zh": "饶阳"}, {
            "en": "anping",
            "hk": "安平",
            "id": "101090806",
            "zh": "安平"
        }, {"en": "gucheng", "hk": "故城", "id": "101090807", "zh": "故城"}, {
            "en": "jingxian",
            "hk": "景縣",
            "id": "101090808",
            "zh": "景县"
        }, {"en": "fucheng", "hk": "阜城", "id": "101090809", "zh": "阜城"}, {
            "en": "jizhou",
            "hk": "冀州",
            "id": "101090810",
            "zh": "冀州"
        }, {"en": "shenzhou", "hk": "深州", "id": "101090811", "zh": "深州"}, {
            "en": "taocheng",
            "hk": "桃城",
            "id": "101090812",
            "zh": "桃城"
        }], "en": "hengshui", "hk": "衡水", "id": "76", "zh": "衡水"
    }, {
        "children": [{"en": "xingtai", "hk": "邢台", "id": "101090901", "zh": "邢台"}, {
            "en": "lincheng",
            "hk": "臨城",
            "id": "101090902",
            "zh": "临城"
        }, {"en": "neiqiu", "hk": "內丘", "id": "101090904", "zh": "内丘"}, {
            "en": "baixiang",
            "hk": "柏鄉",
            "id": "101090905",
            "zh": "柏乡"
        }, {"en": "longyao", "hk": "隆堯", "id": "101090906", "zh": "隆尧"}, {
            "en": "nanhe",
            "hk": "南和",
            "id": "101090907",
            "zh": "南和"
        }, {"en": "ningjin", "hk": "寧晉", "id": "101090908", "zh": "宁晋"}, {
            "en": "julu",
            "hk": "鉅鹿",
            "id": "101090909",
            "zh": "巨鹿"
        }, {"en": "xinhe", "hk": "新河", "id": "101090910", "zh": "新河"}, {
            "en": "guangzong",
            "hk": "廣宗",
            "id": "101090911",
            "zh": "广宗"
        }, {"en": "pingxiang", "hk": "平鄉", "id": "101090912", "zh": "平乡"}, {
            "en": "weixian",
            "hk": "威縣",
            "id": "101090913",
            "zh": "威县"
        }, {"en": "qinghe", "hk": "清河", "id": "101090914", "zh": "清河"}, {
            "en": "linxi",
            "hk": "臨西",
            "id": "101090915",
            "zh": "临西"
        }, {"en": "nangong", "hk": "南宮", "id": "101090916", "zh": "南宫"}, {
            "en": "shahe",
            "hk": "沙河",
            "id": "101090917",
            "zh": "沙河"
        }, {"en": "renxian", "hk": "任縣", "id": "101090918", "zh": "任县"}, {
            "en": "qiaodong",
            "hk": "橋東",
            "id": "101090903",
            "zh": "桥东"
        }, {"en": "qiaoxi", "hk": "橋西", "id": "101090919", "zh": "桥西"}],
        "en": "xingtai",
        "hk": "邢台",
        "id": "77",
        "zh": "邢台"
    }, {
        "children": [{"en": "handan", "hk": "邯鄲", "id": "101091001", "zh": "邯郸"}, {
            "en": "fengfeng",
            "hk": "峰峰",
            "id": "101091002",
            "zh": "峰峰"
        }, {"en": "linzhang", "hk": "臨漳", "id": "101091003", "zh": "临漳"}, {
            "en": "chengan",
            "hk": "成安",
            "id": "101091004",
            "zh": "成安"
        }, {"en": "daming", "hk": "大名", "id": "101091005", "zh": "大名"}, {
            "en": "shexian",
            "hk": "涉縣",
            "id": "101091006",
            "zh": "涉县"
        }, {"en": "cixian", "hk": "磁縣", "id": "101091007", "zh": "磁县"}, {
            "en": "feixiang",
            "hk": "肥鄉",
            "id": "101091008",
            "zh": "肥乡"
        }, {"en": "yongnian", "hk": "永年", "id": "101091009", "zh": "永年"}, {
            "en": "qiuxian",
            "hk": "邱縣",
            "id": "101091010",
            "zh": "邱县"
        }, {"en": "jize", "hk": "雞澤", "id": "101091011", "zh": "鸡泽"}, {
            "en": "guangping",
            "hk": "廣平",
            "id": "101091012",
            "zh": "广平"
        }, {"en": "guantao", "hk": "館陶", "id": "101091013", "zh": "馆陶"}, {
            "en": "weixian",
            "hk": "魏縣",
            "id": "101091014",
            "zh": "魏县"
        }, {"en": "quzhou", "hk": "曲周", "id": "101091015", "zh": "曲周"}, {
            "en": "wuan",
            "hk": "武安",
            "id": "101091016",
            "zh": "武安"
        }, {"en": "hanshan", "hk": "邯山", "id": "101091017", "zh": "邯山"}, {
            "en": "congtai",
            "hk": "叢臺",
            "id": "101091018",
            "zh": "丛台"
        }, {"en": "fuxing", "hk": "復興", "id": "101091019", "zh": "复兴"}],
        "en": "handan",
        "hk": "邯鄲",
        "id": "78",
        "zh": "邯郸"
    }, {
        "children": [{"en": "qinhuangdao", "hk": "秦皇島", "id": "101091101", "zh": "秦皇岛"}, {
            "en": "qinglong",
            "hk": "青龍",
            "id": "101091102",
            "zh": "青龙"
        }, {"en": "changli", "hk": "昌黎", "id": "101091103", "zh": "昌黎"}, {
            "en": "funing",
            "hk": "撫寧",
            "id": "101091104",
            "zh": "抚宁"
        }, {"en": "lulong", "hk": "盧龍", "id": "101091105", "zh": "卢龙"}, {
            "en": "beidaihe",
            "hk": "北戴河",
            "id": "101091106",
            "zh": "北戴河"
        }, {"en": "haigang", "hk": "海港", "id": "101091107", "zh": "海港"}, {
            "en": "shanhaiguan",
            "hk": "山海關",
            "id": "101091108",
            "zh": "山海关"
        }], "en": "qinhuangdao", "hk": "秦皇島", "id": "79", "zh": "秦皇岛"
    }, {
        "children": [{"en": "xionganxinqu", "hk": "雄安新區", "id": "101091201", "zh": "雄安新区"}, {
            "en": "rongcheng",
            "hk": "容城",
            "id": "101091202",
            "zh": "容城"
        }, {"en": "anxin", "hk": "安新", "id": "101091203", "zh": "安新"}, {
            "en": "xiongxian",
            "hk": "雄縣",
            "id": "101091204",
            "zh": "雄县"
        }], "en": "xionganxinqu", "hk": "雄安新區", "id": "80", "zh": "雄安新区"
    }], "en": "hebei", "hk": "河北", "id": "68", "zh": "河北"
}, {
    "children": [{
        "children": [{"en": "zhengzhou", "hk": "鄭州", "id": "101180101", "zh": "郑州"}, {
            "en": "gongyi",
            "hk": "鞏義",
            "id": "101180102",
            "zh": "巩义"
        }, {"en": "xingyang", "hk": "滎陽", "id": "101180103", "zh": "荥阳"}, {
            "en": "dengfeng",
            "hk": "登封",
            "id": "101180104",
            "zh": "登封"
        }, {"en": "xinmi", "hk": "新密", "id": "101180105", "zh": "新密"}, {
            "en": "xinzheng",
            "hk": "新鄭",
            "id": "101180106",
            "zh": "新郑"
        }, {"en": "zhongmou", "hk": "中牟", "id": "101180107", "zh": "中牟"}, {
            "en": "shangjie",
            "hk": "上街",
            "id": "101180108",
            "zh": "上街"
        }, {"en": "zhongyuan", "hk": "中原", "id": "101180109", "zh": "中原"}, {
            "en": "erqi",
            "hk": "二七",
            "id": "101180110",
            "zh": "二七"
        }, {"en": "guancheng", "hk": "管城", "id": "101180111", "zh": "管城"}, {
            "en": "jinshui",
            "hk": "金水",
            "id": "101180112",
            "zh": "金水"
        }, {"en": "huiji", "hk": "惠濟", "id": "101180113", "zh": "惠济"}],
        "en": "zhengzhou",
        "hk": "鄭州",
        "id": "82",
        "zh": "郑州"
    }, {
        "children": [{"en": "anyang", "hk": "安陽", "id": "101180201", "zh": "安阳"}, {
            "en": "tangyin",
            "hk": "湯陰",
            "id": "101180202",
            "zh": "汤阴"
        }, {"en": "huaxian", "hk": "滑縣", "id": "101180203", "zh": "滑县"}, {
            "en": "neihuang",
            "hk": "內黃",
            "id": "101180204",
            "zh": "内黄"
        }, {"en": "linzhou", "hk": "林州", "id": "101180205", "zh": "林州"}, {
            "en": "wenfeng",
            "hk": "文峰",
            "id": "101180206",
            "zh": "文峰"
        }, {"en": "beiguan", "hk": "北關", "id": "101180207", "zh": "北关"}, {
            "en": "yindou",
            "hk": "殷都",
            "id": "101180208",
            "zh": "殷都"
        }, {"en": "longan", "hk": "龍安", "id": "101180209", "zh": "龙安"}],
        "en": "anyang",
        "hk": "安陽",
        "id": "83",
        "zh": "安阳"
    }, {
        "children": [{"en": "xinxiang", "hk": "新鄉", "id": "101180301", "zh": "新乡"}, {
            "en": "huojia",
            "hk": "獲嘉",
            "id": "101180302",
            "zh": "获嘉"
        }, {"en": "yuanyang", "hk": "原陽", "id": "101180303", "zh": "原阳"}, {
            "en": "huixian",
            "hk": "輝縣",
            "id": "101180304",
            "zh": "辉县"
        }, {"en": "weihui", "hk": "衛輝", "id": "101180305", "zh": "卫辉"}, {
            "en": "yanjin",
            "hk": "延津",
            "id": "101180306",
            "zh": "延津"
        }, {"en": "fengqiu", "hk": "封丘", "id": "101180307", "zh": "封丘"}, {
            "en": "changyuan",
            "hk": "長垣",
            "id": "101180308",
            "zh": "长垣"
        }, {"en": "hongqi", "hk": "紅旗", "id": "101180309", "zh": "红旗"}, {
            "en": "weibin",
            "hk": "衛濱",
            "id": "101180310",
            "zh": "卫滨"
        }, {"en": "fengquan", "hk": "鳳泉", "id": "101180311", "zh": "凤泉"}, {
            "en": "muye",
            "hk": "牧野",
            "id": "101180312",
            "zh": "牧野"
        }], "en": "xinxiang", "hk": "新鄉", "id": "84", "zh": "新乡"
    }, {
        "children": [{"en": "xuchang", "hk": "許昌", "id": "101180401", "zh": "许昌"}, {
            "en": "yanling",
            "hk": "鄢陵",
            "id": "101180402",
            "zh": "鄢陵"
        }, {"en": "xiangcheng", "hk": "襄城", "id": "101180403", "zh": "襄城"}, {
            "en": "changge",
            "hk": "長葛",
            "id": "101180404",
            "zh": "长葛"
        }, {"en": "yuzhou", "hk": "禹州", "id": "101180405", "zh": "禹州"}, {
            "en": "weidou",
            "hk": "魏都",
            "id": "101180406",
            "zh": "魏都"
        }, {"en": "jianan", "hk": "建安", "id": "101180407", "zh": "建安"}],
        "en": "xuchang",
        "hk": "許昌",
        "id": "85",
        "zh": "许昌"
    }, {
        "children": [{"en": "pingdingshan", "hk": "平頂山", "id": "101180501", "zh": "平顶山"}, {
            "en": "jiaxian",
            "hk": "郟縣",
            "id": "101180502",
            "zh": "郏县"
        }, {"en": "baofeng", "hk": "寶豐", "id": "101180503", "zh": "宝丰"}, {
            "en": "ruzhou",
            "hk": "汝州",
            "id": "101180504",
            "zh": "汝州"
        }, {"en": "yexian", "hk": "葉縣", "id": "101180505", "zh": "叶县"}, {
            "en": "wugang",
            "hk": "舞鋼",
            "id": "101180506",
            "zh": "舞钢"
        }, {"en": "lushan", "hk": "魯山", "id": "101180507", "zh": "鲁山"}, {
            "en": "shilong",
            "hk": "石龍",
            "id": "101180508",
            "zh": "石龙"
        }, {"en": "xinhua", "hk": "新華", "id": "101180509", "zh": "新华"}, {
            "en": "weidong",
            "hk": "衛東",
            "id": "101180510",
            "zh": "卫东"
        }, {"en": "zhanhe", "hk": "湛河", "id": "101180511", "zh": "湛河"}],
        "en": "pingdingshan",
        "hk": "平頂山",
        "id": "86",
        "zh": "平顶山"
    }, {
        "children": [{"en": "xinyang", "hk": "信陽", "id": "101180601", "zh": "信阳"}, {
            "en": "xixian",
            "hk": "息縣",
            "id": "101180602",
            "zh": "息县"
        }, {"en": "luoshan", "hk": "羅山", "id": "101180603", "zh": "罗山"}, {
            "en": "guangshan",
            "hk": "光山",
            "id": "101180604",
            "zh": "光山"
        }, {"en": "xinxian", "hk": "新縣", "id": "101180605", "zh": "新县"}, {
            "en": "huaibin",
            "hk": "淮濱",
            "id": "101180606",
            "zh": "淮滨"
        }, {"en": "huangchuan", "hk": "潢川", "id": "101180607", "zh": "潢川"}, {
            "en": "gushi",
            "hk": "固始",
            "id": "101180608",
            "zh": "固始"
        }, {"en": "shangcheng", "hk": "商城", "id": "101180609", "zh": "商城"}, {
            "en": "shihe",
            "hk": "浉河",
            "id": "101180610",
            "zh": "浉河"
        }, {"en": "pingqiao", "hk": "平橋", "id": "101180611", "zh": "平桥"}],
        "en": "xinyang",
        "hk": "信陽",
        "id": "87",
        "zh": "信阳"
    }, {
        "children": [{"en": "nanyang", "hk": "南陽", "id": "101180701", "zh": "南阳"}, {
            "en": "nanzhao",
            "hk": "南召",
            "id": "101180702",
            "zh": "南召"
        }, {"en": "fangcheng", "hk": "方城", "id": "101180703", "zh": "方城"}, {
            "en": "sheqi",
            "hk": "社旗",
            "id": "101180704",
            "zh": "社旗"
        }, {"en": "xixia", "hk": "西峽", "id": "101180705", "zh": "西峡"}, {
            "en": "neixiang",
            "hk": "內鄉",
            "id": "101180706",
            "zh": "内乡"
        }, {"en": "zhenping", "hk": "鎮平", "id": "101180707", "zh": "镇平"}, {
            "en": "xichuan",
            "hk": "淅川",
            "id": "101180708",
            "zh": "淅川"
        }, {"en": "xinye", "hk": "新野", "id": "101180709", "zh": "新野"}, {
            "en": "tanghe",
            "hk": "唐河",
            "id": "101180710",
            "zh": "唐河"
        }, {"en": "dengzhou", "hk": "鄧州", "id": "101180711", "zh": "邓州"}, {
            "en": "tongbai",
            "hk": "桐柏",
            "id": "101180712",
            "zh": "桐柏"
        }, {"en": "wancheng", "hk": "宛城", "id": "101180713", "zh": "宛城"}, {
            "en": "wolong",
            "hk": "臥龍",
            "id": "101180714",
            "zh": "卧龙"
        }], "en": "nanyang", "hk": "南陽", "id": "88", "zh": "南阳"
    }, {
        "children": [{"en": "kaifeng", "hk": "開封", "id": "101180801", "zh": "开封"}, {
            "en": "qixian",
            "hk": "杞縣",
            "id": "101180802",
            "zh": "杞县"
        }, {"en": "weishi", "hk": "尉氏", "id": "101180803", "zh": "尉氏"}, {
            "en": "tongxu",
            "hk": "通許",
            "id": "101180804",
            "zh": "通许"
        }, {"en": "lankao", "hk": "蘭考", "id": "101180805", "zh": "兰考"}, {
            "en": "longting",
            "hk": "龍亭",
            "id": "101180806",
            "zh": "龙亭"
        }, {"en": "shunhe", "hk": "順河", "id": "101180807", "zh": "顺河"}, {
            "en": "gulou",
            "hk": "鼓樓",
            "id": "101180808",
            "zh": "鼓楼"
        }, {"en": "yuwangtai", "hk": "禹王台", "id": "101180809", "zh": "禹王台"}, {
            "en": "xiangfu",
            "hk": "祥符",
            "id": "101180810",
            "zh": "祥符"
        }], "en": "kaifeng", "hk": "開封", "id": "89", "zh": "开封"
    }, {
        "children": [{"en": "luoyang", "hk": "洛陽", "id": "101180901", "zh": "洛阳"}, {
            "en": "xinan",
            "hk": "新安",
            "id": "101180902",
            "zh": "新安"
        }, {"en": "mengjin", "hk": "孟津", "id": "101180903", "zh": "孟津"}, {
            "en": "yiyang",
            "hk": "宜陽",
            "id": "101180904",
            "zh": "宜阳"
        }, {"en": "luoning", "hk": "洛寧", "id": "101180905", "zh": "洛宁"}, {
            "en": "yichuan",
            "hk": "伊川",
            "id": "101180906",
            "zh": "伊川"
        }, {"en": "songxian", "hk": "嵩縣", "id": "101180907", "zh": "嵩县"}, {
            "en": "yanshi",
            "hk": "偃師",
            "id": "101180908",
            "zh": "偃师"
        }, {"en": "luanchuan", "hk": "欒川", "id": "101180909", "zh": "栾川"}, {
            "en": "ruyang",
            "hk": "汝陽",
            "id": "101180910",
            "zh": "汝阳"
        }, {"en": "jili", "hk": "吉利", "id": "101180911", "zh": "吉利"}, {
            "en": "laocheng",
            "hk": "老城",
            "id": "101180912",
            "zh": "老城"
        }, {"en": "xigong", "hk": "西工", "id": "101180913", "zh": "西工"}, {
            "en": "chanhe",
            "hk": "瀍河",
            "id": "101180914",
            "zh": "瀍河"
        }, {"en": "jianxi", "hk": "澗西", "id": "101180915", "zh": "涧西"}, {
            "en": "luolong",
            "hk": "洛龍",
            "id": "101180916",
            "zh": "洛龙"
        }], "en": "luoyang", "hk": "洛陽", "id": "90", "zh": "洛阳"
    }, {
        "children": [{"en": "shangqiu", "hk": "商丘", "id": "101181001", "zh": "商丘"}, {
            "en": "suixian",
            "hk": "睢縣",
            "id": "101181003",
            "zh": "睢县"
        }, {"en": "minquan", "hk": "民權", "id": "101181004", "zh": "民权"}, {
            "en": "yucheng",
            "hk": "虞城",
            "id": "101181005",
            "zh": "虞城"
        }, {"en": "zhecheng", "hk": "柘城", "id": "101181006", "zh": "柘城"}, {
            "en": "ningling",
            "hk": "寧陵",
            "id": "101181007",
            "zh": "宁陵"
        }, {"en": "xiayi", "hk": "夏邑", "id": "101181008", "zh": "夏邑"}, {
            "en": "yongcheng",
            "hk": "永城",
            "id": "101181009",
            "zh": "永城"
        }, {"en": "liangyuan", "hk": "梁園", "id": "101181002", "zh": "梁园"}, {
            "en": "suiyang",
            "hk": "睢陽",
            "id": "101181010",
            "zh": "睢阳"
        }], "en": "shangqiu", "hk": "商丘", "id": "91", "zh": "商丘"
    }, {
        "children": [{"en": "jiaozuo", "hk": "焦作", "id": "101181101", "zh": "焦作"}, {
            "en": "xiuwu",
            "hk": "修武",
            "id": "101181102",
            "zh": "修武"
        }, {"en": "wuzhi", "hk": "武陟", "id": "101181103", "zh": "武陟"}, {
            "en": "qinyang",
            "hk": "沁陽",
            "id": "101181104",
            "zh": "沁阳"
        }, {"en": "boai", "hk": "博愛", "id": "101181106", "zh": "博爱"}, {
            "en": "wenxian",
            "hk": "溫縣",
            "id": "101181107",
            "zh": "温县"
        }, {"en": "mengzhou", "hk": "孟州", "id": "101181108", "zh": "孟州"}, {
            "en": "jiefang",
            "hk": "解放",
            "id": "101181105",
            "zh": "解放"
        }, {"en": "zhongzhan", "hk": "中站", "id": "101181109", "zh": "中站"}, {
            "en": "macun",
            "hk": "馬村",
            "id": "101181110",
            "zh": "马村"
        }, {"en": "shanyang", "hk": "山陽", "id": "101181111", "zh": "山阳"}],
        "en": "jiaozuo",
        "hk": "焦作",
        "id": "92",
        "zh": "焦作"
    }, {
        "children": [{"en": "hebi", "hk": "鶴壁", "id": "101181201", "zh": "鹤壁"}, {
            "en": "xunxian",
            "hk": "濬縣",
            "id": "101181202",
            "zh": "浚县"
        }, {"en": "qixian", "hk": "淇縣", "id": "101181203", "zh": "淇县"}, {
            "en": "heshan",
            "hk": "鶴山",
            "id": "101181204",
            "zh": "鹤山"
        }, {"en": "shancheng", "hk": "山城", "id": "101181205", "zh": "山城"}, {
            "en": "qibin",
            "hk": "淇濱",
            "id": "101181206",
            "zh": "淇滨"
        }], "en": "hebi", "hk": "鶴壁", "id": "93", "zh": "鹤壁"
    }, {
        "children": [{"en": "puyang", "hk": "濮陽", "id": "101181301", "zh": "濮阳"}, {
            "en": "taiqian",
            "hk": "台前",
            "id": "101181302",
            "zh": "台前"
        }, {"en": "nanle", "hk": "南樂", "id": "101181303", "zh": "南乐"}, {
            "en": "qingfeng",
            "hk": "清豐",
            "id": "101181304",
            "zh": "清丰"
        }, {"en": "fanxian", "hk": "範縣", "id": "101181305", "zh": "范县"}, {
            "en": "hualong",
            "hk": "華龍",
            "id": "101181306",
            "zh": "华龙"
        }], "en": "puyang", "hk": "濮陽", "id": "94", "zh": "濮阳"
    }, {
        "children": [{"en": "zhoukou", "hk": "周口", "id": "101181401", "zh": "周口"}, {
            "en": "fugou",
            "hk": "扶溝",
            "id": "101181402",
            "zh": "扶沟"
        }, {"en": "taikang", "hk": "太康", "id": "101181403", "zh": "太康"}, {
            "en": "huaiyang",
            "hk": "淮陽",
            "id": "101181404",
            "zh": "淮阳"
        }, {"en": "xihua", "hk": "西華", "id": "101181405", "zh": "西华"}, {
            "en": "shangshui",
            "hk": "商水",
            "id": "101181406",
            "zh": "商水"
        }, {"en": "xiangcheng", "hk": "項城", "id": "101181407", "zh": "项城"}, {
            "en": "dancheng",
            "hk": "鄲城",
            "id": "101181408",
            "zh": "郸城"
        }, {"en": "luyi", "hk": "鹿邑", "id": "101181409", "zh": "鹿邑"}, {
            "en": "shenqiu",
            "hk": "沈丘",
            "id": "101181410",
            "zh": "沈丘"
        }, {"en": "chuanhui", "hk": "川匯", "id": "101181411", "zh": "川汇"}],
        "en": "zhoukou",
        "hk": "周口",
        "id": "95",
        "zh": "周口"
    }, {
        "children": [{"en": "luohe", "hk": "漯河", "id": "101181501", "zh": "漯河"}, {
            "en": "linying",
            "hk": "臨潁",
            "id": "101181502",
            "zh": "临颍"
        }, {"en": "wuyang", "hk": "舞陽", "id": "101181503", "zh": "舞阳"}, {
            "en": "yuanhui",
            "hk": "源匯",
            "id": "101181504",
            "zh": "源汇"
        }, {"en": "yancheng", "hk": "郾城", "id": "101181505", "zh": "郾城"}, {
            "en": "zhaoling",
            "hk": "召陵",
            "id": "101181506",
            "zh": "召陵"
        }], "en": "luohe", "hk": "漯河", "id": "96", "zh": "漯河"
    }, {
        "children": [{"en": "zhumadian", "hk": "駐馬店", "id": "101181601", "zh": "驻马店"}, {
            "en": "xiping",
            "hk": "西平",
            "id": "101181602",
            "zh": "西平"
        }, {"en": "suiping", "hk": "遂平", "id": "101181603", "zh": "遂平"}, {
            "en": "shangcai",
            "hk": "上蔡",
            "id": "101181604",
            "zh": "上蔡"
        }, {"en": "runan", "hk": "汝南", "id": "101181605", "zh": "汝南"}, {
            "en": "biyang",
            "hk": "泌陽",
            "id": "101181606",
            "zh": "泌阳"
        }, {"en": "pingyu", "hk": "平輿", "id": "101181607", "zh": "平舆"}, {
            "en": "xincai",
            "hk": "新蔡",
            "id": "101181608",
            "zh": "新蔡"
        }, {"en": "queshan", "hk": "確山", "id": "101181609", "zh": "确山"}, {
            "en": "zhengyang",
            "hk": "正陽",
            "id": "101181610",
            "zh": "正阳"
        }, {"en": "yicheng", "hk": "驛城", "id": "101181611", "zh": "驿城"}],
        "en": "zhumadian",
        "hk": "駐馬店",
        "id": "97",
        "zh": "驻马店"
    }, {
        "children": [{"en": "sanmenxia", "hk": "三門峽", "id": "101181701", "zh": "三门峡"}, {
            "en": "lingbao",
            "hk": "靈寶",
            "id": "101181702",
            "zh": "灵宝"
        }, {"en": "mianchi", "hk": "澠池", "id": "101181703", "zh": "渑池"}, {
            "en": "lushi",
            "hk": "盧氏",
            "id": "101181704",
            "zh": "卢氏"
        }, {"en": "yima", "hk": "義馬", "id": "101181705", "zh": "义马"}, {
            "en": "hubin",
            "hk": "湖濱",
            "id": "101181707",
            "zh": "湖滨"
        }, {"en": "shanzhou", "hk": "陝州", "id": "101181708", "zh": "陕州"}],
        "en": "sanmenxia",
        "hk": "三門峽",
        "id": "98",
        "zh": "三门峡"
    }, {
        "children": [{"en": "jiyuan", "hk": "濟源", "id": "101181801", "zh": "济源"}],
        "en": "jiyuan",
        "hk": "濟源",
        "id": "99",
        "zh": "济源"
    }], "en": "henan", "hk": "河南", "id": "81", "zh": "河南"
}, {
    "children": [{
        "children": [{"en": "taiyuan", "hk": "太原", "id": "101100101", "zh": "太原"}, {
            "en": "qingxu",
            "hk": "清徐",
            "id": "101100102",
            "zh": "清徐"
        }, {"en": "yangqu", "hk": "陽曲", "id": "101100103", "zh": "阳曲"}, {
            "en": "loufan",
            "hk": "婁煩",
            "id": "101100104",
            "zh": "娄烦"
        }, {"en": "gujiao", "hk": "古交", "id": "101100105", "zh": "古交"}, {
            "en": "jiancaopingqu",
            "hk": "尖草坪區",
            "id": "101100106",
            "zh": "尖草坪区"
        }, {"en": "xiaodianqu", "hk": "小店區", "id": "101100107", "zh": "小店区"}, {
            "en": "yingze",
            "hk": "迎澤",
            "id": "101100108",
            "zh": "迎泽"
        }, {"en": "xinghualing", "hk": "杏花嶺", "id": "101100109", "zh": "杏花岭"}, {
            "en": "wanbailin",
            "hk": "萬柏林",
            "id": "101100110",
            "zh": "万柏林"
        }, {"en": "jinyuan", "hk": "晉源", "id": "101100111", "zh": "晋源"}],
        "en": "taiyuan",
        "hk": "太原",
        "id": "101",
        "zh": "太原"
    }, {
        "children": [{"en": "datong", "hk": "大同", "id": "101100201", "zh": "大同"}, {
            "en": "yanggao",
            "hk": "陽高",
            "id": "101100202",
            "zh": "阳高"
        }, {"en": "datongxian", "hk": "大同縣", "id": "101100203", "zh": "大同县"}, {
            "en": "tianzhen",
            "hk": "天鎮",
            "id": "101100204",
            "zh": "天镇"
        }, {"en": "guangling", "hk": "廣靈", "id": "101100205", "zh": "广灵"}, {
            "en": "lingqiu",
            "hk": "靈丘",
            "id": "101100206",
            "zh": "灵丘"
        }, {"en": "hunyuan", "hk": "渾源", "id": "101100207", "zh": "浑源"}, {
            "en": "zuoyun",
            "hk": "左雲",
            "id": "101100208",
            "zh": "左云"
        }, {"en": "kuangqu", "hk": "礦區", "id": "101100209", "zh": "矿区"}, {
            "en": "nanjiao",
            "hk": "南郊",
            "id": "101100210",
            "zh": "南郊"
        }, {"en": "xinrong", "hk": "新榮", "id": "101100211", "zh": "新荣"}],
        "en": "datong",
        "hk": "大同",
        "id": "102",
        "zh": "大同"
    }, {
        "children": [{"en": "yangquan", "hk": "陽泉", "id": "101100301", "zh": "阳泉"}, {
            "en": "yuxian",
            "hk": "盂縣",
            "id": "101100302",
            "zh": "盂县"
        }, {"en": "pingding", "hk": "平定", "id": "101100303", "zh": "平定"}, {
            "en": "kuangqu",
            "hk": "礦區",
            "id": "101100304",
            "zh": "矿区"
        }, {"en": "jiaoqu", "hk": "郊區", "id": "101100305", "zh": "郊区"}],
        "en": "yangquan",
        "hk": "陽泉",
        "id": "103",
        "zh": "阳泉"
    }, {
        "children": [{"en": "jinzhong", "hk": "晉中", "id": "101100401", "zh": "晋中"}, {
            "en": "yuci",
            "hk": "榆次",
            "id": "101100402",
            "zh": "榆次"
        }, {"en": "yushe", "hk": "榆社", "id": "101100403", "zh": "榆社"}, {
            "en": "zuoquan",
            "hk": "左權",
            "id": "101100404",
            "zh": "左权"
        }, {"en": "heshun", "hk": "和順", "id": "101100405", "zh": "和顺"}, {
            "en": "xiyang",
            "hk": "昔陽",
            "id": "101100406",
            "zh": "昔阳"
        }, {"en": "shouyang", "hk": "壽陽", "id": "101100407", "zh": "寿阳"}, {
            "en": "taigu",
            "hk": "太谷",
            "id": "101100408",
            "zh": "太谷"
        }, {"en": "qixian", "hk": "祁縣", "id": "101100409", "zh": "祁县"}, {
            "en": "pingyao",
            "hk": "平遙",
            "id": "101100410",
            "zh": "平遥"
        }, {"en": "lingshi", "hk": "靈石", "id": "101100411", "zh": "灵石"}, {
            "en": "jiexiu",
            "hk": "介休",
            "id": "101100412",
            "zh": "介休"
        }], "en": "jinzhong", "hk": "晉中", "id": "104", "zh": "晋中"
    }, {
        "children": [{"en": "changzhi", "hk": "長治", "id": "101100501", "zh": "长治"}, {
            "en": "licheng",
            "hk": "黎城",
            "id": "101100502",
            "zh": "黎城"
        }, {"en": "tunliu", "hk": "屯留", "id": "101100503", "zh": "屯留"}, {
            "en": "lucheng",
            "hk": "潞城",
            "id": "101100504",
            "zh": "潞城"
        }, {"en": "xiangyuan", "hk": "襄垣", "id": "101100505", "zh": "襄垣"}, {
            "en": "pingshun",
            "hk": "平順",
            "id": "101100506",
            "zh": "平顺"
        }, {"en": "wuxiang", "hk": "武鄉", "id": "101100507", "zh": "武乡"}, {
            "en": "qinxian",
            "hk": "沁縣",
            "id": "101100508",
            "zh": "沁县"
        }, {"en": "zhangzi", "hk": "長子", "id": "101100509", "zh": "长子"}, {
            "en": "qinyuan",
            "hk": "沁源",
            "id": "101100510",
            "zh": "沁源"
        }, {"en": "huguan", "hk": "壺關", "id": "101100511", "zh": "壶关"}, {
            "en": "jiaoqu",
            "hk": "郊區",
            "id": "101100512",
            "zh": "郊区"
        }], "en": "changzhi", "hk": "長治", "id": "105", "zh": "长治"
    }, {
        "children": [{"en": "jincheng", "hk": "晉城", "id": "101100601", "zh": "晋城"}, {
            "en": "qinshui",
            "hk": "沁水",
            "id": "101100602",
            "zh": "沁水"
        }, {"en": "yangcheng", "hk": "陽城", "id": "101100603", "zh": "阳城"}, {
            "en": "lingchuan",
            "hk": "陵川",
            "id": "101100604",
            "zh": "陵川"
        }, {"en": "gaoping", "hk": "高平", "id": "101100605", "zh": "高平"}, {
            "en": "zezhou",
            "hk": "澤州",
            "id": "101100606",
            "zh": "泽州"
        }], "en": "jincheng", "hk": "晉城", "id": "106", "zh": "晋城"
    }, {
        "children": [{"en": "linfen", "hk": "臨汾", "id": "101100701", "zh": "临汾"}, {
            "en": "quwo",
            "hk": "曲沃",
            "id": "101100702",
            "zh": "曲沃"
        }, {"en": "yonghe", "hk": "永和", "id": "101100703", "zh": "永和"}, {
            "en": "xixian",
            "hk": "隰縣",
            "id": "101100704",
            "zh": "隰县"
        }, {"en": "daning", "hk": "大寧", "id": "101100705", "zh": "大宁"}, {
            "en": "jixian",
            "hk": "吉縣",
            "id": "101100706",
            "zh": "吉县"
        }, {"en": "xiangfen", "hk": "襄汾", "id": "101100707", "zh": "襄汾"}, {
            "en": "puxian",
            "hk": "蒲縣",
            "id": "101100708",
            "zh": "蒲县"
        }, {"en": "fenxi", "hk": "汾西", "id": "101100709", "zh": "汾西"}, {
            "en": "hongtong",
            "hk": "洪洞",
            "id": "101100710",
            "zh": "洪洞"
        }, {"en": "huozhou", "hk": "霍州", "id": "101100711", "zh": "霍州"}, {
            "en": "xiangning",
            "hk": "鄉寧",
            "id": "101100712",
            "zh": "乡宁"
        }, {"en": "yicheng", "hk": "翼城", "id": "101100713", "zh": "翼城"}, {
            "en": "houma",
            "hk": "侯馬",
            "id": "101100714",
            "zh": "侯马"
        }, {"en": "fushan", "hk": "浮山", "id": "101100715", "zh": "浮山"}, {
            "en": "anze",
            "hk": "安澤",
            "id": "101100716",
            "zh": "安泽"
        }, {"en": "guxian", "hk": "古縣", "id": "101100717", "zh": "古县"}, {
            "en": "yaodou",
            "hk": "堯都",
            "id": "101100718",
            "zh": "尧都"
        }], "en": "linfen", "hk": "臨汾", "id": "107", "zh": "临汾"
    }, {
        "children": [{"en": "yuncheng", "hk": "運城", "id": "101100801", "zh": "运城"}, {
            "en": "linyi",
            "hk": "臨猗",
            "id": "101100802",
            "zh": "临猗"
        }, {"en": "jishan", "hk": "稷山", "id": "101100803", "zh": "稷山"}, {
            "en": "wanrong",
            "hk": "萬榮",
            "id": "101100804",
            "zh": "万荣"
        }, {"en": "hejin", "hk": "河津", "id": "101100805", "zh": "河津"}, {
            "en": "xinjiang",
            "hk": "新絳",
            "id": "101100806",
            "zh": "新绛"
        }, {"en": "jiangxian", "hk": "絳縣", "id": "101100807", "zh": "绛县"}, {
            "en": "wenxi",
            "hk": "聞喜",
            "id": "101100808",
            "zh": "闻喜"
        }, {"en": "yuanqu", "hk": "垣曲", "id": "101100809", "zh": "垣曲"}, {
            "en": "yongji",
            "hk": "永濟",
            "id": "101100810",
            "zh": "永济"
        }, {"en": "ruicheng", "hk": "芮城", "id": "101100811", "zh": "芮城"}, {
            "en": "xiaxian",
            "hk": "夏縣",
            "id": "101100812",
            "zh": "夏县"
        }, {"en": "pinglu", "hk": "平陸", "id": "101100813", "zh": "平陆"}, {
            "en": "yanhu",
            "hk": "鹽湖",
            "id": "101100814",
            "zh": "盐湖"
        }], "en": "yuncheng", "hk": "運城", "id": "108", "zh": "运城"
    }, {
        "children": [{"en": "shuozhou", "hk": "朔州", "id": "101100901", "zh": "朔州"}, {
            "en": "pinglu",
            "hk": "平魯",
            "id": "101100902",
            "zh": "平鲁"
        }, {"en": "shanyin", "hk": "山陰", "id": "101100903", "zh": "山阴"}, {
            "en": "youyu",
            "hk": "右玉",
            "id": "101100904",
            "zh": "右玉"
        }, {"en": "yingxian", "hk": "應縣", "id": "101100905", "zh": "应县"}, {
            "en": "huairen",
            "hk": "懷仁",
            "id": "101100906",
            "zh": "怀仁"
        }, {"en": "shuocheng", "hk": "朔城", "id": "101100907", "zh": "朔城"}],
        "en": "shuozhou",
        "hk": "朔州",
        "id": "109",
        "zh": "朔州"
    }, {
        "children": [{"en": "xinzhou", "hk": "忻州", "id": "101101001", "zh": "忻州"}, {
            "en": "dingxiang",
            "hk": "定襄",
            "id": "101101002",
            "zh": "定襄"
        }, {"en": "wutaixian", "hk": "五台縣", "id": "101101003", "zh": "五台县"}, {
            "en": "hequ",
            "hk": "河曲",
            "id": "101101004",
            "zh": "河曲"
        }, {"en": "pianguan", "hk": "偏關", "id": "101101005", "zh": "偏关"}, {
            "en": "shenchi",
            "hk": "神池",
            "id": "101101006",
            "zh": "神池"
        }, {"en": "ningwu", "hk": "寧武", "id": "101101007", "zh": "宁武"}, {
            "en": "daixian",
            "hk": "代縣",
            "id": "101101008",
            "zh": "代县"
        }, {"en": "fanshi", "hk": "繁峙", "id": "101101009", "zh": "繁峙"}, {
            "en": "bode",
            "hk": "保德",
            "id": "101101011",
            "zh": "保德"
        }, {"en": "jingle", "hk": "靜樂", "id": "101101012", "zh": "静乐"}, {
            "en": "kelan",
            "hk": "岢嵐",
            "id": "101101013",
            "zh": "岢岚"
        }, {"en": "wuzhai", "hk": "五寨", "id": "101101014", "zh": "五寨"}, {
            "en": "yuanping",
            "hk": "原平",
            "id": "101101015",
            "zh": "原平"
        }, {"en": "xinfu", "hk": "忻府", "id": "101101016", "zh": "忻府"}, {
            "en": "wutaishan",
            "hk": "五臺山",
            "id": "101101010",
            "zh": "五台山"
        }], "en": "xinzhou", "hk": "忻州", "id": "110", "zh": "忻州"
    }, {
        "children": [{"en": "lvliang", "hk": "呂梁", "id": "101101100", "zh": "吕梁"}, {
            "en": "lishi",
            "hk": "離石",
            "id": "101101101",
            "zh": "离石"
        }, {"en": "linxian", "hk": "臨縣", "id": "101101102", "zh": "临县"}, {
            "en": "xingxian",
            "hk": "興縣",
            "id": "101101103",
            "zh": "兴县"
        }, {"en": "lanxian", "hk": "嵐縣", "id": "101101104", "zh": "岚县"}, {
            "en": "liulin",
            "hk": "柳林",
            "id": "101101105",
            "zh": "柳林"
        }, {"en": "shilou", "hk": "石樓", "id": "101101106", "zh": "石楼"}, {
            "en": "fangshan",
            "hk": "方山",
            "id": "101101107",
            "zh": "方山"
        }, {"en": "jiaokou", "hk": "交口", "id": "101101108", "zh": "交口"}, {
            "en": "zhongyang",
            "hk": "中陽",
            "id": "101101109",
            "zh": "中阳"
        }, {"en": "xiaoyi", "hk": "孝義", "id": "101101110", "zh": "孝义"}, {
            "en": "fenyang",
            "hk": "汾陽",
            "id": "101101111",
            "zh": "汾阳"
        }, {"en": "wenshui", "hk": "文水", "id": "101101112", "zh": "文水"}, {
            "en": "jiaocheng",
            "hk": "交城",
            "id": "101101113",
            "zh": "交城"
        }], "en": "lvliang", "hk": "呂梁", "id": "111", "zh": "吕梁"
    }], "en": "shanxi", "hk": "山西", "id": "100", "zh": "山西"
}, {
    "children": [{
        "children": [{"en": "jinan", "hk": "濟南", "id": "101120101", "zh": "济南"}, {
            "en": "changqing",
            "hk": "長清",
            "id": "101120102",
            "zh": "长清"
        }, {"en": "shanghe", "hk": "商河", "id": "101120103", "zh": "商河"}, {
            "en": "zhangqiu",
            "hk": "章丘",
            "id": "101120104",
            "zh": "章丘"
        }, {"en": "pingyin", "hk": "平陰", "id": "101120105", "zh": "平阴"}, {
            "en": "jiyang",
            "hk": "濟陽",
            "id": "101120106",
            "zh": "济阳"
        }, {"en": "lixia", "hk": "歷下", "id": "101120107", "zh": "历下"}, {
            "en": "shizhong",
            "hk": "市中",
            "id": "101120108",
            "zh": "市中"
        }, {"en": "huaiyin", "hk": "槐蔭", "id": "101120109", "zh": "槐荫"}, {
            "en": "tianqiao",
            "hk": "天橋",
            "id": "101120110",
            "zh": "天桥"
        }, {"en": "licheng", "hk": "歷城", "id": "101120111", "zh": "历城"}],
        "en": "jinan",
        "hk": "濟南",
        "id": "113",
        "zh": "济南"
    }, {
        "children": [{"en": "qingdao", "hk": "青島", "id": "101120201", "zh": "青岛"}, {
            "en": "laoshan",
            "hk": "嶗山",
            "id": "101120202",
            "zh": "崂山"
        }, {"en": "jimo", "hk": "即墨", "id": "101120204", "zh": "即墨"}, {
            "en": "jiaozhou",
            "hk": "膠州",
            "id": "101120205",
            "zh": "胶州"
        }, {"en": "huangdao", "hk": "黃島", "id": "101120206", "zh": "黄岛"}, {
            "en": "laixi",
            "hk": "萊西",
            "id": "101120207",
            "zh": "莱西"
        }, {"en": "pingdu", "hk": "平度", "id": "101120208", "zh": "平度"}, {
            "en": "shinan",
            "hk": "市南",
            "id": "101120203",
            "zh": "市南"
        }, {"en": "shibei", "hk": "市北", "id": "101120209", "zh": "市北"}, {
            "en": "licang",
            "hk": "李滄",
            "id": "101120210",
            "zh": "李沧"
        }, {"en": "chengyang", "hk": "城陽", "id": "101120211", "zh": "城阳"}],
        "en": "qingdao",
        "hk": "青島",
        "id": "114",
        "zh": "青岛"
    }, {
        "children": [{"en": "zibo", "hk": "淄博", "id": "101120301", "zh": "淄博"}, {
            "en": "zichuan",
            "hk": "淄川",
            "id": "101120302",
            "zh": "淄川"
        }, {"en": "boshan", "hk": "博山", "id": "101120303", "zh": "博山"}, {
            "en": "gaoqing",
            "hk": "高青",
            "id": "101120304",
            "zh": "高青"
        }, {"en": "zhoucun", "hk": "周村", "id": "101120305", "zh": "周村"}, {
            "en": "yiyuan",
            "hk": "沂源",
            "id": "101120306",
            "zh": "沂源"
        }, {"en": "huantai", "hk": "桓台", "id": "101120307", "zh": "桓台"}, {
            "en": "linzi",
            "hk": "臨淄",
            "id": "101120308",
            "zh": "临淄"
        }, {"en": "zhangdian", "hk": "張店", "id": "101120309", "zh": "张店"}],
        "en": "zibo",
        "hk": "淄博",
        "id": "115",
        "zh": "淄博"
    }, {
        "children": [{"en": "dezhou", "hk": "德州", "id": "101120401", "zh": "德州"}, {
            "en": "wucheng",
            "hk": "武城",
            "id": "101120402",
            "zh": "武城"
        }, {"en": "linyi", "hk": "臨邑", "id": "101120403", "zh": "临邑"}, {
            "en": "qihe",
            "hk": "齊河",
            "id": "101120405",
            "zh": "齐河"
        }, {"en": "leling", "hk": "樂陵", "id": "101120406", "zh": "乐陵"}, {
            "en": "qingyun",
            "hk": "慶雲",
            "id": "101120407",
            "zh": "庆云"
        }, {"en": "pingyuan", "hk": "平原", "id": "101120408", "zh": "平原"}, {
            "en": "ningjin",
            "hk": "寧津",
            "id": "101120409",
            "zh": "宁津"
        }, {"en": "xiajin", "hk": "夏津", "id": "101120410", "zh": "夏津"}, {
            "en": "yucheng",
            "hk": "禹城",
            "id": "101120411",
            "zh": "禹城"
        }, {"en": "decheng", "hk": "德城", "id": "101120412", "zh": "德城"}, {
            "en": "lingcheng",
            "hk": "陵城",
            "id": "101120413",
            "zh": "陵城"
        }, {"en": "lingxian", "hk": "陵縣", "id": "101120404", "zh": "陵县"}],
        "en": "dezhou",
        "hk": "德州",
        "id": "116",
        "zh": "德州"
    }, {
        "children": [{"en": "yantai", "hk": "煙台", "id": "101120501", "zh": "烟台"}, {
            "en": "laizhou",
            "hk": "萊州",
            "id": "101120502",
            "zh": "莱州"
        }, {"en": "changdao", "hk": "長島", "id": "101120503", "zh": "长岛"}, {
            "en": "penglai",
            "hk": "蓬萊",
            "id": "101120504",
            "zh": "蓬莱"
        }, {"en": "longkou", "hk": "龍口", "id": "101120505", "zh": "龙口"}, {
            "en": "zhaoyuan",
            "hk": "招遠",
            "id": "101120506",
            "zh": "招远"
        }, {"en": "qixia", "hk": "棲霞", "id": "101120507", "zh": "栖霞"}, {
            "en": "fushan",
            "hk": "福山",
            "id": "101120508",
            "zh": "福山"
        }, {"en": "moup", "hk": "牟平", "id": "101120509", "zh": "牟平"}, {
            "en": "laiyang",
            "hk": "萊陽",
            "id": "101120510",
            "zh": "莱阳"
        }, {"en": "haiyang", "hk": "海陽", "id": "101120511", "zh": "海阳"}, {
            "en": "zhifu",
            "hk": "芝罘",
            "id": "101120512",
            "zh": "芝罘"
        }, {"en": "laishan", "hk": "萊山", "id": "101120513", "zh": "莱山"}],
        "en": "yantai",
        "hk": "煙台",
        "id": "117",
        "zh": "烟台"
    }, {
        "children": [{"en": "weifang", "hk": "濰坊", "id": "101120601", "zh": "潍坊"}, {
            "en": "qingzhou",
            "hk": "青州",
            "id": "101120602",
            "zh": "青州"
        }, {"en": "shouguang", "hk": "壽光", "id": "101120603", "zh": "寿光"}, {
            "en": "linqu",
            "hk": "臨朐",
            "id": "101120604",
            "zh": "临朐"
        }, {"en": "changle", "hk": "昌樂", "id": "101120605", "zh": "昌乐"}, {
            "en": "changyi",
            "hk": "昌邑",
            "id": "101120606",
            "zh": "昌邑"
        }, {"en": "anqiu", "hk": "安丘", "id": "101120607", "zh": "安丘"}, {
            "en": "gaomi",
            "hk": "高密",
            "id": "101120608",
            "zh": "高密"
        }, {"en": "zhucheng", "hk": "諸城", "id": "101120609", "zh": "诸城"}, {
            "en": "weicheng",
            "hk": "濰城",
            "id": "101120610",
            "zh": "潍城"
        }, {"en": "hanting", "hk": "寒亭", "id": "101120611", "zh": "寒亭"}, {
            "en": "fangzi",
            "hk": "坊子",
            "id": "101120612",
            "zh": "坊子"
        }, {"en": "kuiwen", "hk": "奎文", "id": "101120613", "zh": "奎文"}],
        "en": "weifang",
        "hk": "濰坊",
        "id": "118",
        "zh": "潍坊"
    }, {
        "children": [{"en": "jining", "hk": "濟寧", "id": "101120701", "zh": "济宁"}, {
            "en": "jiaxiang",
            "hk": "嘉祥",
            "id": "101120702",
            "zh": "嘉祥"
        }, {"en": "weishan", "hk": "微山", "id": "101120703", "zh": "微山"}, {
            "en": "yutai",
            "hk": "魚台",
            "id": "101120704",
            "zh": "鱼台"
        }, {"en": "yanzhou", "hk": "兗州", "id": "101120705", "zh": "兖州"}, {
            "en": "jinxiang",
            "hk": "金鄉",
            "id": "101120706",
            "zh": "金乡"
        }, {"en": "wenshang", "hk": "汶上", "id": "101120707", "zh": "汶上"}, {
            "en": "sishui",
            "hk": "泗水",
            "id": "101120708",
            "zh": "泗水"
        }, {"en": "liangshan", "hk": "梁山", "id": "101120709", "zh": "梁山"}, {
            "en": "qufu",
            "hk": "曲阜",
            "id": "101120710",
            "zh": "曲阜"
        }, {"en": "zoucheng", "hk": "鄒城", "id": "101120711", "zh": "邹城"}, {
            "en": "rencheng",
            "hk": "任城",
            "id": "101120712",
            "zh": "任城"
        }], "en": "jining", "hk": "濟寧", "id": "119", "zh": "济宁"
    }, {
        "children": [{"en": "taian", "hk": "泰安", "id": "101120801", "zh": "泰安"}, {
            "en": "xintai",
            "hk": "新泰",
            "id": "101120802",
            "zh": "新泰"
        }, {"en": "feicheng", "hk": "肥城", "id": "101120804", "zh": "肥城"}, {
            "en": "dongping",
            "hk": "東平",
            "id": "101120805",
            "zh": "东平"
        }, {"en": "ningyang", "hk": "寧陽", "id": "101120806", "zh": "宁阳"}, {
            "en": "taishan",
            "hk": "泰山",
            "id": "101120803",
            "zh": "泰山"
        }, {"en": "daiyue", "hk": "岱岳", "id": "101120807", "zh": "岱岳"}],
        "en": "taian",
        "hk": "泰安",
        "id": "120",
        "zh": "泰安"
    }, {
        "children": [{"en": "linyi", "hk": "臨沂", "id": "101120901", "zh": "临沂"}, {
            "en": "junan",
            "hk": "莒南",
            "id": "101120902",
            "zh": "莒南"
        }, {"en": "yinan", "hk": "沂南", "id": "101120903", "zh": "沂南"}, {
            "en": "lanling",
            "hk": "蘭陵",
            "id": "101120904",
            "zh": "兰陵"
        }, {"en": "linshu", "hk": "臨沭", "id": "101120905", "zh": "临沭"}, {
            "en": "tancheng",
            "hk": "郯城",
            "id": "101120906",
            "zh": "郯城"
        }, {"en": "mengyin", "hk": "蒙陰", "id": "101120907", "zh": "蒙阴"}, {
            "en": "pingyi",
            "hk": "平邑",
            "id": "101120908",
            "zh": "平邑"
        }, {"en": "feixian", "hk": "費縣", "id": "101120909", "zh": "费县"}, {
            "en": "yishui",
            "hk": "沂水",
            "id": "101120910",
            "zh": "沂水"
        }, {"en": "lanshan", "hk": "蘭山", "id": "101120911", "zh": "兰山"}, {
            "en": "luozhuang",
            "hk": "羅莊",
            "id": "101120912",
            "zh": "罗庄"
        }, {"en": "hedong", "hk": "河東", "id": "101120913", "zh": "河东"}],
        "en": "linyi",
        "hk": "臨沂",
        "id": "121",
        "zh": "临沂"
    }, {
        "children": [{"en": "heze", "hk": "菏澤", "id": "101121001", "zh": "菏泽"}, {
            "en": "juancheng",
            "hk": "鄄城",
            "id": "101121002",
            "zh": "鄄城"
        }, {"en": "yuncheng", "hk": "鄆城", "id": "101121003", "zh": "郓城"}, {
            "en": "dongming",
            "hk": "東明",
            "id": "101121004",
            "zh": "东明"
        }, {"en": "dingtao", "hk": "定陶", "id": "101121005", "zh": "定陶"}, {
            "en": "juye",
            "hk": "鉅野",
            "id": "101121006",
            "zh": "巨野"
        }, {"en": "caoxian", "hk": "曹縣", "id": "101121007", "zh": "曹县"}, {
            "en": "chengwu",
            "hk": "成武",
            "id": "101121008",
            "zh": "成武"
        }, {"en": "shanxian", "hk": "單縣", "id": "101121009", "zh": "单县"}, {
            "en": "mudan",
            "hk": "牡丹",
            "id": "101121010",
            "zh": "牡丹"
        }], "en": "heze", "hk": "菏澤", "id": "122", "zh": "菏泽"
    }, {
        "children": [{"en": "binzhou", "hk": "濱州", "id": "101121101", "zh": "滨州"}, {
            "en": "boxing",
            "hk": "博興",
            "id": "101121102",
            "zh": "博兴"
        }, {"en": "wudi", "hk": "無棣", "id": "101121103", "zh": "无棣"}, {
            "en": "yangxin",
            "hk": "陽信",
            "id": "101121104",
            "zh": "阳信"
        }, {"en": "huimin", "hk": "惠民", "id": "101121105", "zh": "惠民"}, {
            "en": "zhanhua",
            "hk": "沾化",
            "id": "101121106",
            "zh": "沾化"
        }, {"en": "zouping", "hk": "鄒平", "id": "101121107", "zh": "邹平"}, {
            "en": "bincheng",
            "hk": "濱城",
            "id": "101121108",
            "zh": "滨城"
        }], "en": "binzhou", "hk": "濱州", "id": "123", "zh": "滨州"
    }, {
        "children": [{"en": "dongying", "hk": "東營", "id": "101121201", "zh": "东营"}, {
            "en": "hekou",
            "hk": "河口",
            "id": "101121202",
            "zh": "河口"
        }, {"en": "kenli", "hk": "墾利", "id": "101121203", "zh": "垦利"}, {
            "en": "lijin",
            "hk": "利津",
            "id": "101121204",
            "zh": "利津"
        }, {"en": "guangrao", "hk": "廣饒", "id": "101121205", "zh": "广饶"}],
        "en": "dongying",
        "hk": "東營",
        "id": "124",
        "zh": "东营"
    }, {
        "children": [{"en": "weihai", "hk": "威海", "id": "101121301", "zh": "威海"}, {
            "en": "wendeng",
            "hk": "文登",
            "id": "101121302",
            "zh": "文登"
        }, {"en": "rongcheng", "hk": "榮成", "id": "101121303", "zh": "荣成"}, {
            "en": "rushan",
            "hk": "乳山",
            "id": "101121304",
            "zh": "乳山"
        }, {"en": "huancui", "hk": "環翠", "id": "101121307", "zh": "环翠"}, {
            "en": "chengshantou",
            "hk": "成山頭",
            "id": "101121305",
            "zh": "成山头"
        }, {"en": "shidao", "hk": "石島", "id": "101121306", "zh": "石岛"}],
        "en": "weihai",
        "hk": "威海",
        "id": "125",
        "zh": "威海"
    }, {
        "children": [{"en": "zaozhuang", "hk": "棗莊", "id": "101121401", "zh": "枣庄"}, {
            "en": "xuecheng",
            "hk": "薛城",
            "id": "101121402",
            "zh": "薛城"
        }, {"en": "yicheng", "hk": "嶧城", "id": "101121403", "zh": "峄城"}, {
            "en": "taierzhuang",
            "hk": "台兒莊",
            "id": "101121404",
            "zh": "台儿庄"
        }, {"en": "tengzhou", "hk": "滕州", "id": "101121405", "zh": "滕州"}, {
            "en": "shizhong",
            "hk": "市中",
            "id": "101121406",
            "zh": "市中"
        }, {"en": "shanting", "hk": "山亭", "id": "101121407", "zh": "山亭"}],
        "en": "zaozhuang",
        "hk": "棗莊",
        "id": "126",
        "zh": "枣庄"
    }, {
        "children": [{"en": "rizhao", "hk": "日照", "id": "101121501", "zh": "日照"}, {
            "en": "wulian",
            "hk": "五蓮",
            "id": "101121502",
            "zh": "五莲"
        }, {"en": "juxian", "hk": "莒縣", "id": "101121503", "zh": "莒县"}, {
            "en": "donggang",
            "hk": "東港",
            "id": "101121504",
            "zh": "东港"
        }, {"en": "lanshan", "hk": "嵐山", "id": "101121505", "zh": "岚山"}],
        "en": "rizhao",
        "hk": "日照",
        "id": "127",
        "zh": "日照"
    }, {
        "children": [{"en": "laiwu", "hk": "萊蕪", "id": "101121601", "zh": "莱芜"}, {
            "en": "laicheng",
            "hk": "萊城",
            "id": "101121602",
            "zh": "莱城"
        }, {"en": "gangcheng", "hk": "鋼城", "id": "101121603", "zh": "钢城"}],
        "en": "laiwu",
        "hk": "萊蕪",
        "id": "128",
        "zh": "莱芜"
    }, {
        "children": [{"en": "liaocheng", "hk": "聊城", "id": "101121701", "zh": "聊城"}, {
            "en": "guanxian",
            "hk": "冠縣",
            "id": "101121702",
            "zh": "冠县"
        }, {"en": "yanggu", "hk": "陽谷", "id": "101121703", "zh": "阳谷"}, {
            "en": "gaotang",
            "hk": "高唐",
            "id": "101121704",
            "zh": "高唐"
        }, {"en": "chiping", "hk": "茌平", "id": "101121705", "zh": "茌平"}, {
            "en": "donge",
            "hk": "東阿",
            "id": "101121706",
            "zh": "东阿"
        }, {"en": "linqing", "hk": "臨清", "id": "101121707", "zh": "临清"}, {
            "en": "shenxian",
            "hk": "莘縣",
            "id": "101121709",
            "zh": "莘县"
        }, {"en": "dongchangfu", "hk": "東昌府", "id": "101121708", "zh": "东昌府"}],
        "en": "liaocheng",
        "hk": "聊城",
        "id": "129",
        "zh": "聊城"
    }], "en": "shandong", "hk": "山東", "id": "112", "zh": "山东"
}, {
    "children": [{
        "children": [{"en": "nanjing", "hk": "南京", "id": "101190101", "zh": "南京"}, {
            "en": "lishui",
            "hk": "溧水",
            "id": "101190102",
            "zh": "溧水"
        }, {"en": "gaochun", "hk": "高淳", "id": "101190103", "zh": "高淳"}, {
            "en": "jiangning",
            "hk": "江寧",
            "id": "101190104",
            "zh": "江宁"
        }, {"en": "luhe", "hk": "六合", "id": "101190105", "zh": "六合"}, {
            "en": "pukou",
            "hk": "浦口",
            "id": "101190107",
            "zh": "浦口"
        }, {"en": "xuanwu", "hk": "玄武", "id": "101190108", "zh": "玄武"}, {
            "en": "qinhuai",
            "hk": "秦淮",
            "id": "101190109",
            "zh": "秦淮"
        }, {"en": "jianye", "hk": "建鄴", "id": "101190110", "zh": "建邺"}, {
            "en": "gulou",
            "hk": "鼓樓",
            "id": "101190111",
            "zh": "鼓楼"
        }, {"en": "qixia", "hk": "棲霞", "id": "101190112", "zh": "栖霞"}, {
            "en": "yuhuatai",
            "hk": "雨花台",
            "id": "101190113",
            "zh": "雨花台"
        }], "en": "nanjing", "hk": "南京", "id": "131", "zh": "南京"
    }, {
        "children": [{"en": "wuxi", "hk": "無錫", "id": "101190201", "zh": "无锡"}, {
            "en": "jiangyin",
            "hk": "江陰",
            "id": "101190202",
            "zh": "江阴"
        }, {"en": "yixing", "hk": "宜興", "id": "101190203", "zh": "宜兴"}, {
            "en": "xishan",
            "hk": "錫山",
            "id": "101190204",
            "zh": "锡山"
        }, {"en": "huishan", "hk": "惠山", "id": "101190205", "zh": "惠山"}, {
            "en": "binhu",
            "hk": "濱湖",
            "id": "101190206",
            "zh": "滨湖"
        }, {"en": "liangxi", "hk": "梁溪", "id": "101190207", "zh": "梁溪"}, {
            "en": "xinwu",
            "hk": "新吳",
            "id": "101190208",
            "zh": "新吴"
        }], "en": "wuxi", "hk": "無錫", "id": "132", "zh": "无锡"
    }, {
        "children": [{"en": "zhenjiang", "hk": "鎮江", "id": "101190301", "zh": "镇江"}, {
            "en": "danyang",
            "hk": "丹陽",
            "id": "101190302",
            "zh": "丹阳"
        }, {"en": "yangzhong", "hk": "揚中", "id": "101190303", "zh": "扬中"}, {
            "en": "jurong",
            "hk": "句容",
            "id": "101190304",
            "zh": "句容"
        }, {"en": "dantu", "hk": "丹徒", "id": "101190305", "zh": "丹徒"}, {
            "en": "jingkou",
            "hk": "京口",
            "id": "101190306",
            "zh": "京口"
        }, {"en": "runzhou", "hk": "潤州", "id": "101190307", "zh": "润州"}],
        "en": "zhenjiang",
        "hk": "鎮江",
        "id": "133",
        "zh": "镇江"
    }, {
        "children": [{"en": "suzhou", "hk": "蘇州", "id": "101190401", "zh": "苏州"}, {
            "en": "changshu",
            "hk": "常熟",
            "id": "101190402",
            "zh": "常熟"
        }, {"en": "zhangjiagang", "hk": "張家港", "id": "101190403", "zh": "张家港"}, {
            "en": "kunshan",
            "hk": "崑山",
            "id": "101190404",
            "zh": "昆山"
        }, {"en": "wuzhong", "hk": "吳中", "id": "101190405", "zh": "吴中"}, {
            "en": "wujiang",
            "hk": "吳江",
            "id": "101190407",
            "zh": "吴江"
        }, {"en": "taicang", "hk": "太倉", "id": "101190408", "zh": "太仓"}, {
            "en": "huqiu",
            "hk": "虎丘",
            "id": "101190406",
            "zh": "虎丘"
        }, {"en": "xiangcheng", "hk": "相城", "id": "101190409", "zh": "相城"}, {
            "en": "gusu",
            "hk": "姑蘇",
            "id": "101190410",
            "zh": "姑苏"
        }], "en": "suzhou", "hk": "蘇州", "id": "134", "zh": "苏州"
    }, {
        "children": [{"en": "nantong", "hk": "南通", "id": "101190501", "zh": "南通"}, {
            "en": "haian",
            "hk": "海安",
            "id": "101190502",
            "zh": "海安"
        }, {"en": "rugao", "hk": "如皋", "id": "101190503", "zh": "如皋"}, {
            "en": "rudong",
            "hk": "如東",
            "id": "101190504",
            "zh": "如东"
        }, {"en": "qidong", "hk": "啟東", "id": "101190507", "zh": "启东"}, {
            "en": "haimen",
            "hk": "海門",
            "id": "101190508",
            "zh": "海门"
        }, {"en": "tongzhou", "hk": "通州", "id": "101190509", "zh": "通州"}, {
            "en": "chongchuan",
            "hk": "崇川",
            "id": "101190505",
            "zh": "崇川"
        }, {"en": "gangzha", "hk": "港閘", "id": "101190506", "zh": "港闸"}],
        "en": "nantong",
        "hk": "南通",
        "id": "135",
        "zh": "南通"
    }, {
        "children": [{"en": "yangzhou", "hk": "揚州", "id": "101190601", "zh": "扬州"}, {
            "en": "baoying",
            "hk": "寶應",
            "id": "101190602",
            "zh": "宝应"
        }, {"en": "yizheng", "hk": "儀征", "id": "101190603", "zh": "仪征"}, {
            "en": "gaoyou",
            "hk": "高郵",
            "id": "101190604",
            "zh": "高邮"
        }, {"en": "jiangdu", "hk": "江都", "id": "101190605", "zh": "江都"}, {
            "en": "hanjiang",
            "hk": "邗江",
            "id": "101190606",
            "zh": "邗江"
        }, {"en": "guangling", "hk": "廣陵", "id": "101190607", "zh": "广陵"}],
        "en": "yangzhou",
        "hk": "揚州",
        "id": "136",
        "zh": "扬州"
    }, {
        "children": [{"en": "yancheng", "hk": "鹽城", "id": "101190701", "zh": "盐城"}, {
            "en": "xiangshui",
            "hk": "響水",
            "id": "101190702",
            "zh": "响水"
        }, {"en": "binhai", "hk": "濱海", "id": "101190703", "zh": "滨海"}, {
            "en": "funing",
            "hk": "阜寧",
            "id": "101190704",
            "zh": "阜宁"
        }, {"en": "sheyang", "hk": "射陽", "id": "101190705", "zh": "射阳"}, {
            "en": "jianhu",
            "hk": "建湖",
            "id": "101190706",
            "zh": "建湖"
        }, {"en": "dongtai", "hk": "東台", "id": "101190707", "zh": "东台"}, {
            "en": "dafeng",
            "hk": "大豐",
            "id": "101190708",
            "zh": "大丰"
        }, {"en": "yandu", "hk": "鹽都", "id": "101190709", "zh": "盐都"}, {
            "en": "tinghu",
            "hk": "亭湖",
            "id": "101190710",
            "zh": "亭湖"
        }], "en": "yancheng", "hk": "鹽城", "id": "137", "zh": "盐城"
    }, {
        "children": [{"en": "xuzhou", "hk": "徐州", "id": "101190801", "zh": "徐州"}, {
            "en": "tongshan",
            "hk": "銅山",
            "id": "101190802",
            "zh": "铜山"
        }, {"en": "fengxian", "hk": "豐縣", "id": "101190803", "zh": "丰县"}, {
            "en": "peixian",
            "hk": "沛縣",
            "id": "101190804",
            "zh": "沛县"
        }, {"en": "pizhou", "hk": "邳州", "id": "101190805", "zh": "邳州"}, {
            "en": "suining",
            "hk": "睢寧",
            "id": "101190806",
            "zh": "睢宁"
        }, {"en": "xinyi", "hk": "新沂", "id": "101190807", "zh": "新沂"}, {
            "en": "gulou",
            "hk": "鼓樓",
            "id": "101190808",
            "zh": "鼓楼"
        }, {"en": "yunlong", "hk": "雲龍", "id": "101190809", "zh": "云龙"}, {
            "en": "jiawang",
            "hk": "賈汪",
            "id": "101190810",
            "zh": "贾汪"
        }, {"en": "quanshan", "hk": "泉山", "id": "101190811", "zh": "泉山"}],
        "en": "xuzhou",
        "hk": "徐州",
        "id": "138",
        "zh": "徐州"
    }, {
        "children": [{"en": "huaian", "hk": "淮安", "id": "101190901", "zh": "淮安"}, {
            "en": "jinhu",
            "hk": "金湖",
            "id": "101190902",
            "zh": "金湖"
        }, {"en": "xuyi", "hk": "盱眙", "id": "101190903", "zh": "盱眙"}, {
            "en": "hongze",
            "hk": "洪澤",
            "id": "101190904",
            "zh": "洪泽"
        }, {"en": "lianshui", "hk": "漣水", "id": "101190905", "zh": "涟水"}, {
            "en": "huaiyinqu",
            "hk": "淮陰區",
            "id": "101190906",
            "zh": "淮阴区"
        }, {"en": "huaianqu", "hk": "淮安區", "id": "101190908", "zh": "淮安区"}, {
            "en": "qingjiangpu",
            "hk": "清江浦",
            "id": "101190907",
            "zh": "清江浦"
        }], "en": "huaian", "hk": "淮安", "id": "139", "zh": "淮安"
    }, {
        "children": [{"en": "lianyungang", "hk": "連雲港", "id": "101191001", "zh": "连云港"}, {
            "en": "donghai",
            "hk": "東海",
            "id": "101191002",
            "zh": "东海"
        }, {"en": "ganyu", "hk": "贛榆", "id": "101191003", "zh": "赣榆"}, {
            "en": "guanyun",
            "hk": "灌雲",
            "id": "101191004",
            "zh": "灌云"
        }, {"en": "guannan", "hk": "灌南", "id": "101191005", "zh": "灌南"}, {
            "en": "haizhou",
            "hk": "海州",
            "id": "101191006",
            "zh": "海州"
        }, {"en": "lianyun", "hk": "連雲", "id": "101191007", "zh": "连云"}],
        "en": "lianyungang",
        "hk": "連雲港",
        "id": "140",
        "zh": "连云港"
    }, {
        "children": [{"en": "changzhou", "hk": "常州", "id": "101191101", "zh": "常州"}, {
            "en": "liyang",
            "hk": "溧陽",
            "id": "101191102",
            "zh": "溧阳"
        }, {"en": "jintan", "hk": "金壇", "id": "101191103", "zh": "金坛"}, {
            "en": "wujin",
            "hk": "武進",
            "id": "101191104",
            "zh": "武进"
        }, {"en": "tianning", "hk": "天寧", "id": "101191105", "zh": "天宁"}, {
            "en": "zhonglou",
            "hk": "鐘樓",
            "id": "101191106",
            "zh": "钟楼"
        }, {"en": "xinbei", "hk": "新北", "id": "101191107", "zh": "新北"}],
        "en": "changzhou",
        "hk": "常州",
        "id": "141",
        "zh": "常州"
    }, {
        "children": [{"en": "taizhou", "hk": "泰州", "id": "101191201", "zh": "泰州"}, {
            "en": "xinghua",
            "hk": "興化",
            "id": "101191202",
            "zh": "兴化"
        }, {"en": "taixing", "hk": "泰興", "id": "101191203", "zh": "泰兴"}, {
            "en": "jiangyan",
            "hk": "姜堰",
            "id": "101191204",
            "zh": "姜堰"
        }, {"en": "jingjiang", "hk": "靖江", "id": "101191205", "zh": "靖江"}, {
            "en": "hailing",
            "hk": "海陵",
            "id": "101191206",
            "zh": "海陵"
        }, {"en": "gaogang", "hk": "高港", "id": "101191207", "zh": "高港"}],
        "en": "taizhou",
        "hk": "泰州",
        "id": "142",
        "zh": "泰州"
    }, {
        "children": [{"en": "suqian", "hk": "宿遷", "id": "101191301", "zh": "宿迁"}, {
            "en": "shuyang",
            "hk": "沭陽",
            "id": "101191302",
            "zh": "沭阳"
        }, {"en": "siyang", "hk": "泗陽", "id": "101191303", "zh": "泗阳"}, {
            "en": "sihong",
            "hk": "泗洪",
            "id": "101191304",
            "zh": "泗洪"
        }, {"en": "suyu", "hk": "宿豫", "id": "101191305", "zh": "宿豫"}, {
            "en": "sucheng",
            "hk": "宿城",
            "id": "101191306",
            "zh": "宿城"
        }], "en": "suqian", "hk": "宿遷", "id": "143", "zh": "宿迁"
    }], "en": "jiangsu", "hk": "江蘇", "id": "130", "zh": "江苏"
}, {
    "children": [{
        "children": [{"en": "hangzhou", "hk": "杭州", "id": "101210101", "zh": "杭州"}, {
            "en": "xiaoshan",
            "hk": "蕭山",
            "id": "101210102",
            "zh": "萧山"
        }, {"en": "tonglu", "hk": "桐廬", "id": "101210103", "zh": "桐庐"}, {
            "en": "chunan",
            "hk": "淳安",
            "id": "101210104",
            "zh": "淳安"
        }, {"en": "jiande", "hk": "建德", "id": "101210105", "zh": "建德"}, {
            "en": "yuhang",
            "hk": "餘杭",
            "id": "101210106",
            "zh": "余杭"
        }, {"en": "linan", "hk": "臨安", "id": "101210107", "zh": "临安"}, {
            "en": "fuyang",
            "hk": "富陽",
            "id": "101210108",
            "zh": "富阳"
        }, {"en": "shangcheng", "hk": "上城", "id": "101210109", "zh": "上城"}, {
            "en": "xiacheng",
            "hk": "下城",
            "id": "101210110",
            "zh": "下城"
        }, {"en": "jianggan", "hk": "江乾", "id": "101210111", "zh": "江干"}, {
            "en": "gongshu",
            "hk": "拱墅",
            "id": "101210112",
            "zh": "拱墅"
        }, {"en": "xihu", "hk": "西湖", "id": "101210113", "zh": "西湖"}, {
            "en": "binjiang",
            "hk": "濱江",
            "id": "101210114",
            "zh": "滨江"
        }], "en": "hangzhou", "hk": "杭州", "id": "145", "zh": "杭州"
    }, {
        "children": [{"en": "huzhou", "hk": "湖州", "id": "101210201", "zh": "湖州"}, {
            "en": "changxing",
            "hk": "長興",
            "id": "101210202",
            "zh": "长兴"
        }, {"en": "anji", "hk": "安吉", "id": "101210203", "zh": "安吉"}, {
            "en": "deqing",
            "hk": "德清",
            "id": "101210204",
            "zh": "德清"
        }, {"en": "wuxing", "hk": "吳興", "id": "101210205", "zh": "吴兴"}, {
            "en": "nanxun",
            "hk": "南潯",
            "id": "101210206",
            "zh": "南浔"
        }], "en": "huzhou", "hk": "湖州", "id": "146", "zh": "湖州"
    }, {
        "children": [{"en": "jiaxing", "hk": "嘉興", "id": "101210301", "zh": "嘉兴"}, {
            "en": "jiashan",
            "hk": "嘉善",
            "id": "101210302",
            "zh": "嘉善"
        }, {"en": "haining", "hk": "海寧", "id": "101210303", "zh": "海宁"}, {
            "en": "tongxiang",
            "hk": "桐鄉",
            "id": "101210304",
            "zh": "桐乡"
        }, {"en": "pinghu", "hk": "平湖", "id": "101210305", "zh": "平湖"}, {
            "en": "haiyan",
            "hk": "海鹽",
            "id": "101210306",
            "zh": "海盐"
        }, {"en": "nanhu", "hk": "南湖", "id": "101210307", "zh": "南湖"}, {
            "en": "xiuzhou",
            "hk": "秀洲",
            "id": "101210308",
            "zh": "秀洲"
        }], "en": "jiaxing", "hk": "嘉興", "id": "147", "zh": "嘉兴"
    }, {
        "children": [{"en": "ningbo", "hk": "寧波", "id": "101210401", "zh": "宁波"}, {
            "en": "cixi",
            "hk": "慈溪",
            "id": "101210403",
            "zh": "慈溪"
        }, {"en": "yuyao", "hk": "餘姚", "id": "101210404", "zh": "余姚"}, {
            "en": "fenghua",
            "hk": "奉化",
            "id": "101210405",
            "zh": "奉化"
        }, {"en": "xiangshan", "hk": "象山", "id": "101210406", "zh": "象山"}, {
            "en": "ninghai",
            "hk": "寧海",
            "id": "101210408",
            "zh": "宁海"
        }, {"en": "beilun", "hk": "北崙", "id": "101210410", "zh": "北仑"}, {
            "en": "yinzhou",
            "hk": "鄞州",
            "id": "101210411",
            "zh": "鄞州"
        }, {"en": "zhenhai", "hk": "鎮海", "id": "101210412", "zh": "镇海"}, {
            "en": "haishu",
            "hk": "海曙",
            "id": "101210402",
            "zh": "海曙"
        }, {"en": "jiangbei", "hk": "江北", "id": "101210409", "zh": "江北"}],
        "en": "ningbo",
        "hk": "寧波",
        "id": "148",
        "zh": "宁波"
    }, {
        "children": [{"en": "taizhou", "hk": "台州", "id": "101210601", "zh": "台州"}, {
            "en": "yuhuan",
            "hk": "玉環",
            "id": "101210603",
            "zh": "玉环"
        }, {"en": "sanmen", "hk": "三門", "id": "101210604", "zh": "三门"}, {
            "en": "tiantai",
            "hk": "天台",
            "id": "101210605",
            "zh": "天台"
        }, {"en": "xianju", "hk": "仙居", "id": "101210606", "zh": "仙居"}, {
            "en": "wenling",
            "hk": "溫嶺",
            "id": "101210607",
            "zh": "温岭"
        }, {"en": "linhai", "hk": "臨海", "id": "101210610", "zh": "临海"}, {
            "en": "jiaojiang",
            "hk": "椒江",
            "id": "101210611",
            "zh": "椒江"
        }, {"en": "huangyan", "hk": "黃岩", "id": "101210612", "zh": "黄岩"}, {
            "en": "luqiao",
            "hk": "路橋",
            "id": "101210613",
            "zh": "路桥"
        }], "en": "taizhou", "hk": "台州", "id": "149", "zh": "台州"
    }, {
        "children": [{"en": "wenzhou", "hk": "溫州", "id": "101210701", "zh": "温州"}, {
            "en": "taishun",
            "hk": "泰順",
            "id": "101210702",
            "zh": "泰顺"
        }, {"en": "wencheng", "hk": "文成", "id": "101210703", "zh": "文成"}, {
            "en": "pingyang",
            "hk": "平陽",
            "id": "101210704",
            "zh": "平阳"
        }, {"en": "ruian", "hk": "瑞安", "id": "101210705", "zh": "瑞安"}, {
            "en": "dongtou",
            "hk": "洞頭",
            "id": "101210706",
            "zh": "洞头"
        }, {"en": "yueqing", "hk": "樂清", "id": "101210707", "zh": "乐清"}, {
            "en": "yongjia",
            "hk": "永嘉",
            "id": "101210708",
            "zh": "永嘉"
        }, {"en": "cangnan", "hk": "蒼南", "id": "101210709", "zh": "苍南"}, {
            "en": "lucheng",
            "hk": "鹿城",
            "id": "101210710",
            "zh": "鹿城"
        }, {"en": "longwan", "hk": "龍灣", "id": "101210711", "zh": "龙湾"}, {
            "en": "ouhai",
            "hk": "甌海",
            "id": "101210712",
            "zh": "瓯海"
        }], "en": "wenzhou", "hk": "溫州", "id": "150", "zh": "温州"
    }, {
        "children": [{"en": "lishui", "hk": "麗水", "id": "101210801", "zh": "丽水"}, {
            "en": "suichang",
            "hk": "遂昌",
            "id": "101210802",
            "zh": "遂昌"
        }, {"en": "longquan", "hk": "龍泉", "id": "101210803", "zh": "龙泉"}, {
            "en": "jinyun",
            "hk": "縉雲",
            "id": "101210804",
            "zh": "缙云"
        }, {"en": "qingtian", "hk": "青田", "id": "101210805", "zh": "青田"}, {
            "en": "yunhe",
            "hk": "雲和",
            "id": "101210806",
            "zh": "云和"
        }, {"en": "qingyuan", "hk": "慶元", "id": "101210807", "zh": "庆元"}, {
            "en": "songyang",
            "hk": "松陽",
            "id": "101210808",
            "zh": "松阳"
        }, {"en": "jingning", "hk": "景寧", "id": "101210809", "zh": "景宁"}, {
            "en": "liandou",
            "hk": "蓮都",
            "id": "101210810",
            "zh": "莲都"
        }], "en": "lishui", "hk": "麗水", "id": "151", "zh": "丽水"
    }, {
        "children": [{"en": "jinhua", "hk": "金華", "id": "101210901", "zh": "金华"}, {
            "en": "pujiang",
            "hk": "浦江",
            "id": "101210902",
            "zh": "浦江"
        }, {"en": "lanxi", "hk": "蘭溪", "id": "101210903", "zh": "兰溪"}, {
            "en": "yiwu",
            "hk": "義烏",
            "id": "101210904",
            "zh": "义乌"
        }, {"en": "dongyang", "hk": "東陽", "id": "101210905", "zh": "东阳"}, {
            "en": "wuyi",
            "hk": "武義",
            "id": "101210906",
            "zh": "武义"
        }, {"en": "yongkang", "hk": "永康", "id": "101210907", "zh": "永康"}, {
            "en": "panan",
            "hk": "磐安",
            "id": "101210908",
            "zh": "磐安"
        }, {"en": "wucheng", "hk": "婺城", "id": "101210909", "zh": "婺城"}, {
            "en": "jindong",
            "hk": "金東",
            "id": "101210910",
            "zh": "金东"
        }], "en": "jinhua", "hk": "金華", "id": "152", "zh": "金华"
    }, {
        "children": [{"en": "quzhou", "hk": "衢州", "id": "101211001", "zh": "衢州"}, {
            "en": "changshan",
            "hk": "常山",
            "id": "101211002",
            "zh": "常山"
        }, {"en": "kaihua", "hk": "開化", "id": "101211003", "zh": "开化"}, {
            "en": "longyou",
            "hk": "龍遊",
            "id": "101211004",
            "zh": "龙游"
        }, {"en": "jiangshan", "hk": "江山", "id": "101211005", "zh": "江山"}, {
            "en": "qujiang",
            "hk": "衢江",
            "id": "101211006",
            "zh": "衢江"
        }, {"en": "kecheng", "hk": "柯城", "id": "101211007", "zh": "柯城"}],
        "en": "quzhou",
        "hk": "衢州",
        "id": "153",
        "zh": "衢州"
    }, {
        "children": [{"en": "zhoushan", "hk": "舟山", "id": "101211101", "zh": "舟山"}, {
            "en": "shengsi",
            "hk": "嵊泗",
            "id": "101211102",
            "zh": "嵊泗"
        }, {"en": "daishan", "hk": "岱山", "id": "101211104", "zh": "岱山"}, {
            "en": "putuo",
            "hk": "普陀",
            "id": "101211105",
            "zh": "普陀"
        }, {"en": "dinghai", "hk": "定海", "id": "101211106", "zh": "定海"}],
        "en": "zhoushan",
        "hk": "舟山",
        "id": "154",
        "zh": "舟山"
    }, {
        "children": [{"en": "yuecheng", "hk": "越城", "id": "101210501", "zh": "越城"}, {
            "en": "zhuji",
            "hk": "諸暨",
            "id": "101210502",
            "zh": "诸暨"
        }, {"en": "shangyu", "hk": "上虞", "id": "101210503", "zh": "上虞"}, {
            "en": "xinchang",
            "hk": "新昌",
            "id": "101210504",
            "zh": "新昌"
        }, {"en": "shengzhou", "hk": "嵊州", "id": "101210505", "zh": "嵊州"}, {
            "en": "keqiao",
            "hk": "柯橋",
            "id": "101210506",
            "zh": "柯桥"
        }, {"en": "shaoxing", "hk": "紹興", "id": "101210507", "zh": "绍兴"}],
        "en": "shaoxing",
        "hk": "紹興",
        "id": "155",
        "zh": "绍兴"
    }], "en": "zhejiang", "hk": "浙江", "id": "144", "zh": "浙江"
}, {
    "children": [{
        "children": [{"en": "fuzhou", "hk": "福州", "id": "101230101", "zh": "福州"}, {
            "en": "minqing",
            "hk": "閩清",
            "id": "101230102",
            "zh": "闽清"
        }, {"en": "minhou", "hk": "閩侯", "id": "101230103", "zh": "闽侯"}, {
            "en": "luoyuan",
            "hk": "羅源",
            "id": "101230104",
            "zh": "罗源"
        }, {"en": "lianjiang", "hk": "連江", "id": "101230105", "zh": "连江"}, {
            "en": "yongtai",
            "hk": "永泰",
            "id": "101230107",
            "zh": "永泰"
        }, {"en": "pingtan", "hk": "平潭", "id": "101230108", "zh": "平潭"}, {
            "en": "changle",
            "hk": "長樂",
            "id": "101230110",
            "zh": "长乐"
        }, {"en": "fuqing", "hk": "福清", "id": "101230111", "zh": "福清"}, {
            "en": "gulou",
            "hk": "鼓樓",
            "id": "101230106",
            "zh": "鼓楼"
        }, {"en": "taijiang", "hk": "台江", "id": "101230109", "zh": "台江"}, {
            "en": "cangshan",
            "hk": "倉山",
            "id": "101230112",
            "zh": "仓山"
        }, {"en": "mawei", "hk": "馬尾", "id": "101230113", "zh": "马尾"}, {
            "en": "jinan",
            "hk": "晉安",
            "id": "101230114",
            "zh": "晋安"
        }], "en": "fuzhou", "hk": "福州", "id": "157", "zh": "福州"
    }, {
        "children": [{"en": "diaoyudao", "hk": "釣魚島", "id": "101231001", "zh": "钓鱼岛"}],
        "en": "diaoyudao",
        "hk": "釣魚島",
        "id": "158",
        "zh": "钓鱼岛"
    }, {
        "children": [{"en": "xiamen", "hk": "廈門", "id": "101230201", "zh": "厦门"}, {
            "en": "tongan",
            "hk": "同安",
            "id": "101230202",
            "zh": "同安"
        }, {"en": "siming", "hk": "思明", "id": "101230203", "zh": "思明"}, {
            "en": "haicang",
            "hk": "海滄",
            "id": "101230204",
            "zh": "海沧"
        }, {"en": "huli", "hk": "湖里", "id": "101230205", "zh": "湖里"}, {
            "en": "jimei",
            "hk": "集美",
            "id": "101230206",
            "zh": "集美"
        }, {"en": "xiangan", "hk": "翔安", "id": "101230207", "zh": "翔安"}],
        "en": "xiamen",
        "hk": "廈門",
        "id": "159",
        "zh": "厦门"
    }, {
        "children": [{"en": "ningde", "hk": "寧德", "id": "101230301", "zh": "宁德"}, {
            "en": "gutian",
            "hk": "古田",
            "id": "101230302",
            "zh": "古田"
        }, {"en": "xiapu", "hk": "霞浦", "id": "101230303", "zh": "霞浦"}, {
            "en": "shouning",
            "hk": "壽寧",
            "id": "101230304",
            "zh": "寿宁"
        }, {"en": "zhouning", "hk": "周寧", "id": "101230305", "zh": "周宁"}, {
            "en": "fuan",
            "hk": "福安",
            "id": "101230306",
            "zh": "福安"
        }, {"en": "zherong", "hk": "柘榮", "id": "101230307", "zh": "柘荣"}, {
            "en": "fuding",
            "hk": "福鼎",
            "id": "101230308",
            "zh": "福鼎"
        }, {"en": "pingnan", "hk": "屏南", "id": "101230309", "zh": "屏南"}, {
            "en": "jiaocheng",
            "hk": "蕉城",
            "id": "101230310",
            "zh": "蕉城"
        }], "en": "ningde", "hk": "寧德", "id": "160", "zh": "宁德"
    }, {
        "children": [{"en": "putian", "hk": "莆田", "id": "101230401", "zh": "莆田"}, {
            "en": "xianyou",
            "hk": "仙遊",
            "id": "101230402",
            "zh": "仙游"
        }, {"en": "hanjiang", "hk": "涵江", "id": "101230404", "zh": "涵江"}, {
            "en": "xiuyu",
            "hk": "秀嶼",
            "id": "101230405",
            "zh": "秀屿"
        }, {"en": "licheng", "hk": "荔城", "id": "101230406", "zh": "荔城"}, {
            "en": "chengxiang",
            "hk": "城廂",
            "id": "101230407",
            "zh": "城厢"
        }], "en": "putian", "hk": "莆田", "id": "161", "zh": "莆田"
    }, {
        "children": [{"en": "quanzhou", "hk": "泉州", "id": "101230501", "zh": "泉州"}, {
            "en": "anxi",
            "hk": "安溪",
            "id": "101230502",
            "zh": "安溪"
        }, {"en": "yongchun", "hk": "永春", "id": "101230504", "zh": "永春"}, {
            "en": "dehua",
            "hk": "德化",
            "id": "101230505",
            "zh": "德化"
        }, {"en": "nanan", "hk": "南安", "id": "101230506", "zh": "南安"}, {
            "en": "huian",
            "hk": "惠安",
            "id": "101230508",
            "zh": "惠安"
        }, {"en": "jinjiang", "hk": "晉江", "id": "101230509", "zh": "晋江"}, {
            "en": "shishi",
            "hk": "石獅",
            "id": "101230510",
            "zh": "石狮"
        }, {"en": "jinmen", "hk": "金門", "id": "101230503", "zh": "金门"}, {
            "en": "licheng",
            "hk": "鯉城",
            "id": "101230511",
            "zh": "鲤城"
        }, {"en": "fengze", "hk": "豐澤", "id": "101230512", "zh": "丰泽"}, {
            "en": "luojiang",
            "hk": "洛江",
            "id": "101230513",
            "zh": "洛江"
        }, {"en": "quangang", "hk": "泉港", "id": "101230514", "zh": "泉港"}, {
            "en": "chongwu",
            "hk": "崇武",
            "id": "101230507",
            "zh": "崇武"
        }], "en": "quanzhou", "hk": "泉州", "id": "162", "zh": "泉州"
    }, {
        "children": [{"en": "zhangzhou", "hk": "漳州", "id": "101230601", "zh": "漳州"}, {
            "en": "changtai",
            "hk": "長泰",
            "id": "101230602",
            "zh": "长泰"
        }, {"en": "nanjing", "hk": "南靖", "id": "101230603", "zh": "南靖"}, {
            "en": "pinghe",
            "hk": "平和",
            "id": "101230604",
            "zh": "平和"
        }, {"en": "longhai", "hk": "龍海", "id": "101230605", "zh": "龙海"}, {
            "en": "zhangpu",
            "hk": "漳浦",
            "id": "101230606",
            "zh": "漳浦"
        }, {"en": "zhaoan", "hk": "詔安", "id": "101230607", "zh": "诏安"}, {
            "en": "dongshan",
            "hk": "東山",
            "id": "101230608",
            "zh": "东山"
        }, {"en": "yunxiao", "hk": "雲霄", "id": "101230609", "zh": "云霄"}, {
            "en": "huaan",
            "hk": "華安",
            "id": "101230610",
            "zh": "华安"
        }, {"en": "xiangcheng", "hk": "薌城", "id": "101230611", "zh": "芗城"}, {
            "en": "longwen",
            "hk": "龍文",
            "id": "101230612",
            "zh": "龙文"
        }], "en": "zhangzhou", "hk": "漳州", "id": "163", "zh": "漳州"
    }, {
        "children": [{"en": "longyan", "hk": "龍巖", "id": "101230701", "zh": "龙岩"}, {
            "en": "changting",
            "hk": "長汀",
            "id": "101230702",
            "zh": "长汀"
        }, {"en": "liancheng", "hk": "連城", "id": "101230703", "zh": "连城"}, {
            "en": "wuping",
            "hk": "武平",
            "id": "101230704",
            "zh": "武平"
        }, {"en": "shanghang", "hk": "上杭", "id": "101230705", "zh": "上杭"}, {
            "en": "yongding",
            "hk": "永定",
            "id": "101230706",
            "zh": "永定"
        }, {"en": "zhangping", "hk": "漳平", "id": "101230707", "zh": "漳平"}, {
            "en": "xinluo",
            "hk": "新羅",
            "id": "101230708",
            "zh": "新罗"
        }], "en": "longyan", "hk": "龍巖", "id": "164", "zh": "龙岩"
    }, {
        "children": [{"en": "sanming", "hk": "三明", "id": "101230801", "zh": "三明"}, {
            "en": "ninghua",
            "hk": "寧化",
            "id": "101230802",
            "zh": "宁化"
        }, {"en": "qingliu", "hk": "清流", "id": "101230803", "zh": "清流"}, {
            "en": "taining",
            "hk": "泰宁",
            "id": "101230804",
            "zh": "泰宁"
        }, {"en": "jiangle", "hk": "將樂", "id": "101230805", "zh": "将乐"}, {
            "en": "jianning",
            "hk": "建寧",
            "id": "101230806",
            "zh": "建宁"
        }, {"en": "mingxi", "hk": "明溪", "id": "101230807", "zh": "明溪"}, {
            "en": "shaxian",
            "hk": "沙縣",
            "id": "101230808",
            "zh": "沙县"
        }, {"en": "youxi", "hk": "尤溪", "id": "101230809", "zh": "尤溪"}, {
            "en": "yongan",
            "hk": "永安",
            "id": "101230810",
            "zh": "永安"
        }, {"en": "datian", "hk": "大田", "id": "101230811", "zh": "大田"}, {
            "en": "meilie",
            "hk": "梅列",
            "id": "101230812",
            "zh": "梅列"
        }, {"en": "sanyuan", "hk": "三元", "id": "101230813", "zh": "三元"}],
        "en": "sanming",
        "hk": "三明",
        "id": "165",
        "zh": "三明"
    }, {
        "children": [{"en": "nanping", "hk": "南平", "id": "101230901", "zh": "南平"}, {
            "en": "shunchang",
            "hk": "順昌",
            "id": "101230902",
            "zh": "顺昌"
        }, {"en": "guangze", "hk": "光澤", "id": "101230903", "zh": "光泽"}, {
            "en": "shaowu",
            "hk": "邵武",
            "id": "101230904",
            "zh": "邵武"
        }, {"en": "wuyishan", "hk": "武夷山", "id": "101230905", "zh": "武夷山"}, {
            "en": "pucheng",
            "hk": "浦城",
            "id": "101230906",
            "zh": "浦城"
        }, {"en": "jianyang", "hk": "建陽", "id": "101230907", "zh": "建阳"}, {
            "en": "songxi",
            "hk": "松溪",
            "id": "101230908",
            "zh": "松溪"
        }, {"en": "zhenghe", "hk": "政和", "id": "101230909", "zh": "政和"}, {
            "en": "jianou",
            "hk": "建甌",
            "id": "101230910",
            "zh": "建瓯"
        }, {"en": "yanping", "hk": "延平", "id": "101230911", "zh": "延平"}],
        "en": "nanping",
        "hk": "南平",
        "id": "166",
        "zh": "南平"
    }], "en": "fujian", "hk": "福建", "id": "156", "zh": "福建"
}, {
    "children": [{
        "children": [{"en": "nanchang", "hk": "南昌", "id": "101240101", "zh": "南昌"}, {
            "en": "xinjian",
            "hk": "新建",
            "id": "101240102",
            "zh": "新建"
        }, {"en": "nanchangxian", "hk": "南昌縣", "id": "101240103", "zh": "南昌县"}, {
            "en": "anyi",
            "hk": "安義",
            "id": "101240104",
            "zh": "安义"
        }, {"en": "jinxian", "hk": "進賢", "id": "101240105", "zh": "进贤"}, {
            "en": "donghu",
            "hk": "東湖",
            "id": "101240106",
            "zh": "东湖"
        }, {"en": "xihu", "hk": "西湖", "id": "101240107", "zh": "西湖"}, {
            "en": "qingyunpu",
            "hk": "青雲譜",
            "id": "101240108",
            "zh": "青云谱"
        }, {"en": "wanli", "hk": "灣里", "id": "101240109", "zh": "湾里"}, {
            "en": "qingshanhu",
            "hk": "青山湖",
            "id": "101240110",
            "zh": "青山湖"
        }], "en": "nanchang", "hk": "南昌", "id": "168", "zh": "南昌"
    }, {
        "children": [{"en": "jiujiang", "hk": "九江", "id": "101240201", "zh": "九江"}, {
            "en": "ruichang",
            "hk": "瑞昌",
            "id": "101240202",
            "zh": "瑞昌"
        }, {"en": "lushan", "hk": "廬山", "id": "101240203", "zh": "庐山"}, {
            "en": "wuning",
            "hk": "武寧",
            "id": "101240204",
            "zh": "武宁"
        }, {"en": "dean", "hk": "德安", "id": "101240205", "zh": "德安"}, {
            "en": "yongxiu",
            "hk": "永修",
            "id": "101240206",
            "zh": "永修"
        }, {"en": "hukou", "hk": "湖口", "id": "101240207", "zh": "湖口"}, {
            "en": "pengze",
            "hk": "彭澤",
            "id": "101240208",
            "zh": "彭泽"
        }, {"en": "duchang", "hk": "都昌", "id": "101240210", "zh": "都昌"}, {
            "en": "xiushui",
            "hk": "修水",
            "id": "101240212",
            "zh": "修水"
        }, {"en": "xunyang", "hk": "潯陽", "id": "101240211", "zh": "浔阳"}, {
            "en": "gongqingcheng",
            "hk": "共青城",
            "id": "101240213",
            "zh": "共青城"
        }, {"en": "lianxi", "hk": "濂溪", "id": "101240214", "zh": "濂溪"}, {
            "en": "chaisang",
            "hk": "柴桑",
            "id": "101240215",
            "zh": "柴桑"
        }], "en": "jiujiang", "hk": "九江", "id": "169", "zh": "九江"
    }, {
        "children": [{"en": "shangrao", "hk": "上饒", "id": "101240301", "zh": "上饶"}, {
            "en": "poyang",
            "hk": "鄱陽",
            "id": "101240302",
            "zh": "鄱阳"
        }, {"en": "wuyuan", "hk": "婺源", "id": "101240303", "zh": "婺源"}, {
            "en": "yugan",
            "hk": "餘幹",
            "id": "101240305",
            "zh": "余干"
        }, {"en": "wannian", "hk": "萬年", "id": "101240306", "zh": "万年"}, {
            "en": "dexing",
            "hk": "德興",
            "id": "101240307",
            "zh": "德兴"
        }, {"en": "shangraoxian", "hk": "上饒縣", "id": "101240308", "zh": "上饶县"}, {
            "en": "yiyang",
            "hk": "弋陽",
            "id": "101240309",
            "zh": "弋阳"
        }, {"en": "hengfeng", "hk": "橫峰", "id": "101240310", "zh": "横峰"}, {
            "en": "yanshan",
            "hk": "鉛山",
            "id": "101240311",
            "zh": "铅山"
        }, {"en": "yushan", "hk": "玉山", "id": "101240312", "zh": "玉山"}, {
            "en": "guangfeng",
            "hk": "廣豐",
            "id": "101240313",
            "zh": "广丰"
        }, {"en": "xinzhou", "hk": "信州", "id": "101240304", "zh": "信州"}],
        "en": "shangrao",
        "hk": "上饒",
        "id": "170",
        "zh": "上饶"
    }, {
        "children": [{"en": "fuzhou", "hk": "撫州", "id": "101240401", "zh": "抚州"}, {
            "en": "guangchang",
            "hk": "廣昌",
            "id": "101240402",
            "zh": "广昌"
        }, {"en": "anle", "hk": "樂安", "id": "101240403", "zh": "乐安"}, {
            "en": "chongren",
            "hk": "崇仁",
            "id": "101240404",
            "zh": "崇仁"
        }, {"en": "jinxi", "hk": "金溪", "id": "101240405", "zh": "金溪"}, {
            "en": "zixi",
            "hk": "資溪",
            "id": "101240406",
            "zh": "资溪"
        }, {"en": "yihuang", "hk": "宜黃", "id": "101240407", "zh": "宜黄"}, {
            "en": "nancheng",
            "hk": "南城",
            "id": "101240408",
            "zh": "南城"
        }, {"en": "nanfeng", "hk": "南豐", "id": "101240409", "zh": "南丰"}, {
            "en": "lichuan",
            "hk": "黎川",
            "id": "101240410",
            "zh": "黎川"
        }, {"en": "dongxiang", "hk": "東鄉", "id": "101240411", "zh": "东乡"}, {
            "en": "linchuan",
            "hk": "臨川",
            "id": "101240412",
            "zh": "临川"
        }], "en": "fuzhou", "hk": "撫州", "id": "171", "zh": "抚州"
    }, {
        "children": [{"en": "yichun", "hk": "宜春", "id": "101240501", "zh": "宜春"}, {
            "en": "tonggu",
            "hk": "銅鼓",
            "id": "101240502",
            "zh": "铜鼓"
        }, {"en": "yifeng", "hk": "宜豐", "id": "101240503", "zh": "宜丰"}, {
            "en": "wanzai",
            "hk": "萬載",
            "id": "101240504",
            "zh": "万载"
        }, {"en": "shanggao", "hk": "上高", "id": "101240505", "zh": "上高"}, {
            "en": "jingan",
            "hk": "靖安",
            "id": "101240506",
            "zh": "靖安"
        }, {"en": "fengxin", "hk": "奉新", "id": "101240507", "zh": "奉新"}, {
            "en": "gaoan",
            "hk": "高安",
            "id": "101240508",
            "zh": "高安"
        }, {"en": "zhangshu", "hk": "樟樹", "id": "101240509", "zh": "樟树"}, {
            "en": "fengcheng",
            "hk": "豐城",
            "id": "101240510",
            "zh": "丰城"
        }, {"en": "yuanzhou", "hk": "袁州", "id": "101240511", "zh": "袁州"}],
        "en": "yichun",
        "hk": "宜春",
        "id": "172",
        "zh": "宜春"
    }, {
        "children": [{"en": "jian", "hk": "吉安", "id": "101240601", "zh": "吉安"}, {
            "en": "jianxian",
            "hk": "吉安縣",
            "id": "101240602",
            "zh": "吉安县"
        }, {"en": "jishui", "hk": "吉水", "id": "101240603", "zh": "吉水"}, {
            "en": "xingan",
            "hk": "新幹",
            "id": "101240604",
            "zh": "新干"
        }, {"en": "xiajiang", "hk": "峽江", "id": "101240605", "zh": "峡江"}, {
            "en": "yongfeng",
            "hk": "永豐",
            "id": "101240606",
            "zh": "永丰"
        }, {"en": "yongxin", "hk": "永新", "id": "101240607", "zh": "永新"}, {
            "en": "jinggangshan",
            "hk": "井岡山",
            "id": "101240608",
            "zh": "井冈山"
        }, {"en": "wanan", "hk": "萬安", "id": "101240609", "zh": "万安"}, {
            "en": "suichuan",
            "hk": "遂川",
            "id": "101240610",
            "zh": "遂川"
        }, {"en": "taihe", "hk": "泰和", "id": "101240611", "zh": "泰和"}, {
            "en": "anfu",
            "hk": "安福",
            "id": "101240612",
            "zh": "安福"
        }, {"en": "jizhou", "hk": "吉州", "id": "101240614", "zh": "吉州"}, {
            "en": "qingyuan",
            "hk": "青原",
            "id": "101240615",
            "zh": "青原"
        }, {"en": "xiaping", "hk": "厦坪", "id": "101240616", "zh": "厦坪"}],
        "en": "jian",
        "hk": "吉安",
        "id": "173",
        "zh": "吉安"
    }, {
        "children": [{"en": "ganzhou", "hk": "贛州", "id": "101240701", "zh": "赣州"}, {
            "en": "chongyi",
            "hk": "崇義",
            "id": "101240702",
            "zh": "崇义"
        }, {"en": "shangyou", "hk": "上猶", "id": "101240703", "zh": "上犹"}, {
            "en": "nankang",
            "hk": "南康",
            "id": "101240704",
            "zh": "南康"
        }, {"en": "dayu", "hk": "大餘", "id": "101240705", "zh": "大余"}, {
            "en": "xinfeng",
            "hk": "信豐",
            "id": "101240706",
            "zh": "信丰"
        }, {"en": "ningdu", "hk": "寧都", "id": "101240707", "zh": "宁都"}, {
            "en": "shicheng",
            "hk": "石城",
            "id": "101240708",
            "zh": "石城"
        }, {"en": "ruijin", "hk": "瑞金", "id": "101240709", "zh": "瑞金"}, {
            "en": "yudu",
            "hk": "於都",
            "id": "101240710",
            "zh": "于都"
        }, {"en": "huichang", "hk": "會昌", "id": "101240711", "zh": "会昌"}, {
            "en": "anyuan",
            "hk": "安遠",
            "id": "101240712",
            "zh": "安远"
        }, {"en": "quannan", "hk": "全南", "id": "101240713", "zh": "全南"}, {
            "en": "longnan",
            "hk": "龍南",
            "id": "101240714",
            "zh": "龙南"
        }, {"en": "dingnan", "hk": "定南", "id": "101240715", "zh": "定南"}, {
            "en": "xunwu",
            "hk": "尋烏",
            "id": "101240716",
            "zh": "寻乌"
        }, {"en": "xingguo", "hk": "興國", "id": "101240717", "zh": "兴国"}, {
            "en": "ganxian",
            "hk": "贛縣",
            "id": "101240718",
            "zh": "赣县"
        }, {"en": "zhanggong", "hk": "章貢", "id": "101240719", "zh": "章贡"}],
        "en": "ganzhou",
        "hk": "贛州",
        "id": "174",
        "zh": "赣州"
    }, {
        "children": [{"en": "jingdezhen", "hk": "景德鎮", "id": "101240801", "zh": "景德镇"}, {
            "en": "leping",
            "hk": "樂平",
            "id": "101240802",
            "zh": "乐平"
        }, {"en": "fuliang", "hk": "浮梁", "id": "101240803", "zh": "浮梁"}, {
            "en": "changjiang",
            "hk": "昌江",
            "id": "101240804",
            "zh": "昌江"
        }, {"en": "zhushan", "hk": "珠山", "id": "101240805", "zh": "珠山"}],
        "en": "jingdezhen",
        "hk": "景德鎮",
        "id": "175",
        "zh": "景德镇"
    }, {
        "children": [{"en": "pingxiang", "hk": "萍鄉", "id": "101240901", "zh": "萍乡"}, {
            "en": "lianhua",
            "hk": "蓮花",
            "id": "101240902",
            "zh": "莲花"
        }, {"en": "shangli", "hk": "上栗", "id": "101240903", "zh": "上栗"}, {
            "en": "anyuan",
            "hk": "安源",
            "id": "101240904",
            "zh": "安源"
        }, {"en": "luxi", "hk": "蘆溪", "id": "101240905", "zh": "芦溪"}, {
            "en": "xiangdong",
            "hk": "湘東",
            "id": "101240906",
            "zh": "湘东"
        }], "en": "pingxiang", "hk": "萍鄉", "id": "176", "zh": "萍乡"
    }, {
        "children": [{"en": "xinyu", "hk": "新余", "id": "101241001", "zh": "新余"}, {
            "en": "fenyi",
            "hk": "分宜",
            "id": "101241002",
            "zh": "分宜"
        }, {"en": "yushui", "hk": "渝水", "id": "101241003", "zh": "渝水"}],
        "en": "xinyu",
        "hk": "新余",
        "id": "177",
        "zh": "新余"
    }, {
        "children": [{"en": "yingtan", "hk": "鷹潭", "id": "101241101", "zh": "鹰潭"}, {
            "en": "yujiang",
            "hk": "余江",
            "id": "101241102",
            "zh": "余江"
        }, {"en": "guixi", "hk": "貴溪", "id": "101241103", "zh": "贵溪"}, {
            "en": "yuehu",
            "hk": "月湖",
            "id": "101241104",
            "zh": "月湖"
        }], "en": "yingtan", "hk": "鷹潭", "id": "178", "zh": "鹰潭"
    }], "en": "jiangxi", "hk": "江西", "id": "167", "zh": "江西"
}, {
    "children": [{
        "children": [{"en": "hefei", "hk": "合肥", "id": "101220101", "zh": "合肥"}, {
            "en": "changfeng",
            "hk": "長豐",
            "id": "101220102",
            "zh": "长丰"
        }, {"en": "feidong", "hk": "肥東", "id": "101220103", "zh": "肥东"}, {
            "en": "feixi",
            "hk": "肥西",
            "id": "101220104",
            "zh": "肥西"
        }, {"en": "chaohu", "hk": "巢湖", "id": "101220105", "zh": "巢湖"}, {
            "en": "lujiang",
            "hk": "廬江",
            "id": "101220106",
            "zh": "庐江"
        }, {"en": "yaohai", "hk": "瑤海", "id": "101220107", "zh": "瑶海"}, {
            "en": "luyang",
            "hk": "廬陽",
            "id": "101220108",
            "zh": "庐阳"
        }, {"en": "shushan", "hk": "蜀山", "id": "101220109", "zh": "蜀山"}, {
            "en": "baohe",
            "hk": "包河",
            "id": "101220110",
            "zh": "包河"
        }], "en": "hefei", "hk": "合肥", "id": "180", "zh": "合肥"
    }, {
        "children": [{"en": "bengbu", "hk": "蚌埠", "id": "101220201", "zh": "蚌埠"}, {
            "en": "huaiyuan",
            "hk": "懷遠",
            "id": "101220202",
            "zh": "怀远"
        }, {"en": "guzhen", "hk": "固鎮", "id": "101220203", "zh": "固镇"}, {
            "en": "wuhe",
            "hk": "五河",
            "id": "101220204",
            "zh": "五河"
        }, {"en": "longzihu", "hk": "龍子湖", "id": "101220205", "zh": "龙子湖"}, {
            "en": "bangshan",
            "hk": "蚌山",
            "id": "101220206",
            "zh": "蚌山"
        }, {"en": "yuhui", "hk": "禹會", "id": "101220207", "zh": "禹会"}, {
            "en": "huaishang",
            "hk": "淮上",
            "id": "101220208",
            "zh": "淮上"
        }], "en": "bengbu", "hk": "蚌埠", "id": "181", "zh": "蚌埠"
    }, {
        "children": [{"en": "wuhu", "hk": "蕪湖", "id": "101220301", "zh": "芜湖"}, {
            "en": "fanyang",
            "hk": "繁昌",
            "id": "101220302",
            "zh": "繁昌"
        }, {"en": "wuhuxian", "hk": "蕪湖縣", "id": "101220303", "zh": "芜湖县"}, {
            "en": "nanling",
            "hk": "南陵",
            "id": "101220304",
            "zh": "南陵"
        }, {"en": "wuwei", "hk": "無為", "id": "101220305", "zh": "无为"}, {
            "en": "jinghu",
            "hk": "鏡湖",
            "id": "101220306",
            "zh": "镜湖"
        }, {"en": "yijiang", "hk": "弋江", "id": "101220307", "zh": "弋江"}, {
            "en": "jiujiang",
            "hk": "鳩江",
            "id": "101220308",
            "zh": "鸠江"
        }, {"en": "sanshan", "hk": "三山", "id": "101220309", "zh": "三山"}],
        "en": "wuhu",
        "hk": "蕪湖",
        "id": "182",
        "zh": "芜湖"
    }, {
        "children": [{"en": "huainan", "hk": "淮南", "id": "101220401", "zh": "淮南"}, {
            "en": "fengtai",
            "hk": "鳳臺",
            "id": "101220402",
            "zh": "凤台"
        }, {"en": "panji", "hk": "潘集", "id": "101220403", "zh": "潘集"}, {
            "en": "shouxian",
            "hk": "壽縣",
            "id": "101220408",
            "zh": "寿县"
        }, {"en": "datong", "hk": "大通", "id": "101220404", "zh": "大通"}, {
            "en": "tianjiaan",
            "hk": "田家庵",
            "id": "101220405",
            "zh": "田家庵"
        }, {"en": "xiejiaji", "hk": "謝家集", "id": "101220406", "zh": "谢家集"}, {
            "en": "bagongshan",
            "hk": "八公山",
            "id": "101220407",
            "zh": "八公山"
        }], "en": "huainan", "hk": "淮南", "id": "183", "zh": "淮南"
    }, {
        "children": [{"en": "maanshan", "hk": "馬鞍山", "id": "101220501", "zh": "马鞍山"}, {
            "en": "dangtu",
            "hk": "當塗",
            "id": "101220502",
            "zh": "当涂"
        }, {"en": "hanshan", "hk": "含山", "id": "101220503", "zh": "含山"}, {
            "en": "hexian",
            "hk": "和縣",
            "id": "101220504",
            "zh": "和县"
        }, {"en": "huashan", "hk": "花山", "id": "101220505", "zh": "花山"}, {
            "en": "yushan",
            "hk": "雨山",
            "id": "101220506",
            "zh": "雨山"
        }, {"en": "bowang", "hk": "博望", "id": "101220507", "zh": "博望"}],
        "en": "maanshan",
        "hk": "馬鞍山",
        "id": "184",
        "zh": "马鞍山"
    }, {
        "children": [{"en": "anqing", "hk": "安慶", "id": "101220601", "zh": "安庆"}, {
            "en": "taihu",
            "hk": "太湖",
            "id": "101220603",
            "zh": "太湖"
        }, {"en": "qianshan", "hk": "潛山", "id": "101220604", "zh": "潜山"}, {
            "en": "huaining",
            "hk": "懷寧",
            "id": "101220605",
            "zh": "怀宁"
        }, {"en": "susong", "hk": "宿松", "id": "101220606", "zh": "宿松"}, {
            "en": "wangjiang",
            "hk": "望江",
            "id": "101220607",
            "zh": "望江"
        }, {"en": "yuexi", "hk": "岳西", "id": "101220608", "zh": "岳西"}, {
            "en": "tongcheng",
            "hk": "桐城",
            "id": "101220609",
            "zh": "桐城"
        }, {"en": "yingjiang", "hk": "迎江", "id": "101220610", "zh": "迎江"}, {
            "en": "daguan",
            "hk": "大觀",
            "id": "101220611",
            "zh": "大观"
        }, {"en": "yixiu", "hk": "宜秀", "id": "101220612", "zh": "宜秀"}],
        "en": "anqing",
        "hk": "安慶",
        "id": "185",
        "zh": "安庆"
    }, {
        "children": [{"en": "suzhou", "hk": "宿州", "id": "101220701", "zh": "宿州"}, {
            "en": "dangshan",
            "hk": "碭山",
            "id": "101220702",
            "zh": "砀山"
        }, {"en": "lingbi", "hk": "靈璧", "id": "101220703", "zh": "灵璧"}, {
            "en": "sixian",
            "hk": "泗縣",
            "id": "101220704",
            "zh": "泗县"
        }, {"en": "xiaoxian", "hk": "蕭縣", "id": "101220705", "zh": "萧县"}, {
            "en": "yongqiao",
            "hk": "埇橋",
            "id": "101220706",
            "zh": "埇桥"
        }], "en": "suzhou", "hk": "宿州", "id": "186", "zh": "宿州"
    }, {
        "children": [{"en": "fuyang", "hk": "阜陽", "id": "101220801", "zh": "阜阳"}, {
            "en": "funan",
            "hk": "阜南",
            "id": "101220802",
            "zh": "阜南"
        }, {"en": "yingshang", "hk": "潁上", "id": "101220803", "zh": "颍上"}, {
            "en": "linquan",
            "hk": "臨泉",
            "id": "101220804",
            "zh": "临泉"
        }, {"en": "jieshou", "hk": "界首", "id": "101220805", "zh": "界首"}, {
            "en": "taihe",
            "hk": "太和",
            "id": "101220806",
            "zh": "太和"
        }, {"en": "yingzhou", "hk": "潁州", "id": "101220807", "zh": "颍州"}, {
            "en": "yingdong",
            "hk": "潁東",
            "id": "101220808",
            "zh": "颍东"
        }, {"en": "yingquan", "hk": "潁泉", "id": "101220809", "zh": "颍泉"}],
        "en": "fuyang",
        "hk": "阜陽",
        "id": "187",
        "zh": "阜阳"
    }, {
        "children": [{"en": "bozhou", "hk": "亳州", "id": "101220901", "zh": "亳州"}, {
            "en": "guoyang",
            "hk": "渦陽",
            "id": "101220902",
            "zh": "涡阳"
        }, {"en": "lixin", "hk": "利辛", "id": "101220903", "zh": "利辛"}, {
            "en": "mengcheng",
            "hk": "蒙城",
            "id": "101220904",
            "zh": "蒙城"
        }, {"en": "qiaocheng", "hk": "譙城", "id": "101220905", "zh": "谯城"}],
        "en": "bozhou",
        "hk": "亳州",
        "id": "188",
        "zh": "亳州"
    }, {
        "children": [{"en": "huangshan", "hk": "黃山", "id": "101221001", "zh": "黄山"}, {
            "en": "huangshanqu",
            "hk": "黃山區",
            "id": "101221002",
            "zh": "黄山区"
        }, {"en": "tunxi", "hk": "屯溪", "id": "101221003", "zh": "屯溪"}, {
            "en": "qimen",
            "hk": "祁門",
            "id": "101221004",
            "zh": "祁门"
        }, {"en": "yixian", "hk": "黟縣", "id": "101221005", "zh": "黟县"}, {
            "en": "shexian",
            "hk": "歙縣",
            "id": "101221006",
            "zh": "歙县"
        }, {"en": "xiuning", "hk": "休寧", "id": "101221007", "zh": "休宁"}, {
            "en": "huizhou",
            "hk": "徽州",
            "id": "101221009",
            "zh": "徽州"
        }, {"en": "huangshanfengjingqu", "hk": "黃山風景區（光明頂）", "id": "101221008", "zh": "黄山风景区(光明顶)"}],
        "en": "huangshan",
        "hk": "黃山",
        "id": "189",
        "zh": "黄山"
    }, {
        "children": [{"en": "chuzhou", "hk": "滁州", "id": "101221101", "zh": "滁州"}, {
            "en": "fengyang",
            "hk": "鳳陽",
            "id": "101221102",
            "zh": "凤阳"
        }, {"en": "mingguang", "hk": "明光", "id": "101221103", "zh": "明光"}, {
            "en": "dingyuan",
            "hk": "定遠",
            "id": "101221104",
            "zh": "定远"
        }, {"en": "quanjiao", "hk": "全椒", "id": "101221105", "zh": "全椒"}, {
            "en": "laian",
            "hk": "來安",
            "id": "101221106",
            "zh": "来安"
        }, {"en": "tianchang", "hk": "天長", "id": "101221107", "zh": "天长"}, {
            "en": "langya",
            "hk": "瑯琊",
            "id": "101221108",
            "zh": "琅琊"
        }, {"en": "nanqiao", "hk": "南譙", "id": "101221109", "zh": "南谯"}],
        "en": "chuzhou",
        "hk": "滁州",
        "id": "190",
        "zh": "滁州"
    }, {
        "children": [{"en": "huaibei", "hk": "淮北", "id": "101221201", "zh": "淮北"}, {
            "en": "suixi",
            "hk": "濉溪",
            "id": "101221202",
            "zh": "濉溪"
        }, {"en": "duji", "hk": "杜集", "id": "101221203", "zh": "杜集"}, {
            "en": "xiangshan",
            "hk": "相山",
            "id": "101221204",
            "zh": "相山"
        }, {"en": "lieshan", "hk": "烈山", "id": "101221205", "zh": "烈山"}],
        "en": "huaibei",
        "hk": "淮北",
        "id": "191",
        "zh": "淮北"
    }, {
        "children": [{"en": "zongyang", "hk": "樅陽", "id": "101221305", "zh": "枞阳"}, {
            "en": "tongling",
            "hk": "銅陵",
            "id": "101221301",
            "zh": "铜陵"
        }, {"en": "tongguan", "hk": "銅官", "id": "101221302", "zh": "铜官"}, {
            "en": "yian",
            "hk": "義安",
            "id": "101221303",
            "zh": "义安"
        }, {"en": "jiaoqu", "hk": "郊區", "id": "101221304", "zh": "郊区"}],
        "en": "tongling",
        "hk": "銅陵",
        "id": "192",
        "zh": "铜陵"
    }, {
        "children": [{"en": "xuancheng", "hk": "宣城", "id": "101221401", "zh": "宣城"}, {
            "en": "jingxian",
            "hk": "涇縣",
            "id": "101221402",
            "zh": "泾县"
        }, {"en": "jingde", "hk": "旌德", "id": "101221403", "zh": "旌德"}, {
            "en": "ningguo",
            "hk": "寧國",
            "id": "101221404",
            "zh": "宁国"
        }, {"en": "jixi", "hk": "績溪", "id": "101221405", "zh": "绩溪"}, {
            "en": "guangde",
            "hk": "廣德",
            "id": "101221406",
            "zh": "广德"
        }, {"en": "langxi", "hk": "郎溪", "id": "101221407", "zh": "郎溪"}, {
            "en": "xuanzhou",
            "hk": "宣州",
            "id": "101221408",
            "zh": "宣州"
        }], "en": "xuancheng", "hk": "宣城", "id": "193", "zh": "宣城"
    }, {
        "children": [{"en": "luan", "hk": "六安", "id": "101221501", "zh": "六安"}, {
            "en": "huoqiu",
            "hk": "霍邱",
            "id": "101221502",
            "zh": "霍邱"
        }, {"en": "jinzhai", "hk": "金寨", "id": "101221505", "zh": "金寨"}, {
            "en": "huoshan",
            "hk": "霍山",
            "id": "101221506",
            "zh": "霍山"
        }, {"en": "shucheng", "hk": "舒城", "id": "101221507", "zh": "舒城"}, {
            "en": "jinan",
            "hk": "金安",
            "id": "101221504",
            "zh": "金安"
        }, {"en": "yuan", "hk": "裕安", "id": "101221508", "zh": "裕安"}, {
            "en": "yeji",
            "hk": "葉集",
            "id": "101221509",
            "zh": "叶集"
        }], "en": "luan", "hk": "六安", "id": "194", "zh": "六安"
    }, {
        "children": [{"en": "chizhou", "hk": "池州", "id": "101221701", "zh": "池州"}, {
            "en": "dongzhi",
            "hk": "東至",
            "id": "101221702",
            "zh": "东至"
        }, {"en": "qingyang", "hk": "青陽", "id": "101221703", "zh": "青阳"}, {
            "en": "jiuhuashan",
            "hk": "九華山",
            "id": "101221704",
            "zh": "九华山"
        }, {"en": "shitai", "hk": "石台", "id": "101221705", "zh": "石台"}, {
            "en": "guichi",
            "hk": "貴池",
            "id": "101221706",
            "zh": "贵池"
        }], "en": "chizhou", "hk": "池州", "id": "195", "zh": "池州"
    }], "en": "anhui", "hk": "安徽", "id": "179", "zh": "安徽"
}, {
    "children": [{
        "children": [{"en": "wuhan", "hk": "武漢", "id": "101200101", "zh": "武汉"}, {
            "en": "caidian",
            "hk": "蔡甸",
            "id": "101200102",
            "zh": "蔡甸"
        }, {"en": "huangpi", "hk": "黃陂", "id": "101200103", "zh": "黄陂"}, {
            "en": "xinzhou",
            "hk": "新洲",
            "id": "101200104",
            "zh": "新洲"
        }, {"en": "jiangxia", "hk": "江夏", "id": "101200105", "zh": "江夏"}, {
            "en": "dongxihu",
            "hk": "東西湖",
            "id": "101200106",
            "zh": "东西湖"
        }, {"en": "jiangan", "hk": "江岸", "id": "101200107", "zh": "江岸"}, {
            "en": "jianghan",
            "hk": "江漢",
            "id": "101200108",
            "zh": "江汉"
        }, {"en": "qiaokou", "hk": "礄口", "id": "101200109", "zh": "硚口"}, {
            "en": "hanyang",
            "hk": "漢陽",
            "id": "101200110",
            "zh": "汉阳"
        }, {"en": "wuchang", "hk": "武昌", "id": "101200111", "zh": "武昌"}, {
            "en": "qingshan",
            "hk": "青山",
            "id": "101200112",
            "zh": "青山"
        }, {"en": "hongshan", "hk": "洪山", "id": "101200113", "zh": "洪山"}, {
            "en": "hannan",
            "hk": "漢南",
            "id": "101200114",
            "zh": "汉南"
        }], "en": "wuhan", "hk": "武漢", "id": "197", "zh": "武汉"
    }, {
        "children": [{"en": "xiangyang", "hk": "襄陽", "id": "101200201", "zh": "襄阳"}, {
            "en": "xiangzhou",
            "hk": "襄州",
            "id": "101200202",
            "zh": "襄州"
        }, {"en": "baokang", "hk": "保康", "id": "101200203", "zh": "保康"}, {
            "en": "nanzhang",
            "hk": "南漳",
            "id": "101200204",
            "zh": "南漳"
        }, {"en": "yicheng", "hk": "宜城", "id": "101200205", "zh": "宜城"}, {
            "en": "laohekou",
            "hk": "老河口",
            "id": "101200206",
            "zh": "老河口"
        }, {"en": "gucheng", "hk": "谷城", "id": "101200207", "zh": "谷城"}, {
            "en": "zaoyang",
            "hk": "棗陽",
            "id": "101200208",
            "zh": "枣阳"
        }, {"en": "xiangcheng", "hk": "襄城", "id": "101200209", "zh": "襄城"}, {
            "en": "fancheng",
            "hk": "樊城",
            "id": "101200210",
            "zh": "樊城"
        }], "en": "xiangyang", "hk": "襄陽", "id": "198", "zh": "襄阳"
    }, {
        "children": [{"en": "ezhou", "hk": "鄂州", "id": "101200301", "zh": "鄂州"}, {
            "en": "liangzihu",
            "hk": "梁子湖",
            "id": "101200302",
            "zh": "梁子湖"
        }, {"en": "huarong", "hk": "華容", "id": "101200303", "zh": "华容"}, {
            "en": "echeng",
            "hk": "鄂城",
            "id": "101200304",
            "zh": "鄂城"
        }], "en": "ezhou", "hk": "鄂州", "id": "199", "zh": "鄂州"
    }, {
        "children": [{"en": "xiaogan", "hk": "孝感", "id": "101200401", "zh": "孝感"}, {
            "en": "anlu",
            "hk": "安陸",
            "id": "101200402",
            "zh": "安陆"
        }, {"en": "yunmeng", "hk": "雲夢", "id": "101200403", "zh": "云梦"}, {
            "en": "dawu",
            "hk": "大悟",
            "id": "101200404",
            "zh": "大悟"
        }, {"en": "yingcheng", "hk": "應城", "id": "101200405", "zh": "应城"}, {
            "en": "hanchuan",
            "hk": "漢川",
            "id": "101200406",
            "zh": "汉川"
        }, {"en": "xiaochang", "hk": "孝昌", "id": "101200407", "zh": "孝昌"}, {
            "en": "xiaonan",
            "hk": "孝南",
            "id": "101200408",
            "zh": "孝南"
        }], "en": "xiaogan", "hk": "孝感", "id": "200", "zh": "孝感"
    }, {
        "children": [{"en": "huanggang", "hk": "黃岡", "id": "101200501", "zh": "黄冈"}, {
            "en": "hongan",
            "hk": "紅安",
            "id": "101200502",
            "zh": "红安"
        }, {"en": "macheng", "hk": "麻城", "id": "101200503", "zh": "麻城"}, {
            "en": "luotian",
            "hk": "羅田",
            "id": "101200504",
            "zh": "罗田"
        }, {"en": "yingshan", "hk": "英山", "id": "101200505", "zh": "英山"}, {
            "en": "xishui",
            "hk": "浠水",
            "id": "101200506",
            "zh": "浠水"
        }, {"en": "qichun", "hk": "蘄春", "id": "101200507", "zh": "蕲春"}, {
            "en": "huangmei",
            "hk": "黃梅",
            "id": "101200508",
            "zh": "黄梅"
        }, {"en": "wuxue", "hk": "武穴", "id": "101200509", "zh": "武穴"}, {
            "en": "tuanfeng",
            "hk": "團風",
            "id": "101200510",
            "zh": "团风"
        }, {"en": "huangzhou", "hk": "黃州", "id": "101200511", "zh": "黄州"}],
        "en": "huanggang",
        "hk": "黃岡",
        "id": "201",
        "zh": "黄冈"
    }, {
        "children": [{"en": "huangshi", "hk": "黃石", "id": "101200601", "zh": "黄石"}, {
            "en": "daye",
            "hk": "大冶",
            "id": "101200602",
            "zh": "大冶"
        }, {"en": "yangxin", "hk": "陽新", "id": "101200603", "zh": "阳新"}, {
            "en": "tieshan",
            "hk": "鐵山",
            "id": "101200604",
            "zh": "铁山"
        }, {"en": "xialu", "hk": "下陸", "id": "101200605", "zh": "下陆"}, {
            "en": "xisaishan",
            "hk": "西塞山",
            "id": "101200606",
            "zh": "西塞山"
        }, {"en": "huangshigang", "hk": "黃石港", "id": "101200607", "zh": "黄石港"}],
        "en": "huangshi",
        "hk": "黃石",
        "id": "202",
        "zh": "黄石"
    }, {
        "children": [{"en": "xianning", "hk": "咸寧", "id": "101200701", "zh": "咸宁"}, {
            "en": "chibi",
            "hk": "赤壁",
            "id": "101200702",
            "zh": "赤壁"
        }, {"en": "jiayu", "hk": "嘉魚", "id": "101200703", "zh": "嘉鱼"}, {
            "en": "chongyang",
            "hk": "崇陽",
            "id": "101200704",
            "zh": "崇阳"
        }, {"en": "tongcheng", "hk": "通城", "id": "101200705", "zh": "通城"}, {
            "en": "tongshan",
            "hk": "通山",
            "id": "101200706",
            "zh": "通山"
        }, {"en": "xianan", "hk": "咸安", "id": "101200707", "zh": "咸安"}],
        "en": "xianning",
        "hk": "咸寧",
        "id": "203",
        "zh": "咸宁"
    }, {
        "children": [{"en": "jingzhou", "hk": "荊州", "id": "101200801", "zh": "荆州"}, {
            "en": "jiangling",
            "hk": "江陵",
            "id": "101200802",
            "zh": "江陵"
        }, {"en": "gongan", "hk": "公安", "id": "101200803", "zh": "公安"}, {
            "en": "shishou",
            "hk": "石首",
            "id": "101200804",
            "zh": "石首"
        }, {"en": "jianli", "hk": "監利", "id": "101200805", "zh": "监利"}, {
            "en": "honghu",
            "hk": "洪湖",
            "id": "101200806",
            "zh": "洪湖"
        }, {"en": "songzi", "hk": "松滋", "id": "101200807", "zh": "松滋"}, {
            "en": "shashi",
            "hk": "沙市",
            "id": "101200808",
            "zh": "沙市"
        }], "en": "jingzhou", "hk": "荊州", "id": "204", "zh": "荆州"
    }, {
        "children": [{"en": "yichang", "hk": "宜昌", "id": "101200901", "zh": "宜昌"}, {
            "en": "yuanan",
            "hk": "遠安",
            "id": "101200902",
            "zh": "远安"
        }, {"en": "zigui", "hk": "秭歸", "id": "101200903", "zh": "秭归"}, {
            "en": "xingshan",
            "hk": "興山",
            "id": "101200904",
            "zh": "兴山"
        }, {"en": "wufeng", "hk": "五峰", "id": "101200906", "zh": "五峰"}, {
            "en": "dangyang",
            "hk": "當陽",
            "id": "101200907",
            "zh": "当阳"
        }, {"en": "changyang", "hk": "長陽", "id": "101200908", "zh": "长阳"}, {
            "en": "yidu",
            "hk": "宜都",
            "id": "101200909",
            "zh": "宜都"
        }, {"en": "zhijiang", "hk": "枝江", "id": "101200910", "zh": "枝江"}, {
            "en": "yiling",
            "hk": "夷陵",
            "id": "101200912",
            "zh": "夷陵"
        }, {"en": "xiling", "hk": "西陵", "id": "101200905", "zh": "西陵"}, {
            "en": "wujiagang",
            "hk": "伍家崗",
            "id": "101200913",
            "zh": "伍家岗"
        }, {"en": "dianjun", "hk": "點軍", "id": "101200914", "zh": "点军"}, {
            "en": "xiaoting",
            "hk": "猇亭",
            "id": "101200915",
            "zh": "猇亭"
        }, {"en": "sanxia", "hk": "三峽", "id": "101200911", "zh": "三峡"}],
        "en": "yichang",
        "hk": "宜昌",
        "id": "205",
        "zh": "宜昌"
    }, {
        "children": [{"en": "enshi", "hk": "恩施", "id": "101201001", "zh": "恩施"}, {
            "en": "lichuan",
            "hk": "利川",
            "id": "101201002",
            "zh": "利川"
        }, {"en": "jianshi", "hk": "建始", "id": "101201003", "zh": "建始"}, {
            "en": "xianfeng",
            "hk": "咸豐",
            "id": "101201004",
            "zh": "咸丰"
        }, {"en": "xuanen", "hk": "宣恩", "id": "101201005", "zh": "宣恩"}, {
            "en": "hefeng",
            "hk": "鶴峰",
            "id": "101201006",
            "zh": "鹤峰"
        }, {"en": "laifeng", "hk": "來鳳", "id": "101201007", "zh": "来凤"}, {
            "en": "badong",
            "hk": "巴東",
            "id": "101201008",
            "zh": "巴东"
        }], "en": "enshi", "hk": "恩施", "id": "206", "zh": "恩施"
    }, {
        "children": [{"en": "shiyan", "hk": "十堰", "id": "101201101", "zh": "十堰"}, {
            "en": "zhuxi",
            "hk": "竹溪",
            "id": "101201102",
            "zh": "竹溪"
        }, {"en": "yunxi", "hk": "鄖西", "id": "101201103", "zh": "郧西"}, {
            "en": "yunyang",
            "hk": "鄖陽",
            "id": "101201104",
            "zh": "郧阳"
        }, {"en": "zhushan", "hk": "竹山", "id": "101201105", "zh": "竹山"}, {
            "en": "fangxian",
            "hk": "房縣",
            "id": "101201106",
            "zh": "房县"
        }, {"en": "danjiangkou", "hk": "丹江口", "id": "101201107", "zh": "丹江口"}, {
            "en": "maojian",
            "hk": "茅箭",
            "id": "101201108",
            "zh": "茅箭"
        }, {"en": "zhangwan", "hk": "張灣", "id": "101201109", "zh": "张湾"}],
        "en": "shiyan",
        "hk": "十堰",
        "id": "207",
        "zh": "十堰"
    }, {
        "children": [{"en": "shennongjia", "hk": "神農架", "id": "101201201", "zh": "神农架"}],
        "en": "shennongjia",
        "hk": "神農架",
        "id": "208",
        "zh": "神农架"
    }, {
        "children": [{"en": "suizhou", "hk": "隨州", "id": "101201301", "zh": "随州"}, {
            "en": "guangshui",
            "hk": "廣水",
            "id": "101201302",
            "zh": "广水"
        }, {"en": "zengdou", "hk": "曾都", "id": "101201303", "zh": "曾都"}, {
            "en": "suixian",
            "hk": "隨縣",
            "id": "101201304",
            "zh": "随县"
        }], "en": "suizhou", "hk": "隨州", "id": "209", "zh": "随州"
    }, {
        "children": [{"en": "jingmen", "hk": "荊門", "id": "101201401", "zh": "荆门"}, {
            "en": "zhongxiang",
            "hk": "鍾祥",
            "id": "101201402",
            "zh": "钟祥"
        }, {"en": "jingshan", "hk": "京山", "id": "101201403", "zh": "京山"}, {
            "en": "duodao",
            "hk": "掇刀",
            "id": "101201404",
            "zh": "掇刀"
        }, {"en": "shayang", "hk": "沙洋", "id": "101201405", "zh": "沙洋"}, {
            "en": "dongbao",
            "hk": "東寶",
            "id": "101201406",
            "zh": "东宝"
        }], "en": "jingmen", "hk": "荊門", "id": "210", "zh": "荆门"
    }, {
        "children": [{"en": "tianmen", "hk": "天門", "id": "101201501", "zh": "天门"}],
        "en": "tianmen",
        "hk": "天門",
        "id": "211",
        "zh": "天门"
    }, {
        "children": [{"en": "xiantao", "hk": "仙桃", "id": "101201601", "zh": "仙桃"}],
        "en": "xiantao",
        "hk": "仙桃",
        "id": "212",
        "zh": "仙桃"
    }, {
        "children": [{"en": "qianjiang", "hk": "潛江", "id": "101201701", "zh": "潜江"}],
        "en": "qianjiang",
        "hk": "潛江",
        "id": "213",
        "zh": "潜江"
    }], "en": "hubei", "hk": "湖北", "id": "196", "zh": "湖北"
}, {
    "children": [{
        "children": [{"en": "changsha", "hk": "長沙", "id": "101250101", "zh": "长沙"}, {
            "en": "ningxiang",
            "hk": "寧鄉",
            "id": "101250102",
            "zh": "宁乡"
        }, {"en": "liuyang", "hk": "瀏陽", "id": "101250103", "zh": "浏阳"}, {
            "en": "xiangjiangxinqu",
            "hk": "湘江新區",
            "id": "101250104",
            "zh": "湘江新区"
        }, {"en": "wangcheng", "hk": "望城", "id": "101250105", "zh": "望城"}, {
            "en": "changshaxian",
            "hk": "長沙縣",
            "id": "101250106",
            "zh": "长沙县"
        }, {"en": "furong", "hk": "芙蓉", "id": "101250107", "zh": "芙蓉"}, {
            "en": "tianxin",
            "hk": "天心",
            "id": "101250108",
            "zh": "天心"
        }, {"en": "yuelu", "hk": "岳麓", "id": "101250109", "zh": "岳麓"}, {
            "en": "kaifu",
            "hk": "開福",
            "id": "101250110",
            "zh": "开福"
        }, {"en": "yuhua", "hk": "雨花", "id": "101250111", "zh": "雨花"}],
        "en": "changsha",
        "hk": "長沙",
        "id": "215",
        "zh": "长沙"
    }, {
        "children": [{"en": "xiangtan", "hk": "湘潭", "id": "101250201", "zh": "湘潭"}, {
            "en": "shaoshan",
            "hk": "韶山",
            "id": "101250202",
            "zh": "韶山"
        }, {"en": "xiangxiang", "hk": "湘鄉", "id": "101250203", "zh": "湘乡"}, {
            "en": "yuhu",
            "hk": "雨湖",
            "id": "101250204",
            "zh": "雨湖"
        }, {"en": "yuetang", "hk": "岳塘", "id": "101250205", "zh": "岳塘"}],
        "en": "xiangtan",
        "hk": "湘潭",
        "id": "216",
        "zh": "湘潭"
    }, {
        "children": [{"en": "zhuzhou", "hk": "株洲", "id": "101250301", "zh": "株洲"}, {
            "en": "youxian",
            "hk": "攸縣",
            "id": "101250302",
            "zh": "攸县"
        }, {"en": "liling", "hk": "醴陵", "id": "101250303", "zh": "醴陵"}, {
            "en": "chaling",
            "hk": "茶陵",
            "id": "101250305",
            "zh": "茶陵"
        }, {"en": "yanling", "hk": "炎陵", "id": "101250306", "zh": "炎陵"}, {
            "en": "hetang",
            "hk": "荷塘",
            "id": "101250304",
            "zh": "荷塘"
        }, {"en": "lusong", "hk": "蘆淞", "id": "101250307", "zh": "芦淞"}, {
            "en": "shifeng",
            "hk": "石峰",
            "id": "101250308",
            "zh": "石峰"
        }, {"en": "tianyuan", "hk": "天元", "id": "101250309", "zh": "天元"}],
        "en": "zhuzhou",
        "hk": "株洲",
        "id": "217",
        "zh": "株洲"
    }, {
        "children": [{"en": "hengyang", "hk": "衡陽", "id": "101250401", "zh": "衡阳"}, {
            "en": "hengshan",
            "hk": "衡山",
            "id": "101250402",
            "zh": "衡山"
        }, {"en": "hengdong", "hk": "衡東", "id": "101250403", "zh": "衡东"}, {
            "en": "qidong",
            "hk": "祁東",
            "id": "101250404",
            "zh": "祁东"
        }, {"en": "hengyangxian", "hk": "衡陽縣", "id": "101250405", "zh": "衡阳县"}, {
            "en": "changning",
            "hk": "常寧",
            "id": "101250406",
            "zh": "常宁"
        }, {"en": "hengnan", "hk": "衡南", "id": "101250407", "zh": "衡南"}, {
            "en": "leiyang",
            "hk": "耒陽",
            "id": "101250408",
            "zh": "耒阳"
        }, {"en": "nanyue", "hk": "南嶽", "id": "101250409", "zh": "南岳"}, {
            "en": "zhuhui",
            "hk": "珠暉",
            "id": "101250410",
            "zh": "珠晖"
        }, {"en": "yanfeng", "hk": "雁峰", "id": "101250411", "zh": "雁峰"}, {
            "en": "shigu",
            "hk": "石鼓",
            "id": "101250412",
            "zh": "石鼓"
        }, {"en": "zhengxiang", "hk": "蒸湘", "id": "101250413", "zh": "蒸湘"}],
        "en": "hengyang",
        "hk": "衡陽",
        "id": "218",
        "zh": "衡阳"
    }, {
        "children": [{"en": "chenzhou", "hk": "郴州", "id": "101250501", "zh": "郴州"}, {
            "en": "guiyang",
            "hk": "桂陽",
            "id": "101250502",
            "zh": "桂阳"
        }, {"en": "jiahe", "hk": "嘉禾", "id": "101250503", "zh": "嘉禾"}, {
            "en": "yizhang",
            "hk": "宜章",
            "id": "101250504",
            "zh": "宜章"
        }, {"en": "linwu", "hk": "臨武", "id": "101250505", "zh": "临武"}, {
            "en": "zixing",
            "hk": "資興",
            "id": "101250507",
            "zh": "资兴"
        }, {"en": "rucheng", "hk": "汝城", "id": "101250508", "zh": "汝城"}, {
            "en": "anren",
            "hk": "安仁",
            "id": "101250509",
            "zh": "安仁"
        }, {"en": "yongxing", "hk": "永興", "id": "101250510", "zh": "永兴"}, {
            "en": "guidong",
            "hk": "桂東",
            "id": "101250511",
            "zh": "桂东"
        }, {"en": "suxian", "hk": "蘇仙", "id": "101250512", "zh": "苏仙"}, {
            "en": "beihu",
            "hk": "北湖",
            "id": "101250506",
            "zh": "北湖"
        }], "en": "chenzhou", "hk": "郴州", "id": "219", "zh": "郴州"
    }, {
        "children": [{"en": "changde", "hk": "常德", "id": "101250601", "zh": "常德"}, {
            "en": "anxiang",
            "hk": "安鄉",
            "id": "101250602",
            "zh": "安乡"
        }, {"en": "taoyuan", "hk": "桃源", "id": "101250603", "zh": "桃源"}, {
            "en": "hanshou",
            "hk": "漢壽",
            "id": "101250604",
            "zh": "汉寿"
        }, {"en": "lixian", "hk": "澧縣", "id": "101250605", "zh": "澧县"}, {
            "en": "linli",
            "hk": "臨澧",
            "id": "101250606",
            "zh": "临澧"
        }, {"en": "shimen", "hk": "石門", "id": "101250607", "zh": "石门"}, {
            "en": "jinshi",
            "hk": "津市",
            "id": "101250608",
            "zh": "津市"
        }, {"en": "wuling", "hk": "武陵", "id": "101250609", "zh": "武陵"}, {
            "en": "dingcheng",
            "hk": "鼎城",
            "id": "101250610",
            "zh": "鼎城"
        }], "en": "changde", "hk": "常德", "id": "220", "zh": "常德"
    }, {
        "children": [{"en": "yiyang", "hk": "益陽", "id": "101250700", "zh": "益阳"}, {
            "en": "heshanqu",
            "hk": "赫山區",
            "id": "101250701",
            "zh": "赫山区"
        }, {"en": "nanxian", "hk": "南縣", "id": "101250702", "zh": "南县"}, {
            "en": "taojiang",
            "hk": "桃江",
            "id": "101250703",
            "zh": "桃江"
        }, {"en": "anhua", "hk": "安化", "id": "101250704", "zh": "安化"}, {
            "en": "yuanjiang",
            "hk": "沅江",
            "id": "101250705",
            "zh": "沅江"
        }, {"en": "ziyang", "hk": "資陽", "id": "101250706", "zh": "资阳"}],
        "en": "yiyang",
        "hk": "益陽",
        "id": "221",
        "zh": "益阳"
    }, {
        "children": [{"en": "loudi", "hk": "婁底", "id": "101250801", "zh": "娄底"}, {
            "en": "shuangfeng",
            "hk": "雙峰",
            "id": "101250802",
            "zh": "双峰"
        }, {"en": "lengshuijiang", "hk": "冷水江", "id": "101250803", "zh": "冷水江"}, {
            "en": "xinhua",
            "hk": "新化",
            "id": "101250805",
            "zh": "新化"
        }, {"en": "lianyuan", "hk": "漣源", "id": "101250806", "zh": "涟源"}, {
            "en": "louxing",
            "hk": "婁星",
            "id": "101250804",
            "zh": "娄星"
        }], "en": "loudi", "hk": "婁底", "id": "222", "zh": "娄底"
    }, {
        "children": [{"en": "shaoyang", "hk": "邵陽", "id": "101250901", "zh": "邵阳"}, {
            "en": "longhui",
            "hk": "隆回",
            "id": "101250902",
            "zh": "隆回"
        }, {"en": "dongkou", "hk": "洞口", "id": "101250903", "zh": "洞口"}, {
            "en": "xinshao",
            "hk": "新邵",
            "id": "101250904",
            "zh": "新邵"
        }, {"en": "shaodong", "hk": "邵東", "id": "101250905", "zh": "邵东"}, {
            "en": "suining",
            "hk": "綏寧",
            "id": "101250906",
            "zh": "绥宁"
        }, {"en": "xinning", "hk": "新寧", "id": "101250907", "zh": "新宁"}, {
            "en": "wugang",
            "hk": "武岡",
            "id": "101250908",
            "zh": "武冈"
        }, {"en": "chengbu", "hk": "城步", "id": "101250909", "zh": "城步"}, {
            "en": "shaoyangxian",
            "hk": "邵陽縣",
            "id": "101250910",
            "zh": "邵阳县"
        }, {"en": "shuangqing", "hk": "雙清", "id": "101250911", "zh": "双清"}, {
            "en": "daxiang",
            "hk": "大祥",
            "id": "101250912",
            "zh": "大祥"
        }, {"en": "beita", "hk": "北塔", "id": "101250913", "zh": "北塔"}],
        "en": "shaoyang",
        "hk": "邵陽",
        "id": "223",
        "zh": "邵阳"
    }, {
        "children": [{"en": "yueyang", "hk": "岳陽", "id": "101251001", "zh": "岳阳"}, {
            "en": "huarong",
            "hk": "華容",
            "id": "101251002",
            "zh": "华容"
        }, {"en": "xiangyin", "hk": "湘陰", "id": "101251003", "zh": "湘阴"}, {
            "en": "miluo",
            "hk": "汨羅",
            "id": "101251004",
            "zh": "汨罗"
        }, {"en": "pingjiang", "hk": "平江", "id": "101251005", "zh": "平江"}, {
            "en": "linxiang",
            "hk": "臨湘",
            "id": "101251006",
            "zh": "临湘"
        }, {"en": "yueyanglouqu", "hk": "岳陽樓區", "id": "101251007", "zh": "岳阳楼区"}, {
            "en": "yunxi",
            "hk": "雲溪",
            "id": "101251008",
            "zh": "云溪"
        }, {"en": "junshan", "hk": "君山", "id": "101251009", "zh": "君山"}],
        "en": "yueyang",
        "hk": "岳陽",
        "id": "224",
        "zh": "岳阳"
    }, {
        "children": [{"en": "zhangjiajie", "hk": "張家界", "id": "101251101", "zh": "张家界"}, {
            "en": "sangzhi",
            "hk": "桑植",
            "id": "101251102",
            "zh": "桑植"
        }, {"en": "cili", "hk": "慈利", "id": "101251103", "zh": "慈利"}, {
            "en": "wulingyuan",
            "hk": "武陵源",
            "id": "101251104",
            "zh": "武陵源"
        }, {"en": "yongding", "hk": "永定", "id": "101251105", "zh": "永定"}],
        "en": "zhangjiajie",
        "hk": "張家界",
        "id": "225",
        "zh": "张家界"
    }, {
        "children": [{"en": "huaihua", "hk": "懷化", "id": "101251201", "zh": "怀化"}, {
            "en": "yuanling",
            "hk": "沅陵",
            "id": "101251203",
            "zh": "沅陵"
        }, {"en": "chenxi", "hk": "辰溪", "id": "101251204", "zh": "辰溪"}, {
            "en": "jingzhou",
            "hk": "靖州",
            "id": "101251205",
            "zh": "靖州"
        }, {"en": "huitong", "hk": "會同", "id": "101251206", "zh": "会同"}, {
            "en": "tongdao",
            "hk": "通道",
            "id": "101251207",
            "zh": "通道"
        }, {"en": "mayang", "hk": "麻陽", "id": "101251208", "zh": "麻阳"}, {
            "en": "xinhuang",
            "hk": "新晃",
            "id": "101251209",
            "zh": "新晃"
        }, {"en": "zhijiang", "hk": "芷江", "id": "101251210", "zh": "芷江"}, {
            "en": "xupu",
            "hk": "溆浦",
            "id": "101251211",
            "zh": "溆浦"
        }, {"en": "zhongfang", "hk": "中方", "id": "101251212", "zh": "中方"}, {
            "en": "hongjiang",
            "hk": "洪江",
            "id": "101251213",
            "zh": "洪江"
        }, {"en": "hecheng", "hk": "鶴城", "id": "101251202", "zh": "鹤城"}],
        "en": "huaihua",
        "hk": "懷化",
        "id": "226",
        "zh": "怀化"
    }, {
        "children": [{"en": "yongzhou", "hk": "永州", "id": "101251401", "zh": "永州"}, {
            "en": "qiyang",
            "hk": "祁陽",
            "id": "101251402",
            "zh": "祁阳"
        }, {"en": "dongan", "hk": "東安", "id": "101251403", "zh": "东安"}, {
            "en": "shuangpai",
            "hk": "雙牌",
            "id": "101251404",
            "zh": "双牌"
        }, {"en": "daoxian", "hk": "道縣", "id": "101251405", "zh": "道县"}, {
            "en": "ningyuan",
            "hk": "寧遠",
            "id": "101251406",
            "zh": "宁远"
        }, {"en": "jiangyong", "hk": "江永", "id": "101251407", "zh": "江永"}, {
            "en": "lanshan",
            "hk": "藍山",
            "id": "101251408",
            "zh": "蓝山"
        }, {"en": "xintian", "hk": "新田", "id": "101251409", "zh": "新田"}, {
            "en": "jianghua",
            "hk": "江華",
            "id": "101251410",
            "zh": "江华"
        }, {"en": "lengshuitan", "hk": "冷水灘", "id": "101251411", "zh": "冷水滩"}, {
            "en": "lingling",
            "hk": "零陵",
            "id": "101251412",
            "zh": "零陵"
        }], "en": "yongzhou", "hk": "永州", "id": "227", "zh": "永州"
    }, {
        "children": [{"en": "jishou", "hk": "吉首", "id": "101251501", "zh": "吉首"}, {
            "en": "baojing",
            "hk": "保靖",
            "id": "101251502",
            "zh": "保靖"
        }, {"en": "yongshun", "hk": "永順", "id": "101251503", "zh": "永顺"}, {
            "en": "guzhang",
            "hk": "古丈",
            "id": "101251504",
            "zh": "古丈"
        }, {"en": "fenghuang", "hk": "鳳凰", "id": "101251505", "zh": "凤凰"}, {
            "en": "luxi",
            "hk": "瀘溪",
            "id": "101251506",
            "zh": "泸溪"
        }, {"en": "longshan", "hk": "龍山", "id": "101251507", "zh": "龙山"}, {
            "en": "huayuan",
            "hk": "花垣",
            "id": "101251508",
            "zh": "花垣"
        }, {"en": "xiangxi", "hk": "湘西", "id": "101251509", "zh": "湘西"}],
        "en": "xiangxi",
        "hk": "湘西",
        "id": "228",
        "zh": "湘西"
    }], "en": "hunan", "hk": "湖南", "id": "214", "zh": "湖南"
}, {
    "children": [{
        "children": [{"en": "guangzhou", "hk": "廣州", "id": "101280101", "zh": "广州"}, {
            "en": "panyu",
            "hk": "番禺",
            "id": "101280102",
            "zh": "番禺"
        }, {"en": "conghua", "hk": "從化", "id": "101280103", "zh": "从化"}, {
            "en": "zengcheng",
            "hk": "增城",
            "id": "101280104",
            "zh": "增城"
        }, {"en": "huadu", "hk": "花都", "id": "101280105", "zh": "花都"}, {
            "en": "liwan",
            "hk": "荔灣",
            "id": "101280106",
            "zh": "荔湾"
        }, {"en": "yuexiu", "hk": "越秀", "id": "101280107", "zh": "越秀"}, {
            "en": "haizhu",
            "hk": "海珠",
            "id": "101280108",
            "zh": "海珠"
        }, {"en": "tianhe", "hk": "天河", "id": "101280109", "zh": "天河"}, {
            "en": "baiyun",
            "hk": "白雲",
            "id": "101280110",
            "zh": "白云"
        }, {"en": "huangpu", "hk": "黃埔", "id": "101280111", "zh": "黄埔"}, {
            "en": "nansha",
            "hk": "南沙",
            "id": "101280112",
            "zh": "南沙"
        }], "en": "guangzhou", "hk": "廣州", "id": "230", "zh": "广州"
    }, {
        "children": [{"en": "shaoguan", "hk": "韶關", "id": "101280201", "zh": "韶关"}, {
            "en": "ruyuan",
            "hk": "乳源",
            "id": "101280202",
            "zh": "乳源"
        }, {"en": "shixing", "hk": "始興", "id": "101280203", "zh": "始兴"}, {
            "en": "wengyuan",
            "hk": "翁源",
            "id": "101280204",
            "zh": "翁源"
        }, {"en": "lechang", "hk": "樂昌", "id": "101280205", "zh": "乐昌"}, {
            "en": "renhua",
            "hk": "仁化",
            "id": "101280206",
            "zh": "仁化"
        }, {"en": "nanxiong", "hk": "南雄", "id": "101280207", "zh": "南雄"}, {
            "en": "xinfeng",
            "hk": "新豐",
            "id": "101280208",
            "zh": "新丰"
        }, {"en": "qujiang", "hk": "曲江", "id": "101280209", "zh": "曲江"}, {
            "en": "zhenjiang",
            "hk": "湞江",
            "id": "101280210",
            "zh": "浈江"
        }, {"en": "wujiang", "hk": "武江", "id": "101280211", "zh": "武江"}],
        "en": "shaoguan",
        "hk": "韶關",
        "id": "231",
        "zh": "韶关"
    }, {
        "children": [{"en": "huizhou", "hk": "惠州", "id": "101280301", "zh": "惠州"}, {
            "en": "boluo",
            "hk": "博羅",
            "id": "101280302",
            "zh": "博罗"
        }, {"en": "huiyang", "hk": "惠陽", "id": "101280303", "zh": "惠阳"}, {
            "en": "huidong",
            "hk": "惠東",
            "id": "101280304",
            "zh": "惠东"
        }, {"en": "longmen", "hk": "龍門", "id": "101280305", "zh": "龙门"}, {
            "en": "huicheng",
            "hk": "惠城",
            "id": "101280306",
            "zh": "惠城"
        }], "en": "huizhou", "hk": "惠州", "id": "232", "zh": "惠州"
    }, {
        "children": [{"en": "meizhou", "hk": "梅州", "id": "101280401", "zh": "梅州"}, {
            "en": "xingning",
            "hk": "興寧",
            "id": "101280402",
            "zh": "兴宁"
        }, {"en": "jiaoling", "hk": "蕉嶺", "id": "101280403", "zh": "蕉岭"}, {
            "en": "dabu",
            "hk": "大埔",
            "id": "101280404",
            "zh": "大埔"
        }, {"en": "fengshun", "hk": "豐順", "id": "101280406", "zh": "丰顺"}, {
            "en": "pingyuan",
            "hk": "平遠",
            "id": "101280407",
            "zh": "平远"
        }, {"en": "wuhua", "hk": "五華", "id": "101280408", "zh": "五华"}, {
            "en": "meixian",
            "hk": "梅縣",
            "id": "101280409",
            "zh": "梅县"
        }, {"en": "meijiang", "hk": "梅江", "id": "101280405", "zh": "梅江"}],
        "en": "meizhou",
        "hk": "梅州",
        "id": "233",
        "zh": "梅州"
    }, {
        "children": [{"en": "shantou", "hk": "汕頭", "id": "101280501", "zh": "汕头"}, {
            "en": "chaoyang",
            "hk": "潮陽",
            "id": "101280502",
            "zh": "潮阳"
        }, {"en": "chenghai", "hk": "澄海", "id": "101280503", "zh": "澄海"}, {
            "en": "nanao",
            "hk": "南澳",
            "id": "101280504",
            "zh": "南澳"
        }, {"en": "longhu", "hk": "龍湖", "id": "101280505", "zh": "龙湖"}, {
            "en": "jinping",
            "hk": "金平",
            "id": "101280506",
            "zh": "金平"
        }, {"en": "haojiang", "hk": "濠江", "id": "101280507", "zh": "濠江"}, {
            "en": "chaonan",
            "hk": "潮南",
            "id": "101280508",
            "zh": "潮南"
        }], "en": "shantou", "hk": "汕頭", "id": "234", "zh": "汕头"
    }, {
        "children": [{"en": "shenzhen", "hk": "深圳", "id": "101280601", "zh": "深圳"}, {
            "en": "luohu",
            "hk": "羅湖",
            "id": "101280602",
            "zh": "罗湖"
        }, {"en": "futian", "hk": "福田", "id": "101280603", "zh": "福田"}, {
            "en": "nanshan",
            "hk": "南山",
            "id": "101280604",
            "zh": "南山"
        }, {"en": "baoan", "hk": "寶安", "id": "101280605", "zh": "宝安"}, {
            "en": "longgang",
            "hk": "龍崗",
            "id": "101280606",
            "zh": "龙岗"
        }, {"en": "yantian", "hk": "鹽田", "id": "101280607", "zh": "盐田"}, {
            "en": "longhua",
            "hk": "龍華",
            "id": "101280608",
            "zh": "龙华"
        }, {"en": "pingshan", "hk": "坪山", "id": "101280609", "zh": "坪山"}],
        "en": "shenzhen",
        "hk": "深圳",
        "id": "235",
        "zh": "深圳"
    }, {
        "children": [{"en": "zhuhai", "hk": "珠海", "id": "101280701", "zh": "珠海"}, {
            "en": "doumen",
            "hk": "斗門",
            "id": "101280702",
            "zh": "斗门"
        }, {"en": "jinwan", "hk": "金灣", "id": "101280703", "zh": "金湾"}, {
            "en": "xiangzhou",
            "hk": "香洲",
            "id": "101280704",
            "zh": "香洲"
        }], "en": "zhuhai", "hk": "珠海", "id": "236", "zh": "珠海"
    }, {
        "children": [{"en": "foshan", "hk": "佛山", "id": "101280800", "zh": "佛山"}, {
            "en": "shunde",
            "hk": "順德",
            "id": "101280801",
            "zh": "顺德"
        }, {"en": "sanshui", "hk": "三水", "id": "101280802", "zh": "三水"}, {
            "en": "nanhai",
            "hk": "南海",
            "id": "101280803",
            "zh": "南海"
        }, {"en": "gaoming", "hk": "高明", "id": "101280804", "zh": "高明"}, {
            "en": "chancheng",
            "hk": "禪城",
            "id": "101280805",
            "zh": "禅城"
        }], "en": "foshan", "hk": "佛山", "id": "237", "zh": "佛山"
    }, {
        "children": [{"en": "zhaoqing", "hk": "肇慶", "id": "101280901", "zh": "肇庆"}, {
            "en": "guangning",
            "hk": "廣寧",
            "id": "101280902",
            "zh": "广宁"
        }, {"en": "sihui", "hk": "四會", "id": "101280903", "zh": "四会"}, {
            "en": "deqing",
            "hk": "德慶",
            "id": "101280905",
            "zh": "德庆"
        }, {"en": "huaiji", "hk": "懷集", "id": "101280906", "zh": "怀集"}, {
            "en": "fengkai",
            "hk": "封開",
            "id": "101280907",
            "zh": "封开"
        }, {"en": "gaoyao", "hk": "高要", "id": "101280908", "zh": "高要"}, {
            "en": "duanzhou",
            "hk": "端州",
            "id": "101280904",
            "zh": "端州"
        }, {"en": "dinghu", "hk": "鼎湖", "id": "101280909", "zh": "鼎湖"}],
        "en": "zhaoqing",
        "hk": "肇慶",
        "id": "238",
        "zh": "肇庆"
    }, {
        "children": [{"en": "zhanjiang", "hk": "湛江", "id": "101281001", "zh": "湛江"}, {
            "en": "wuchuan",
            "hk": "吳川",
            "id": "101281002",
            "zh": "吴川"
        }, {"en": "leizhou", "hk": "雷州", "id": "101281003", "zh": "雷州"}, {
            "en": "xuwen",
            "hk": "徐聞",
            "id": "101281004",
            "zh": "徐闻"
        }, {"en": "lianjiang", "hk": "廉江", "id": "101281005", "zh": "廉江"}, {
            "en": "chikan",
            "hk": "赤坎",
            "id": "101281006",
            "zh": "赤坎"
        }, {"en": "suixi", "hk": "遂溪", "id": "101281007", "zh": "遂溪"}, {
            "en": "potou",
            "hk": "坡頭",
            "id": "101281008",
            "zh": "坡头"
        }, {"en": "xiashan", "hk": "霞山", "id": "101281009", "zh": "霞山"}, {
            "en": "mazhang",
            "hk": "麻章",
            "id": "101281010",
            "zh": "麻章"
        }], "en": "zhanjiang", "hk": "湛江", "id": "239", "zh": "湛江"
    }, {
        "children": [{"en": "jiangmen", "hk": "江門", "id": "101281101", "zh": "江门"}, {
            "en": "kaiping",
            "hk": "開平",
            "id": "101281103",
            "zh": "开平"
        }, {"en": "xinhui", "hk": "新會", "id": "101281104", "zh": "新会"}, {
            "en": "enping",
            "hk": "恩平",
            "id": "101281105",
            "zh": "恩平"
        }, {"en": "taishan", "hk": "台山", "id": "101281106", "zh": "台山"}, {
            "en": "pengjiang",
            "hk": "蓬江",
            "id": "101281107",
            "zh": "蓬江"
        }, {"en": "heshan", "hk": "鶴山", "id": "101281108", "zh": "鹤山"}, {
            "en": "jianghai",
            "hk": "江海",
            "id": "101281109",
            "zh": "江海"
        }], "en": "jiangmen", "hk": "江門", "id": "240", "zh": "江门"
    }, {
        "children": [{"en": "heyuan", "hk": "河源", "id": "101281201", "zh": "河源"}, {
            "en": "zijin",
            "hk": "紫金",
            "id": "101281202",
            "zh": "紫金"
        }, {"en": "lianping", "hk": "連平", "id": "101281203", "zh": "连平"}, {
            "en": "heping",
            "hk": "和平",
            "id": "101281204",
            "zh": "和平"
        }, {"en": "longchuan", "hk": "龍川", "id": "101281205", "zh": "龙川"}, {
            "en": "dongyuan",
            "hk": "東源",
            "id": "101281206",
            "zh": "东源"
        }, {"en": "yuancheng", "hk": "源城", "id": "101281207", "zh": "源城"}],
        "en": "heyuan",
        "hk": "河源",
        "id": "241",
        "zh": "河源"
    }, {
        "children": [{"en": "qingyuan", "hk": "清遠", "id": "101281301", "zh": "清远"}, {
            "en": "liannan",
            "hk": "連南",
            "id": "101281302",
            "zh": "连南"
        }, {"en": "lianzhou", "hk": "連州", "id": "101281303", "zh": "连州"}, {
            "en": "lianshan",
            "hk": "連山",
            "id": "101281304",
            "zh": "连山"
        }, {"en": "yangshan", "hk": "陽山", "id": "101281305", "zh": "阳山"}, {
            "en": "fogang",
            "hk": "佛岡",
            "id": "101281306",
            "zh": "佛冈"
        }, {"en": "yingde", "hk": "英德", "id": "101281307", "zh": "英德"}, {
            "en": "qingxin",
            "hk": "清新",
            "id": "101281308",
            "zh": "清新"
        }, {"en": "qingcheng", "hk": "清城", "id": "101281309", "zh": "清城"}],
        "en": "qingyuan",
        "hk": "清遠",
        "id": "242",
        "zh": "清远"
    }, {
        "children": [{"en": "yunfu", "hk": "雲浮", "id": "101281401", "zh": "云浮"}, {
            "en": "luoding",
            "hk": "羅定",
            "id": "101281402",
            "zh": "罗定"
        }, {"en": "xinxing", "hk": "新興", "id": "101281403", "zh": "新兴"}, {
            "en": "yunan",
            "hk": "郁南",
            "id": "101281404",
            "zh": "郁南"
        }, {"en": "yunan", "hk": "雲安", "id": "101281406", "zh": "云安"}, {
            "en": "yuncheng",
            "hk": "雲城",
            "id": "101281405",
            "zh": "云城"
        }], "en": "yunfu", "hk": "雲浮", "id": "243", "zh": "云浮"
    }, {
        "children": [{"en": "chaozhou", "hk": "潮州", "id": "101281501", "zh": "潮州"}, {
            "en": "raoping",
            "hk": "饒平",
            "id": "101281502",
            "zh": "饶平"
        }, {"en": "chaoan", "hk": "潮安", "id": "101281503", "zh": "潮安"}, {
            "en": "xiangqiao",
            "hk": "湘橋",
            "id": "101281504",
            "zh": "湘桥"
        }], "en": "chaozhou", "hk": "潮州", "id": "244", "zh": "潮州"
    }, {
        "children": [{"en": "dongguan", "hk": "東莞", "id": "101281601", "zh": "东莞"}],
        "en": "dongguan",
        "hk": "東莞",
        "id": "245",
        "zh": "东莞"
    }, {
        "children": [{"en": "zhongshan", "hk": "中山", "id": "101281701", "zh": "中山"}],
        "en": "zhongshan",
        "hk": "中山",
        "id": "246",
        "zh": "中山"
    }, {
        "children": [{"en": "yangjiang", "hk": "陽江", "id": "101281801", "zh": "阳江"}, {
            "en": "yangchun",
            "hk": "陽春",
            "id": "101281802",
            "zh": "阳春"
        }, {"en": "yangdong", "hk": "陽東", "id": "101281803", "zh": "阳东"}, {
            "en": "yangxi",
            "hk": "陽西",
            "id": "101281804",
            "zh": "阳西"
        }, {"en": "jiangcheng", "hk": "江城", "id": "101281805", "zh": "江城"}],
        "en": "yangjiang",
        "hk": "陽江",
        "id": "247",
        "zh": "阳江"
    }, {
        "children": [{"en": "jieyang", "hk": "揭陽", "id": "101281901", "zh": "揭阳"}, {
            "en": "jiexi",
            "hk": "揭西",
            "id": "101281902",
            "zh": "揭西"
        }, {"en": "puning", "hk": "普寧", "id": "101281903", "zh": "普宁"}, {
            "en": "huilai",
            "hk": "惠來",
            "id": "101281904",
            "zh": "惠来"
        }, {"en": "jiedong", "hk": "揭東", "id": "101281905", "zh": "揭东"}, {
            "en": "rongcheng",
            "hk": "榕城",
            "id": "101281906",
            "zh": "榕城"
        }], "en": "jieyang", "hk": "揭陽", "id": "248", "zh": "揭阳"
    }, {
        "children": [{"en": "maoming", "hk": "茂名", "id": "101282001", "zh": "茂名"}, {
            "en": "gaozhou",
            "hk": "高州",
            "id": "101282002",
            "zh": "高州"
        }, {"en": "huazhou", "hk": "化州", "id": "101282003", "zh": "化州"}, {
            "en": "dianbai",
            "hk": "電白",
            "id": "101282004",
            "zh": "电白"
        }, {"en": "xinyi", "hk": "信宜", "id": "101282005", "zh": "信宜"}, {
            "en": "maonan",
            "hk": "茂南",
            "id": "101282007",
            "zh": "茂南"
        }], "en": "maoming", "hk": "茂名", "id": "249", "zh": "茂名"
    }, {
        "children": [{"en": "shanwei", "hk": "汕尾", "id": "101282101", "zh": "汕尾"}, {
            "en": "haifeng",
            "hk": "海豐",
            "id": "101282102",
            "zh": "海丰"
        }, {"en": "lufeng", "hk": "陸豐", "id": "101282103", "zh": "陆丰"}, {
            "en": "luhe",
            "hk": "陸河",
            "id": "101282104",
            "zh": "陆河"
        }], "en": "shanwei", "hk": "汕尾", "id": "250", "zh": "汕尾"
    }], "en": "guangdong", "hk": "廣東", "id": "229", "zh": "广东"
}, {
    "children": [{
        "children": [{"en": "nanning", "hk": "南寧", "id": "101300101", "zh": "南宁"}, {
            "en": "yongning",
            "hk": "邕寧",
            "id": "101300103",
            "zh": "邕宁"
        }, {"en": "hengxian", "hk": "橫縣", "id": "101300104", "zh": "横县"}, {
            "en": "longan",
            "hk": "隆安",
            "id": "101300105",
            "zh": "隆安"
        }, {"en": "mashan", "hk": "馬山", "id": "101300106", "zh": "马山"}, {
            "en": "shanglin",
            "hk": "上林",
            "id": "101300107",
            "zh": "上林"
        }, {"en": "wuming", "hk": "武鳴", "id": "101300108", "zh": "武鸣"}, {
            "en": "binyang",
            "hk": "賓陽",
            "id": "101300109",
            "zh": "宾阳"
        }, {"en": "xingning", "hk": "興寧", "id": "101300102", "zh": "兴宁"}, {
            "en": "qingxiu",
            "hk": "青秀",
            "id": "101300110",
            "zh": "青秀"
        }, {"en": "jiangnan", "hk": "江南", "id": "101300111", "zh": "江南"}, {
            "en": "xixiangtang",
            "hk": "西鄉塘",
            "id": "101300112",
            "zh": "西乡塘"
        }, {"en": "liangqing", "hk": "良慶", "id": "101300113", "zh": "良庆"}],
        "en": "nanning",
        "hk": "南寧",
        "id": "252",
        "zh": "南宁"
    }, {
        "children": [{"en": "chongzuo", "hk": "崇左", "id": "101300201", "zh": "崇左"}, {
            "en": "tiandeng",
            "hk": "天等",
            "id": "101300202",
            "zh": "天等"
        }, {"en": "longzhou", "hk": "龍州", "id": "101300203", "zh": "龙州"}, {
            "en": "pingxiang",
            "hk": "憑祥",
            "id": "101300204",
            "zh": "凭祥"
        }, {"en": "daxin", "hk": "大新", "id": "101300205", "zh": "大新"}, {
            "en": "fusui",
            "hk": "扶綏",
            "id": "101300206",
            "zh": "扶绥"
        }, {"en": "ningming", "hk": "寧明", "id": "101300207", "zh": "宁明"}, {
            "en": "jiangzhou",
            "hk": "江州",
            "id": "101300208",
            "zh": "江州"
        }], "en": "chongzuo", "hk": "崇左", "id": "253", "zh": "崇左"
    }, {
        "children": [{"en": "liuzhou", "hk": "柳州", "id": "101300301", "zh": "柳州"}, {
            "en": "liucheng",
            "hk": "柳城",
            "id": "101300302",
            "zh": "柳城"
        }, {"en": "luzhai", "hk": "鹿砦", "id": "101300304", "zh": "鹿寨"}, {
            "en": "liujiang",
            "hk": "柳江",
            "id": "101300305",
            "zh": "柳江"
        }, {"en": "rongan", "hk": "融安", "id": "101300306", "zh": "融安"}, {
            "en": "rongshui",
            "hk": "融水",
            "id": "101300307",
            "zh": "融水"
        }, {"en": "sanjiang", "hk": "三江", "id": "101300308", "zh": "三江"}, {
            "en": "chengzhong",
            "hk": "城中",
            "id": "101300303",
            "zh": "城中"
        }, {"en": "yufeng", "hk": "魚峰", "id": "101300309", "zh": "鱼峰"}, {
            "en": "liunan",
            "hk": "柳南",
            "id": "101300310",
            "zh": "柳南"
        }, {"en": "liubei", "hk": "柳北", "id": "101300311", "zh": "柳北"}],
        "en": "liuzhou",
        "hk": "柳州",
        "id": "254",
        "zh": "柳州"
    }, {
        "children": [{"en": "laibin", "hk": "來賓", "id": "101300401", "zh": "来宾"}, {
            "en": "xicheng",
            "hk": "忻城",
            "id": "101300402",
            "zh": "忻城"
        }, {"en": "jinxiu", "hk": "金秀", "id": "101300403", "zh": "金秀"}, {
            "en": "xiangzhou",
            "hk": "象州",
            "id": "101300404",
            "zh": "象州"
        }, {"en": "wuxuan", "hk": "武宣", "id": "101300405", "zh": "武宣"}, {
            "en": "heshan",
            "hk": "合山",
            "id": "101300406",
            "zh": "合山"
        }, {"en": "xingbin", "hk": "興賓", "id": "101300407", "zh": "兴宾"}],
        "en": "laibin",
        "hk": "來賓",
        "id": "255",
        "zh": "来宾"
    }, {
        "children": [{"en": "guilin", "hk": "桂林", "id": "101300501", "zh": "桂林"}, {
            "en": "longsheng",
            "hk": "龍勝",
            "id": "101300503",
            "zh": "龙胜"
        }, {"en": "yongfu", "hk": "永福", "id": "101300504", "zh": "永福"}, {
            "en": "lingui",
            "hk": "臨桂",
            "id": "101300505",
            "zh": "临桂"
        }, {"en": "xingan", "hk": "興安", "id": "101300506", "zh": "兴安"}, {
            "en": "lingchuan",
            "hk": "靈川",
            "id": "101300507",
            "zh": "灵川"
        }, {"en": "quanzhou", "hk": "全州", "id": "101300508", "zh": "全州"}, {
            "en": "guanyang",
            "hk": "灌陽",
            "id": "101300509",
            "zh": "灌阳"
        }, {"en": "yangshuo", "hk": "陽朔", "id": "101300510", "zh": "阳朔"}, {
            "en": "gongcheng",
            "hk": "恭城",
            "id": "101300511",
            "zh": "恭城"
        }, {"en": "pingle", "hk": "平樂", "id": "101300512", "zh": "平乐"}, {
            "en": "lipu",
            "hk": "荔浦",
            "id": "101300513",
            "zh": "荔浦"
        }, {"en": "ziyuan", "hk": "資源", "id": "101300514", "zh": "资源"}, {
            "en": "xiufeng",
            "hk": "秀峰",
            "id": "101300502",
            "zh": "秀峰"
        }, {"en": "diecai", "hk": "疊彩", "id": "101300515", "zh": "叠彩"}, {
            "en": "xiangshan",
            "hk": "象山",
            "id": "101300516",
            "zh": "象山"
        }, {"en": "qixing", "hk": "七星", "id": "101300517", "zh": "七星"}, {
            "en": "yanshan",
            "hk": "雁山",
            "id": "101300518",
            "zh": "雁山"
        }], "en": "guilin", "hk": "桂林", "id": "256", "zh": "桂林"
    }, {
        "children": [{"en": "wuzhou", "hk": "梧州", "id": "101300601", "zh": "梧州"}, {
            "en": "tengxian",
            "hk": "藤縣",
            "id": "101300602",
            "zh": "藤县"
        }, {"en": "cangwu", "hk": "蒼梧", "id": "101300604", "zh": "苍梧"}, {
            "en": "mengshan",
            "hk": "蒙山",
            "id": "101300605",
            "zh": "蒙山"
        }, {"en": "cenxi", "hk": "岑溪", "id": "101300606", "zh": "岑溪"}, {
            "en": "wanxiu",
            "hk": "萬秀",
            "id": "101300603",
            "zh": "万秀"
        }, {"en": "changzhou", "hk": "長洲", "id": "101300607", "zh": "长洲"}, {
            "en": "longwei",
            "hk": "龍圩",
            "id": "101300608",
            "zh": "龙圩"
        }], "en": "wuzhou", "hk": "梧州", "id": "257", "zh": "梧州"
    }, {
        "children": [{"en": "hezhou", "hk": "賀州", "id": "101300701", "zh": "贺州"}, {
            "en": "zhaoping",
            "hk": "昭平",
            "id": "101300702",
            "zh": "昭平"
        }, {"en": "fuchuan", "hk": "富川", "id": "101300703", "zh": "富川"}, {
            "en": "zhongshan",
            "hk": "鐘山",
            "id": "101300704",
            "zh": "钟山"
        }, {"en": "babu", "hk": "八步", "id": "101300705", "zh": "八步"}, {
            "en": "pinggui",
            "hk": "平桂",
            "id": "101300706",
            "zh": "平桂"
        }], "en": "hezhou", "hk": "賀州", "id": "258", "zh": "贺州"
    }, {
        "children": [{"en": "guigang", "hk": "貴港", "id": "101300801", "zh": "贵港"}, {
            "en": "guiping",
            "hk": "桂平",
            "id": "101300802",
            "zh": "桂平"
        }, {"en": "pingnan", "hk": "平南", "id": "101300803", "zh": "平南"}, {
            "en": "gangbei",
            "hk": "港北",
            "id": "101300804",
            "zh": "港北"
        }, {"en": "gangnan", "hk": "港南", "id": "101300805", "zh": "港南"}, {
            "en": "tantang",
            "hk": "覃塘",
            "id": "101300806",
            "zh": "覃塘"
        }], "en": "guigang", "hk": "貴港", "id": "259", "zh": "贵港"
    }, {
        "children": [{"en": "yulin", "hk": "玉林", "id": "101300901", "zh": "玉林"}, {
            "en": "bobai",
            "hk": "博白",
            "id": "101300902",
            "zh": "博白"
        }, {"en": "beiliu", "hk": "北流", "id": "101300903", "zh": "北流"}, {
            "en": "rongxian",
            "hk": "容縣",
            "id": "101300904",
            "zh": "容县"
        }, {"en": "luchuan", "hk": "陸川", "id": "101300905", "zh": "陆川"}, {
            "en": "xingye",
            "hk": "興業",
            "id": "101300906",
            "zh": "兴业"
        }, {"en": "yuzhou", "hk": "玉州", "id": "101300907", "zh": "玉州"}, {
            "en": "fumian",
            "hk": "福綿",
            "id": "101300908",
            "zh": "福绵"
        }], "en": "yulin", "hk": "玉林", "id": "260", "zh": "玉林"
    }, {
        "children": [{"en": "baise", "hk": "百色", "id": "101301001", "zh": "百色"}, {
            "en": "napo",
            "hk": "那坡",
            "id": "101301002",
            "zh": "那坡"
        }, {"en": "tianyang", "hk": "田陽", "id": "101301003", "zh": "田阳"}, {
            "en": "debao",
            "hk": "德保",
            "id": "101301004",
            "zh": "德保"
        }, {"en": "jingxi", "hk": "靖西", "id": "101301005", "zh": "靖西"}, {
            "en": "tiandong",
            "hk": "田東",
            "id": "101301006",
            "zh": "田东"
        }, {"en": "pingguo", "hk": "平果", "id": "101301007", "zh": "平果"}, {
            "en": "longlin",
            "hk": "隆林",
            "id": "101301008",
            "zh": "隆林"
        }, {"en": "xilin", "hk": "西林", "id": "101301009", "zh": "西林"}, {
            "en": "leye",
            "hk": "樂業",
            "id": "101301010",
            "zh": "乐业"
        }, {"en": "lingyun", "hk": "凌雲", "id": "101301011", "zh": "凌云"}, {
            "en": "tianlin",
            "hk": "田林",
            "id": "101301012",
            "zh": "田林"
        }, {"en": "youjiang", "hk": "右江", "id": "101301013", "zh": "右江"}],
        "en": "baise",
        "hk": "百色",
        "id": "261",
        "zh": "百色"
    }, {
        "children": [{"en": "qinzhou", "hk": "欽州", "id": "101301101", "zh": "钦州"}, {
            "en": "pubei",
            "hk": "浦北",
            "id": "101301102",
            "zh": "浦北"
        }, {"en": "lingshan", "hk": "靈山", "id": "101301103", "zh": "灵山"}, {
            "en": "qinnan",
            "hk": "欽南",
            "id": "101301104",
            "zh": "钦南"
        }, {"en": "qinbei", "hk": "欽北", "id": "101301105", "zh": "钦北"}],
        "en": "qinzhou",
        "hk": "欽州",
        "id": "262",
        "zh": "钦州"
    }, {
        "children": [{"en": "hechi", "hk": "河池", "id": "101301201", "zh": "河池"}, {
            "en": "tiane",
            "hk": "天峨",
            "id": "101301202",
            "zh": "天峨"
        }, {"en": "donglan", "hk": "東蘭", "id": "101301203", "zh": "东兰"}, {
            "en": "bama",
            "hk": "巴馬",
            "id": "101301204",
            "zh": "巴马"
        }, {"en": "huanjiang", "hk": "環江", "id": "101301205", "zh": "环江"}, {
            "en": "luocheng",
            "hk": "羅城",
            "id": "101301206",
            "zh": "罗城"
        }, {"en": "yizhou", "hk": "宜州", "id": "101301207", "zh": "宜州"}, {
            "en": "fengshan",
            "hk": "鳳山",
            "id": "101301208",
            "zh": "凤山"
        }, {"en": "nandan", "hk": "南丹", "id": "101301209", "zh": "南丹"}, {
            "en": "andu",
            "hk": "都安",
            "id": "101301210",
            "zh": "都安"
        }, {"en": "dahua", "hk": "大化", "id": "101301211", "zh": "大化"}, {
            "en": "jinchengjiang",
            "hk": "金城江",
            "id": "101301212",
            "zh": "金城江"
        }], "en": "hechi", "hk": "河池", "id": "263", "zh": "河池"
    }, {
        "children": [{"en": "beihai", "hk": "北海", "id": "101301301", "zh": "北海"}, {
            "en": "hepu",
            "hk": "合浦",
            "id": "101301302",
            "zh": "合浦"
        }, {"en": "haicheng", "hk": "海城", "id": "101301304", "zh": "海城"}, {
            "en": "yinhai",
            "hk": "銀海",
            "id": "101301305",
            "zh": "银海"
        }, {"en": "tieshangang", "hk": "鐵山港", "id": "101301306", "zh": "铁山港"}, {
            "en": "weizhoudao",
            "hk": "潿洲島",
            "id": "101301303",
            "zh": "涠洲岛"
        }], "en": "beihai", "hk": "北海", "id": "264", "zh": "北海"
    }, {
        "children": [{"en": "fangchenggang", "hk": "防城港", "id": "101301401", "zh": "防城港"}, {
            "en": "shangsi",
            "hk": "上思",
            "id": "101301402",
            "zh": "上思"
        }, {"en": "dongxing", "hk": "東興", "id": "101301403", "zh": "东兴"}, {
            "en": "fangcheng",
            "hk": "防城",
            "id": "101301405",
            "zh": "防城"
        }, {"en": "gangkou", "hk": "港口", "id": "101301404", "zh": "港口"}],
        "en": "fangchenggang",
        "hk": "防城港",
        "id": "265",
        "zh": "防城港"
    }], "en": "guangxi", "hk": "廣西", "id": "251", "zh": "广西"
}, {
    "children": [{
        "children": [{"en": "haikou", "hk": "海口", "id": "101310101", "zh": "海口"}, {
            "en": "xiuying",
            "hk": "秀英",
            "id": "101310102",
            "zh": "秀英"
        }, {"en": "longhua", "hk": "龍華", "id": "101310103", "zh": "龙华"}, {
            "en": "qiongshan",
            "hk": "瓊山",
            "id": "101310104",
            "zh": "琼山"
        }, {"en": "meilan", "hk": "美蘭", "id": "101310105", "zh": "美兰"}],
        "en": "haikou",
        "hk": "海口",
        "id": "267",
        "zh": "海口"
    }, {
        "children": [{"en": "sanya", "hk": "三亞", "id": "101310201", "zh": "三亚"}, {
            "en": "haitang",
            "hk": "海棠",
            "id": "101310213",
            "zh": "海棠"
        }, {"en": "jiyang", "hk": "吉陽", "id": "101310218", "zh": "吉阳"}, {
            "en": "tianya",
            "hk": "天涯",
            "id": "101310219",
            "zh": "天涯"
        }, {"en": "yazhou", "hk": "崖州", "id": "101310223", "zh": "崖州"}],
        "en": "sanya",
        "hk": "三亞",
        "id": "268",
        "zh": "三亚"
    }, {
        "children": [{"en": "dongfang", "hk": "東方", "id": "101310202", "zh": "东方"}],
        "en": "dongfang",
        "hk": "東方",
        "id": "269",
        "zh": "东方"
    }, {
        "children": [{"en": "lingao", "hk": "臨高", "id": "101310203", "zh": "临高"}],
        "en": "lingao",
        "hk": "臨高",
        "id": "270",
        "zh": "临高"
    }, {
        "children": [{"en": "chengmai", "hk": "澄邁", "id": "101310204", "zh": "澄迈"}],
        "en": "chengmai",
        "hk": "澄邁",
        "id": "271",
        "zh": "澄迈"
    }, {
        "children": [{"en": "danzhou", "hk": "儋州", "id": "101310205", "zh": "儋州"}],
        "en": "zhanzhou",
        "hk": "儋州",
        "id": "272",
        "zh": "儋州"
    }, {
        "children": [{"en": "changjiang", "hk": "昌江", "id": "101310206", "zh": "昌江"}],
        "en": "changjiang",
        "hk": "昌江",
        "id": "273",
        "zh": "昌江"
    }, {
        "children": [{"en": "baisha", "hk": "白沙", "id": "101310207", "zh": "白沙"}],
        "en": "baisha",
        "hk": "白沙",
        "id": "274",
        "zh": "白沙"
    }, {
        "children": [{"en": "qiongzhong", "hk": "瓊中", "id": "101310208", "zh": "琼中"}],
        "en": "qiongzhong",
        "hk": "瓊中",
        "id": "275",
        "zh": "琼中"
    }, {
        "children": [{"en": "dingan", "hk": "定安", "id": "101310209", "zh": "定安"}],
        "en": "dingan",
        "hk": "定安",
        "id": "276",
        "zh": "定安"
    }, {
        "children": [{"en": "tunchang", "hk": "屯昌", "id": "101310210", "zh": "屯昌"}],
        "en": "tunchang",
        "hk": "屯昌",
        "id": "277",
        "zh": "屯昌"
    }, {
        "children": [{"en": "qionghai", "hk": "瓊海", "id": "101310211", "zh": "琼海"}],
        "en": "qionghai",
        "hk": "瓊海",
        "id": "278",
        "zh": "琼海"
    }, {
        "children": [{"en": "wenchang", "hk": "文昌", "id": "101310212", "zh": "文昌"}],
        "en": "wenchang",
        "hk": "文昌",
        "id": "279",
        "zh": "文昌"
    }, {
        "children": [{"en": "baoting", "hk": "保亭", "id": "101310214", "zh": "保亭"}],
        "en": "baoting",
        "hk": "保亭",
        "id": "280",
        "zh": "保亭"
    }, {
        "children": [{"en": "wanning", "hk": "萬寧", "id": "101310215", "zh": "万宁"}],
        "en": "wanning",
        "hk": "萬寧",
        "id": "281",
        "zh": "万宁"
    }, {
        "children": [{"en": "lingshui", "hk": "陵水", "id": "101310216", "zh": "陵水"}],
        "en": "lingshui",
        "hk": "陵水",
        "id": "282",
        "zh": "陵水"
    }, {
        "children": [{"en": "ledong", "hk": "樂東", "id": "101310221", "zh": "乐东"}],
        "en": "ledong",
        "hk": "樂東",
        "id": "283",
        "zh": "乐东"
    }, {
        "children": [{"en": "wuzhishan", "hk": "五指山", "id": "101310222", "zh": "五指山"}],
        "en": "wuzhishan",
        "hk": "五指山",
        "id": "284",
        "zh": "五指山"
    }, {
        "children": [{"en": "xisha", "hk": "西沙", "id": "101310302", "zh": "西沙"}, {
            "en": "nansha",
            "hk": "南沙",
            "id": "101310304",
            "zh": "南沙"
        }, {"en": "zhongsha", "hk": "中沙", "id": "101310303", "zh": "中沙"}, {
            "en": "sansha",
            "hk": "三沙",
            "id": "101310301",
            "zh": "三沙"
        }, {"en": "huangyandao", "hk": "黃岩島", "id": "101310305", "zh": "黄岩岛"}],
        "en": "sansha",
        "hk": "三沙",
        "id": "285",
        "zh": "三沙"
    }], "en": "hainan", "hk": "海南", "id": "266", "zh": "海南"
}, {
    "children": [{
        "children": [{"en": "guiyang", "hk": "貴陽", "id": "101260101", "zh": "贵阳"}, {
            "en": "baiyun",
            "hk": "白雲",
            "id": "101260102",
            "zh": "白云"
        }, {"en": "huaxi", "hk": "花溪", "id": "101260103", "zh": "花溪"}, {
            "en": "wudang",
            "hk": "烏當",
            "id": "101260104",
            "zh": "乌当"
        }, {"en": "xifeng", "hk": "息烽", "id": "101260105", "zh": "息烽"}, {
            "en": "kaiyang",
            "hk": "開陽",
            "id": "101260106",
            "zh": "开阳"
        }, {"en": "xiuwen", "hk": "修文", "id": "101260107", "zh": "修文"}, {
            "en": "qingzhen",
            "hk": "清鎮",
            "id": "101260108",
            "zh": "清镇"
        }, {"en": "yunyan", "hk": "雲巖", "id": "101260110", "zh": "云岩"}, {
            "en": "nanming",
            "hk": "南明",
            "id": "101260111",
            "zh": "南明"
        }, {"en": "guanshanhu", "hk": "觀山湖", "id": "101260112", "zh": "观山湖"}],
        "en": "guiyang",
        "hk": "貴陽",
        "id": "287",
        "zh": "贵阳"
    }, {
        "children": [{"en": "zunyi", "hk": "遵義", "id": "101260201", "zh": "遵义"}, {
            "en": "renhuai",
            "hk": "仁懷",
            "id": "101260203",
            "zh": "仁怀"
        }, {"en": "suiyang", "hk": "綏陽", "id": "101260204", "zh": "绥阳"}, {
            "en": "meitan",
            "hk": "湄潭",
            "id": "101260205",
            "zh": "湄潭"
        }, {"en": "fenggang", "hk": "鳳岡", "id": "101260206", "zh": "凤冈"}, {
            "en": "tongzi",
            "hk": "桐梓",
            "id": "101260207",
            "zh": "桐梓"
        }, {"en": "chishui", "hk": "赤水", "id": "101260208", "zh": "赤水"}, {
            "en": "xishui",
            "hk": "習水",
            "id": "101260209",
            "zh": "习水"
        }, {"en": "daozhen", "hk": "道真", "id": "101260210", "zh": "道真"}, {
            "en": "zhengan",
            "hk": "正安",
            "id": "101260211",
            "zh": "正安"
        }, {"en": "wuchuan", "hk": "務川", "id": "101260212", "zh": "务川"}, {
            "en": "yuqing",
            "hk": "餘慶",
            "id": "101260213",
            "zh": "余庆"
        }, {"en": "huichuan", "hk": "匯川", "id": "101260214", "zh": "汇川"}, {
            "en": "honghuagang",
            "hk": "紅花崗",
            "id": "101260215",
            "zh": "红花岗"
        }, {"en": "bozhou", "hk": "播州", "id": "101260216", "zh": "播州"}],
        "en": "zunyi",
        "hk": "遵義",
        "id": "288",
        "zh": "遵义"
    }, {
        "children": [{"en": "anshun", "hk": "安順", "id": "101260301", "zh": "安顺"}, {
            "en": "puding",
            "hk": "普定",
            "id": "101260302",
            "zh": "普定"
        }, {"en": "zhenning", "hk": "鎮寧", "id": "101260303", "zh": "镇宁"}, {
            "en": "pingba",
            "hk": "平壩",
            "id": "101260304",
            "zh": "平坝"
        }, {"en": "ziyun", "hk": "紫雲", "id": "101260305", "zh": "紫云"}, {
            "en": "guanling",
            "hk": "關嶺",
            "id": "101260306",
            "zh": "关岭"
        }, {"en": "xixiu", "hk": "西秀", "id": "101260307", "zh": "西秀"}],
        "en": "anshun",
        "hk": "安順",
        "id": "289",
        "zh": "安顺"
    }, {
        "children": [{"en": "tongren", "hk": "銅仁", "id": "101260601", "zh": "铜仁"}, {
            "en": "jiangkou",
            "hk": "江口",
            "id": "101260602",
            "zh": "江口"
        }, {"en": "yuping", "hk": "玉屏", "id": "101260603", "zh": "玉屏"}, {
            "en": "wanshan",
            "hk": "萬山",
            "id": "101260604",
            "zh": "万山"
        }, {"en": "sinan", "hk": "思南", "id": "101260605", "zh": "思南"}, {
            "en": "yinjiang",
            "hk": "印江",
            "id": "101260607",
            "zh": "印江"
        }, {"en": "shiqian", "hk": "石阡", "id": "101260608", "zh": "石阡"}, {
            "en": "yanhe",
            "hk": "沿河",
            "id": "101260609",
            "zh": "沿河"
        }, {"en": "dejiang", "hk": "德江", "id": "101260610", "zh": "德江"}, {
            "en": "songtao",
            "hk": "松桃",
            "id": "101260611",
            "zh": "松桃"
        }, {"en": "bijiang", "hk": "碧江", "id": "101260606", "zh": "碧江"}],
        "en": "tongren",
        "hk": "銅仁",
        "id": "290",
        "zh": "铜仁"
    }, {
        "children": [{"en": "bijie", "hk": "畢節", "id": "101260701", "zh": "毕节"}, {
            "en": "hezhang",
            "hk": "赫章",
            "id": "101260702",
            "zh": "赫章"
        }, {"en": "jinsha", "hk": "金沙", "id": "101260703", "zh": "金沙"}, {
            "en": "weining",
            "hk": "威寧",
            "id": "101260704",
            "zh": "威宁"
        }, {"en": "dafang", "hk": "大方", "id": "101260705", "zh": "大方"}, {
            "en": "nayong",
            "hk": "納雍",
            "id": "101260706",
            "zh": "纳雍"
        }, {"en": "zhijin", "hk": "織金", "id": "101260707", "zh": "织金"}, {
            "en": "qianxi",
            "hk": "黔西",
            "id": "101260708",
            "zh": "黔西"
        }, {"en": "qixingguan", "hk": "七星關", "id": "101260709", "zh": "七星关"}],
        "en": "bijie",
        "hk": "畢節",
        "id": "291",
        "zh": "毕节"
    }, {
        "children": [{"en": "duyun", "hk": "都勻", "id": "101260401", "zh": "都匀"}, {
            "en": "guiding",
            "hk": "貴定",
            "id": "101260402",
            "zh": "贵定"
        }, {"en": "wengan", "hk": "瓮安", "id": "101260403", "zh": "瓮安"}, {
            "en": "changshun",
            "hk": "長順",
            "id": "101260404",
            "zh": "长顺"
        }, {"en": "fuquan", "hk": "福泉", "id": "101260405", "zh": "福泉"}, {
            "en": "huishui",
            "hk": "惠水",
            "id": "101260406",
            "zh": "惠水"
        }, {"en": "longli", "hk": "龍里", "id": "101260407", "zh": "龙里"}, {
            "en": "luodian",
            "hk": "羅甸",
            "id": "101260408",
            "zh": "罗甸"
        }, {"en": "pingtang", "hk": "平塘", "id": "101260409", "zh": "平塘"}, {
            "en": "dushan",
            "hk": "獨山",
            "id": "101260410",
            "zh": "独山"
        }, {"en": "sandu", "hk": "三都", "id": "101260411", "zh": "三都"}, {
            "en": "libo",
            "hk": "荔波",
            "id": "101260412",
            "zh": "荔波"
        }, {"en": "qiannan", "hk": "黔南", "id": "101260413", "zh": "黔南"}],
        "en": "qiannan",
        "hk": "黔南",
        "id": "292",
        "zh": "黔南"
    }, {
        "children": [{"en": "kaili", "hk": "凱里", "id": "101260501", "zh": "凯里"}, {
            "en": "cengong",
            "hk": "岑鞏",
            "id": "101260502",
            "zh": "岑巩"
        }, {"en": "shibing", "hk": "施秉", "id": "101260503", "zh": "施秉"}, {
            "en": "zhenyuan",
            "hk": "鎮遠",
            "id": "101260504",
            "zh": "镇远"
        }, {"en": "huangping", "hk": "黃平", "id": "101260505", "zh": "黄平"}, {
            "en": "majiang",
            "hk": "麻江",
            "id": "101260507",
            "zh": "麻江"
        }, {"en": "danzhai", "hk": "丹寨", "id": "101260508", "zh": "丹寨"}, {
            "en": "sansui",
            "hk": "三穗",
            "id": "101260509",
            "zh": "三穗"
        }, {"en": "taijiang", "hk": "台江", "id": "101260510", "zh": "台江"}, {
            "en": "jianhe",
            "hk": "劍河",
            "id": "101260511",
            "zh": "剑河"
        }, {"en": "leishan", "hk": "雷山", "id": "101260512", "zh": "雷山"}, {
            "en": "liping",
            "hk": "黎平",
            "id": "101260513",
            "zh": "黎平"
        }, {"en": "tianzhu", "hk": "天柱", "id": "101260514", "zh": "天柱"}, {
            "en": "jinping",
            "hk": "錦屏",
            "id": "101260515",
            "zh": "锦屏"
        }, {"en": "rongjiang", "hk": "榕江", "id": "101260516", "zh": "榕江"}, {
            "en": "congjiang",
            "hk": "從江",
            "id": "101260517",
            "zh": "从江"
        }, {"en": "qiandongnan", "hk": "黔東南", "id": "101260506", "zh": "黔东南"}],
        "en": "qiandongnan",
        "hk": "黔東南",
        "id": "293",
        "zh": "黔东南"
    }, {
        "children": [{"en": "shuicheng", "hk": "水城", "id": "101260801", "zh": "水城"}, {
            "en": "liuzhi",
            "hk": "六枝",
            "id": "101260802",
            "zh": "六枝"
        }, {"en": "panzhou", "hk": "盤州", "id": "101260804", "zh": "盘州"}, {
            "en": "liupanshui",
            "hk": "六盤水",
            "id": "101260803",
            "zh": "六盘水"
        }, {"en": "zhongshan", "hk": "鐘山", "id": "101260805", "zh": "钟山"}],
        "en": "liupanshui",
        "hk": "六盤水",
        "id": "294",
        "zh": "六盘水"
    }, {
        "children": [{"en": "xingyi", "hk": "興義", "id": "101260901", "zh": "兴义"}, {
            "en": "qinglong",
            "hk": "晴隆",
            "id": "101260902",
            "zh": "晴隆"
        }, {"en": "xingren", "hk": "興仁", "id": "101260903", "zh": "兴仁"}, {
            "en": "zhenfeng",
            "hk": "貞豐",
            "id": "101260904",
            "zh": "贞丰"
        }, {"en": "wangmo", "hk": "望謨", "id": "101260905", "zh": "望谟"}, {
            "en": "anlong",
            "hk": "安龍",
            "id": "101260907",
            "zh": "安龙"
        }, {"en": "ceheng", "hk": "冊亨", "id": "101260908", "zh": "册亨"}, {
            "en": "puan",
            "hk": "普安",
            "id": "101260909",
            "zh": "普安"
        }, {"en": "qianxinan", "hk": "黔西南", "id": "101260906", "zh": "黔西南"}],
        "en": "qianxinan",
        "hk": "黔西南",
        "id": "295",
        "zh": "黔西南"
    }], "en": "guizhou", "hk": "貴州", "id": "286", "zh": "贵州"
}, {
    "children": [{
        "children": [{"en": "kunming", "hk": "昆明", "id": "101290101", "zh": "昆明"}, {
            "en": "dongchuan",
            "hk": "東川",
            "id": "101290103",
            "zh": "东川"
        }, {"en": "xundian", "hk": "尋甸", "id": "101290104", "zh": "寻甸"}, {
            "en": "jinning",
            "hk": "晉寧",
            "id": "101290105",
            "zh": "晋宁"
        }, {"en": "yiliang", "hk": "宜良", "id": "101290106", "zh": "宜良"}, {
            "en": "shilin",
            "hk": "石林",
            "id": "101290107",
            "zh": "石林"
        }, {"en": "chenggong", "hk": "呈貢", "id": "101290108", "zh": "呈贡"}, {
            "en": "fumin",
            "hk": "富民",
            "id": "101290109",
            "zh": "富民"
        }, {"en": "songming", "hk": "嵩明", "id": "101290110", "zh": "嵩明"}, {
            "en": "luquan",
            "hk": "祿勸",
            "id": "101290111",
            "zh": "禄劝"
        }, {"en": "anning", "hk": "安寧", "id": "101290112", "zh": "安宁"}, {
            "en": "wuhua",
            "hk": "五華",
            "id": "101290102",
            "zh": "五华"
        }, {"en": "panlong", "hk": "盤龍", "id": "101290114", "zh": "盘龙"}, {
            "en": "guandu",
            "hk": "官渡",
            "id": "101290115",
            "zh": "官渡"
        }, {"en": "xishan", "hk": "西山", "id": "101290116", "zh": "西山"}, {
            "en": "taihuashan",
            "hk": "太華山",
            "id": "101290113",
            "zh": "太华山"
        }], "en": "kunming", "hk": "昆明", "id": "297", "zh": "昆明"
    }, {
        "children": [{"en": "dali", "hk": "大理", "id": "101290201", "zh": "大理"}, {
            "en": "yunlong",
            "hk": "雲龍",
            "id": "101290202",
            "zh": "云龙"
        }, {"en": "yangbi", "hk": "漾濞", "id": "101290203", "zh": "漾濞"}, {
            "en": "yongping",
            "hk": "永平",
            "id": "101290204",
            "zh": "永平"
        }, {"en": "binchuan", "hk": "賓川", "id": "101290205", "zh": "宾川"}, {
            "en": "midu",
            "hk": "彌渡",
            "id": "101290206",
            "zh": "弥渡"
        }, {"en": "xiangyun", "hk": "祥雲", "id": "101290207", "zh": "祥云"}, {
            "en": "weishan",
            "hk": "巍山",
            "id": "101290208",
            "zh": "巍山"
        }, {"en": "jianchuan", "hk": "劍川", "id": "101290209", "zh": "剑川"}, {
            "en": "eryuan",
            "hk": "洱源",
            "id": "101290210",
            "zh": "洱源"
        }, {"en": "heqing", "hk": "鶴慶", "id": "101290211", "zh": "鹤庆"}, {
            "en": "nanjian",
            "hk": "南澗",
            "id": "101290212",
            "zh": "南涧"
        }], "en": "dali", "hk": "大理", "id": "298", "zh": "大理"
    }, {
        "children": [{"en": "honghe", "hk": "紅河", "id": "101290301", "zh": "红河"}, {
            "en": "shiping",
            "hk": "石屏",
            "id": "101290302",
            "zh": "石屏"
        }, {"en": "jianshui", "hk": "建水", "id": "101290303", "zh": "建水"}, {
            "en": "mile",
            "hk": "彌勒",
            "id": "101290304",
            "zh": "弥勒"
        }, {"en": "yuanyang", "hk": "元陽", "id": "101290305", "zh": "元阳"}, {
            "en": "lvchun",
            "hk": "綠春",
            "id": "101290306",
            "zh": "绿春"
        }, {"en": "kaiyuan", "hk": "開遠", "id": "101290307", "zh": "开远"}, {
            "en": "gejiu",
            "hk": "個舊",
            "id": "101290308",
            "zh": "个旧"
        }, {"en": "mengzi", "hk": "蒙自", "id": "101290309", "zh": "蒙自"}, {
            "en": "pingbian",
            "hk": "屏邊",
            "id": "101290310",
            "zh": "屏边"
        }, {"en": "luxi", "hk": "瀘西", "id": "101290311", "zh": "泸西"}, {
            "en": "jinping",
            "hk": "金平",
            "id": "101290312",
            "zh": "金平"
        }, {"en": "hekou", "hk": "河口", "id": "101290313", "zh": "河口"}],
        "en": "honghe",
        "hk": "紅河",
        "id": "299",
        "zh": "红河"
    }, {
        "children": [{"en": "qujing", "hk": "曲靖", "id": "101290401", "zh": "曲靖"}, {
            "en": "zhanyi",
            "hk": "沾益",
            "id": "101290402",
            "zh": "沾益"
        }, {"en": "luliang", "hk": "陸良", "id": "101290403", "zh": "陆良"}, {
            "en": "fuyuan",
            "hk": "富源",
            "id": "101290404",
            "zh": "富源"
        }, {"en": "malong", "hk": "馬龍", "id": "101290405", "zh": "马龙"}, {
            "en": "shizong",
            "hk": "師宗",
            "id": "101290406",
            "zh": "师宗"
        }, {"en": "luoping", "hk": "羅平", "id": "101290407", "zh": "罗平"}, {
            "en": "huize",
            "hk": "會澤",
            "id": "101290408",
            "zh": "会泽"
        }, {"en": "xuanwei", "hk": "宣威", "id": "101290409", "zh": "宣威"}, {
            "en": "qilin",
            "hk": "麒麟",
            "id": "101290410",
            "zh": "麒麟"
        }], "en": "qujing", "hk": "曲靖", "id": "300", "zh": "曲靖"
    }, {
        "children": [{"en": "baoshan", "hk": "保山", "id": "101290501", "zh": "保山"}, {
            "en": "longling",
            "hk": "龍陵",
            "id": "101290503",
            "zh": "龙陵"
        }, {"en": "sidian", "hk": "施甸", "id": "101290504", "zh": "施甸"}, {
            "en": "changning",
            "hk": "昌寧",
            "id": "101290505",
            "zh": "昌宁"
        }, {"en": "tengchong", "hk": "騰沖", "id": "101290506", "zh": "腾冲"}, {
            "en": "longyang",
            "hk": "隆陽",
            "id": "101290502",
            "zh": "隆阳"
        }], "en": "baoshan", "hk": "保山", "id": "301", "zh": "保山"
    }, {
        "children": [{"en": "wenshan", "hk": "文山", "id": "101290601", "zh": "文山"}, {
            "en": "xichou",
            "hk": "西疇",
            "id": "101290602",
            "zh": "西畴"
        }, {"en": "maguan", "hk": "馬關", "id": "101290603", "zh": "马关"}, {
            "en": "malipo",
            "hk": "麻栗坡",
            "id": "101290604",
            "zh": "麻栗坡"
        }, {"en": "yanshan", "hk": "硯山", "id": "101290605", "zh": "砚山"}, {
            "en": "qiubei",
            "hk": "丘北",
            "id": "101290606",
            "zh": "丘北"
        }, {"en": "guangnan", "hk": "廣南", "id": "101290607", "zh": "广南"}, {
            "en": "funing",
            "hk": "富寧",
            "id": "101290608",
            "zh": "富宁"
        }], "en": "wenshan", "hk": "文山", "id": "302", "zh": "文山"
    }, {
        "children": [{"en": "yuxi", "hk": "玉溪", "id": "101290701", "zh": "玉溪"}, {
            "en": "chengjiang",
            "hk": "澄江",
            "id": "101290702",
            "zh": "澄江"
        }, {"en": "jiangchuan", "hk": "江川", "id": "101290703", "zh": "江川"}, {
            "en": "tonghai",
            "hk": "通海",
            "id": "101290704",
            "zh": "通海"
        }, {"en": "huaning", "hk": "華寧", "id": "101290705", "zh": "华宁"}, {
            "en": "xinping",
            "hk": "新平",
            "id": "101290706",
            "zh": "新平"
        }, {"en": "yimen", "hk": "易門", "id": "101290707", "zh": "易门"}, {
            "en": "eshan",
            "hk": "峨山",
            "id": "101290708",
            "zh": "峨山"
        }, {"en": "yuanjiang", "hk": "元江", "id": "101290709", "zh": "元江"}, {
            "en": "hongta",
            "hk": "紅塔",
            "id": "101290710",
            "zh": "红塔"
        }], "en": "yuxi", "hk": "玉溪", "id": "303", "zh": "玉溪"
    }, {
        "children": [{"en": "chuxiong", "hk": "楚雄", "id": "101290801", "zh": "楚雄"}, {
            "en": "dayao",
            "hk": "大姚",
            "id": "101290802",
            "zh": "大姚"
        }, {"en": "yuanmou", "hk": "元謀", "id": "101290803", "zh": "元谋"}, {
            "en": "yaoan",
            "hk": "姚安",
            "id": "101290804",
            "zh": "姚安"
        }, {"en": "mouding", "hk": "牟定", "id": "101290805", "zh": "牟定"}, {
            "en": "nanhua",
            "hk": "南華",
            "id": "101290806",
            "zh": "南华"
        }, {"en": "wuding", "hk": "武定", "id": "101290807", "zh": "武定"}, {
            "en": "lufeng",
            "hk": "祿豐",
            "id": "101290808",
            "zh": "禄丰"
        }, {"en": "shuangbai", "hk": "雙柏", "id": "101290809", "zh": "双柏"}, {
            "en": "yongren",
            "hk": "永仁",
            "id": "101290810",
            "zh": "永仁"
        }], "en": "chuxiong", "hk": "楚雄", "id": "304", "zh": "楚雄"
    }, {
        "children": [{"en": "puer", "hk": "普洱", "id": "101290901", "zh": "普洱"}, {
            "en": "jinggu",
            "hk": "景谷",
            "id": "101290902",
            "zh": "景谷"
        }, {"en": "jingdong", "hk": "景東", "id": "101290903", "zh": "景东"}, {
            "en": "lancang",
            "hk": "瀾滄",
            "id": "101290904",
            "zh": "澜沧"
        }, {"en": "mojiang", "hk": "墨江", "id": "101290906", "zh": "墨江"}, {
            "en": "jiangcheng",
            "hk": "江城",
            "id": "101290907",
            "zh": "江城"
        }, {"en": "menglian", "hk": "孟連", "id": "101290908", "zh": "孟连"}, {
            "en": "ximeng",
            "hk": "西盟",
            "id": "101290909",
            "zh": "西盟"
        }, {"en": "zhenyuan", "hk": "鎮沅", "id": "101290911", "zh": "镇沅"}, {
            "en": "ninger",
            "hk": "寧洱",
            "id": "101290912",
            "zh": "宁洱"
        }, {"en": "simao", "hk": "思茅", "id": "101290905", "zh": "思茅"}],
        "en": "puer",
        "hk": "普洱",
        "id": "305",
        "zh": "普洱"
    }, {
        "children": [{"en": "zhaotong", "hk": "昭通", "id": "101291001", "zh": "昭通"}, {
            "en": "ludian",
            "hk": "魯甸",
            "id": "101291002",
            "zh": "鲁甸"
        }, {"en": "yiliang", "hk": "彝良", "id": "101291003", "zh": "彝良"}, {
            "en": "zhenxiong",
            "hk": "鎮雄",
            "id": "101291004",
            "zh": "镇雄"
        }, {"en": "weixin", "hk": "威信", "id": "101291005", "zh": "威信"}, {
            "en": "qiaojia",
            "hk": "巧家",
            "id": "101291006",
            "zh": "巧家"
        }, {"en": "suijiang", "hk": "綏江", "id": "101291007", "zh": "绥江"}, {
            "en": "yongshan",
            "hk": "永善",
            "id": "101291008",
            "zh": "永善"
        }, {"en": "yanjin", "hk": "鹽津", "id": "101291009", "zh": "盐津"}, {
            "en": "daguan",
            "hk": "大關",
            "id": "101291010",
            "zh": "大关"
        }, {"en": "shuifu", "hk": "水富", "id": "101291011", "zh": "水富"}, {
            "en": "zhaoyang",
            "hk": "昭陽",
            "id": "101291012",
            "zh": "昭阳"
        }], "en": "zhaotong", "hk": "昭通", "id": "306", "zh": "昭通"
    }, {
        "children": [{"en": "lincang", "hk": "臨滄", "id": "101291101", "zh": "临沧"}, {
            "en": "cangyuan",
            "hk": "滄源",
            "id": "101291102",
            "zh": "沧源"
        }, {"en": "gengma", "hk": "耿馬", "id": "101291103", "zh": "耿马"}, {
            "en": "shuangjiang",
            "hk": "雙江",
            "id": "101291104",
            "zh": "双江"
        }, {"en": "fengqing", "hk": "鳳慶", "id": "101291105", "zh": "凤庆"}, {
            "en": "yongde",
            "hk": "永德",
            "id": "101291106",
            "zh": "永德"
        }, {"en": "yunxian", "hk": "雲縣", "id": "101291107", "zh": "云县"}, {
            "en": "zhenkang",
            "hk": "鎮康",
            "id": "101291108",
            "zh": "镇康"
        }, {"en": "linxiang", "hk": "臨翔", "id": "101291109", "zh": "临翔"}],
        "en": "lincang",
        "hk": "臨滄",
        "id": "307",
        "zh": "临沧"
    }, {
        "children": [{"en": "nujiang", "hk": "怒江", "id": "101291201", "zh": "怒江"}, {
            "en": "fugong",
            "hk": "福貢",
            "id": "101291203",
            "zh": "福贡"
        }, {"en": "lanping", "hk": "蘭坪", "id": "101291204", "zh": "兰坪"}, {
            "en": "lushui",
            "hk": "瀘水",
            "id": "101291205",
            "zh": "泸水"
        }, {"en": "gongshan", "hk": "貢山", "id": "101291207", "zh": "贡山"}],
        "en": "nujiang",
        "hk": "怒江",
        "id": "308",
        "zh": "怒江"
    }, {
        "children": [{"en": "lijiang", "hk": "麗江", "id": "101291401", "zh": "丽江"}, {
            "en": "yongsheng",
            "hk": "永勝",
            "id": "101291402",
            "zh": "永胜"
        }, {"en": "huaping", "hk": "華坪", "id": "101291403", "zh": "华坪"}, {
            "en": "ninglang",
            "hk": "寧蒗",
            "id": "101291404",
            "zh": "宁蒗"
        }, {"en": "gucheng", "hk": "古城", "id": "101291405", "zh": "古城"}, {
            "en": "yulong",
            "hk": "玉龍",
            "id": "101291406",
            "zh": "玉龙"
        }], "en": "lijiang", "hk": "麗江", "id": "309", "zh": "丽江"
    }, {
        "children": [{"en": "dehong", "hk": "德宏", "id": "101291501", "zh": "德宏"}, {
            "en": "longchuan",
            "hk": "隴川",
            "id": "101291503",
            "zh": "陇川"
        }, {"en": "yingjiang", "hk": "盈江", "id": "101291504", "zh": "盈江"}, {
            "en": "ruili",
            "hk": "瑞麗",
            "id": "101291506",
            "zh": "瑞丽"
        }, {"en": "lianghe", "hk": "梁河", "id": "101291507", "zh": "梁河"}, {
            "en": "mangshi",
            "hk": "芒市",
            "id": "101291508",
            "zh": "芒市"
        }], "en": "dehong", "hk": "德宏", "id": "310", "zh": "德宏"
    }, {
        "children": [{"en": "xianggelila", "hk": "香格里拉", "id": "101291301", "zh": "香格里拉"}, {
            "en": "deqin",
            "hk": "德欽",
            "id": "101291302",
            "zh": "德钦"
        }, {"en": "weixi", "hk": "維西", "id": "101291303", "zh": "维西"}, {
            "en": "diqing",
            "hk": "迪慶",
            "id": "101291305",
            "zh": "迪庆"
        }], "en": "diqing", "hk": "迪慶", "id": "311", "zh": "迪庆"
    }, {
        "children": [{"en": "jinghong", "hk": "景洪", "id": "101291601", "zh": "景洪"}, {
            "en": "menghai",
            "hk": "勐海",
            "id": "101291603",
            "zh": "勐海"
        }, {"en": "mengla", "hk": "勐臘", "id": "101291605", "zh": "勐腊"}, {
            "en": "xishuangbanna",
            "hk": "西雙版納",
            "id": "101291602",
            "zh": "西双版纳"
        }], "en": "xishuangbanna", "hk": "西雙版納", "id": "312", "zh": "西双版纳"
    }], "en": "yunnan", "hk": "雲南", "id": "296", "zh": "云南"
}, {
    "children": [{
        "children": [{"en": "chengdu", "hk": "成都", "id": "101270101", "zh": "成都"}, {
            "en": "longquanyi",
            "hk": "龍泉驛",
            "id": "101270102",
            "zh": "龙泉驿"
        }, {"en": "xindu", "hk": "新都", "id": "101270103", "zh": "新都"}, {
            "en": "wenjiang",
            "hk": "溫江",
            "id": "101270104",
            "zh": "温江"
        }, {"en": "jintang", "hk": "金堂", "id": "101270105", "zh": "金堂"}, {
            "en": "shuangliu",
            "hk": "雙流",
            "id": "101270106",
            "zh": "双流"
        }, {"en": "pidu", "hk": "郫都", "id": "101270107", "zh": "郫都"}, {
            "en": "dayi",
            "hk": "大邑",
            "id": "101270108",
            "zh": "大邑"
        }, {"en": "pujiang", "hk": "蒲江", "id": "101270109", "zh": "蒲江"}, {
            "en": "xinjin",
            "hk": "新津",
            "id": "101270110",
            "zh": "新津"
        }, {"en": "dujiangyan", "hk": "都江堰", "id": "101270111", "zh": "都江堰"}, {
            "en": "pengzhou",
            "hk": "彭州",
            "id": "101270112",
            "zh": "彭州"
        }, {"en": "qionglai", "hk": "邛崍", "id": "101270113", "zh": "邛崃"}, {
            "en": "chongzhou",
            "hk": "崇州",
            "id": "101270114",
            "zh": "崇州"
        }, {"en": "qingbaijiang", "hk": "青白江", "id": "101270115", "zh": "青白江"}, {
            "en": "jianyang",
            "hk": "簡陽",
            "id": "101270121",
            "zh": "简阳"
        }, {"en": "jinjiang", "hk": "錦江", "id": "101270116", "zh": "锦江"}, {
            "en": "qingyang",
            "hk": "青羊",
            "id": "101270117",
            "zh": "青羊"
        }, {"en": "jinniu", "hk": "金牛", "id": "101270118", "zh": "金牛"}, {
            "en": "wuhou",
            "hk": "武侯",
            "id": "101270119",
            "zh": "武侯"
        }, {"en": "chenghua", "hk": "成華", "id": "101270120", "zh": "成华"}],
        "en": "chengdu",
        "hk": "成都",
        "id": "314",
        "zh": "成都"
    }, {
        "children": [{"en": "panzhihua", "hk": "攀枝花", "id": "101270201", "zh": "攀枝花"}, {
            "en": "renhe",
            "hk": "仁和",
            "id": "101270202",
            "zh": "仁和"
        }, {"en": "miyi", "hk": "米易", "id": "101270203", "zh": "米易"}, {
            "en": "yanbian",
            "hk": "鹽邊",
            "id": "101270204",
            "zh": "盐边"
        }, {"en": "dongqu", "hk": "東區", "id": "101270205", "zh": "东区"}, {
            "en": "xiqu",
            "hk": "西區",
            "id": "101270206",
            "zh": "西区"
        }], "en": "panzhihua", "hk": "攀枝花", "id": "315", "zh": "攀枝花"
    }, {
        "children": [{"en": "zigong", "hk": "自貢", "id": "101270301", "zh": "自贡"}, {
            "en": "fushun",
            "hk": "富順",
            "id": "101270302",
            "zh": "富顺"
        }, {"en": "rongxian", "hk": "榮縣", "id": "101270303", "zh": "荣县"}, {
            "en": "ziliujing",
            "hk": "自流井",
            "id": "101270304",
            "zh": "自流井"
        }, {"en": "gongjing", "hk": "貢井", "id": "101270305", "zh": "贡井"}, {
            "en": "daan",
            "hk": "大安",
            "id": "101270306",
            "zh": "大安"
        }, {"en": "yantan", "hk": "沿灘", "id": "101270307", "zh": "沿滩"}],
        "en": "zigong",
        "hk": "自貢",
        "id": "316",
        "zh": "自贡"
    }, {
        "children": [{"en": "mianyang", "hk": "綿陽", "id": "101270401", "zh": "绵阳"}, {
            "en": "santai",
            "hk": "三台",
            "id": "101270402",
            "zh": "三台"
        }, {"en": "yanting", "hk": "鹽亭", "id": "101270403", "zh": "盐亭"}, {
            "en": "zitong",
            "hk": "梓潼",
            "id": "101270405",
            "zh": "梓潼"
        }, {"en": "beichuan", "hk": "北川", "id": "101270406", "zh": "北川"}, {
            "en": "pingwu",
            "hk": "平武",
            "id": "101270407",
            "zh": "平武"
        }, {"en": "jiangyou", "hk": "江油", "id": "101270408", "zh": "江油"}, {
            "en": "fucheng",
            "hk": "涪城",
            "id": "101270409",
            "zh": "涪城"
        }, {"en": "youxian", "hk": "遊仙", "id": "101270410", "zh": "游仙"}, {
            "en": "anzhou",
            "hk": "安州",
            "id": "101270411",
            "zh": "安州"
        }], "en": "mianyang", "hk": "綿陽", "id": "317", "zh": "绵阳"
    }, {
        "children": [{"en": "nanchong", "hk": "南充", "id": "101270501", "zh": "南充"}, {
            "en": "nanbu",
            "hk": "南部",
            "id": "101270502",
            "zh": "南部"
        }, {"en": "yingshan", "hk": "營山", "id": "101270503", "zh": "营山"}, {
            "en": "pengan",
            "hk": "蓬安",
            "id": "101270504",
            "zh": "蓬安"
        }, {"en": "yilong", "hk": "儀隴", "id": "101270505", "zh": "仪陇"}, {
            "en": "xichong",
            "hk": "西充",
            "id": "101270506",
            "zh": "西充"
        }, {"en": "langzhong", "hk": "閬中", "id": "101270507", "zh": "阆中"}, {
            "en": "shunqing",
            "hk": "順慶",
            "id": "101270508",
            "zh": "顺庆"
        }, {"en": "gaoping", "hk": "高坪", "id": "101270509", "zh": "高坪"}, {
            "en": "jialing",
            "hk": "嘉陵",
            "id": "101270510",
            "zh": "嘉陵"
        }], "en": "nanchong", "hk": "南充", "id": "318", "zh": "南充"
    }, {
        "children": [{"en": "dazhou", "hk": "達州", "id": "101270601", "zh": "达州"}, {
            "en": "xuanhan",
            "hk": "宣漢",
            "id": "101270602",
            "zh": "宣汉"
        }, {"en": "kaijiang", "hk": "開江", "id": "101270603", "zh": "开江"}, {
            "en": "dazhu",
            "hk": "大竹",
            "id": "101270604",
            "zh": "大竹"
        }, {"en": "quxian", "hk": "渠縣", "id": "101270605", "zh": "渠县"}, {
            "en": "wanyuan",
            "hk": "萬源",
            "id": "101270606",
            "zh": "万源"
        }, {"en": "tongchuan", "hk": "通川", "id": "101270607", "zh": "通川"}, {
            "en": "dachuan",
            "hk": "達川",
            "id": "101270608",
            "zh": "达川"
        }], "en": "dazhou", "hk": "達州", "id": "319", "zh": "达州"
    }, {
        "children": [{"en": "suining", "hk": "遂寧", "id": "101270701", "zh": "遂宁"}, {
            "en": "pengxi",
            "hk": "蓬溪",
            "id": "101270702",
            "zh": "蓬溪"
        }, {"en": "shehong", "hk": "射洪", "id": "101270703", "zh": "射洪"}, {
            "en": "chuanshan",
            "hk": "船山",
            "id": "101270704",
            "zh": "船山"
        }, {"en": "anju", "hk": "安居", "id": "101270705", "zh": "安居"}, {
            "en": "daying",
            "hk": "大英",
            "id": "101270706",
            "zh": "大英"
        }], "en": "suining", "hk": "遂寧", "id": "320", "zh": "遂宁"
    }, {
        "children": [{"en": "guangan", "hk": "廣安", "id": "101270801", "zh": "广安"}, {
            "en": "yuechi",
            "hk": "岳池",
            "id": "101270802",
            "zh": "岳池"
        }, {"en": "wusheng", "hk": "武勝", "id": "101270803", "zh": "武胜"}, {
            "en": "linshui",
            "hk": "鄰水",
            "id": "101270804",
            "zh": "邻水"
        }, {"en": "huaying", "hk": "華鎣", "id": "101270805", "zh": "华蓥"}, {
            "en": "qianfeng",
            "hk": "前鋒",
            "id": "101270806",
            "zh": "前锋"
        }], "en": "guangan", "hk": "廣安", "id": "321", "zh": "广安"
    }, {
        "children": [{"en": "bazhong", "hk": "巴中", "id": "101270901", "zh": "巴中"}, {
            "en": "tongjiang",
            "hk": "通江",
            "id": "101270902",
            "zh": "通江"
        }, {"en": "nanjiang", "hk": "南江", "id": "101270903", "zh": "南江"}, {
            "en": "pingchang",
            "hk": "平昌",
            "id": "101270904",
            "zh": "平昌"
        }, {"en": "bazhou", "hk": "巴州", "id": "101270905", "zh": "巴州"}, {
            "en": "enyang",
            "hk": "恩陽",
            "id": "101270906",
            "zh": "恩阳"
        }], "en": "bazhong", "hk": "巴中", "id": "322", "zh": "巴中"
    }, {
        "children": [{"en": "luzhou", "hk": "瀘州", "id": "101271001", "zh": "泸州"}, {
            "en": "luxian",
            "hk": "瀘縣",
            "id": "101271003",
            "zh": "泸县"
        }, {"en": "hejiang", "hk": "合江", "id": "101271004", "zh": "合江"}, {
            "en": "xuyong",
            "hk": "敘永",
            "id": "101271005",
            "zh": "叙永"
        }, {"en": "gulin", "hk": "古藺", "id": "101271006", "zh": "古蔺"}, {
            "en": "naxi",
            "hk": "納溪",
            "id": "101271007",
            "zh": "纳溪"
        }, {"en": "jiangyang", "hk": "江陽", "id": "101271002", "zh": "江阳"}, {
            "en": "longmatan",
            "hk": "龍馬潭",
            "id": "101271008",
            "zh": "龙马潭"
        }], "en": "luzhou", "hk": "瀘州", "id": "323", "zh": "泸州"
    }, {
        "children": [{"en": "yibin", "hk": "宜賓", "id": "101271101", "zh": "宜宾"}, {
            "en": "yibinxian",
            "hk": "宜賓縣",
            "id": "101271103",
            "zh": "宜宾县"
        }, {"en": "nanxi", "hk": "南溪", "id": "101271104", "zh": "南溪"}, {
            "en": "jiangan",
            "hk": "江安",
            "id": "101271105",
            "zh": "江安"
        }, {"en": "changning", "hk": "長寧", "id": "101271106", "zh": "长宁"}, {
            "en": "gaoxian",
            "hk": "高縣",
            "id": "101271107",
            "zh": "高县"
        }, {"en": "gongxian", "hk": "珙縣", "id": "101271108", "zh": "珙县"}, {
            "en": "junlian",
            "hk": "筠連",
            "id": "101271109",
            "zh": "筠连"
        }, {"en": "xingwen", "hk": "興文", "id": "101271110", "zh": "兴文"}, {
            "en": "pingshan",
            "hk": "屏山",
            "id": "101271111",
            "zh": "屏山"
        }, {"en": "cuiping", "hk": "翠屏", "id": "101271102", "zh": "翠屏"}],
        "en": "yibin",
        "hk": "宜賓",
        "id": "324",
        "zh": "宜宾"
    }, {
        "children": [{"en": "neijiang", "hk": "內江", "id": "101271201", "zh": "内江"}, {
            "en": "dongxing",
            "hk": "東興",
            "id": "101271202",
            "zh": "东兴"
        }, {"en": "weiyuan", "hk": "威遠", "id": "101271203", "zh": "威远"}, {
            "en": "zizhong",
            "hk": "資中",
            "id": "101271204",
            "zh": "资中"
        }, {"en": "longchang", "hk": "隆昌", "id": "101271205", "zh": "隆昌"}, {
            "en": "shizhong",
            "hk": "市中",
            "id": "101271206",
            "zh": "市中"
        }], "en": "neijiang", "hk": "內江", "id": "325", "zh": "内江"
    }, {
        "children": [{"en": "ziyang", "hk": "資陽", "id": "101271301", "zh": "资阳"}, {
            "en": "anyue",
            "hk": "安岳",
            "id": "101271302",
            "zh": "安岳"
        }, {"en": "lezhi", "hk": "樂至", "id": "101271303", "zh": "乐至"}, {
            "en": "yanjiang",
            "hk": "雁江",
            "id": "101271305",
            "zh": "雁江"
        }], "en": "ziyang", "hk": "資陽", "id": "326", "zh": "资阳"
    }, {
        "children": [{"en": "leshan", "hk": "樂山", "id": "101271401", "zh": "乐山"}, {
            "en": "qianwei",
            "hk": "犍為",
            "id": "101271402",
            "zh": "犍为"
        }, {"en": "jingyan", "hk": "井研", "id": "101271403", "zh": "井研"}, {
            "en": "jiajiang",
            "hk": "夾江",
            "id": "101271404",
            "zh": "夹江"
        }, {"en": "muchuan", "hk": "沐川", "id": "101271405", "zh": "沐川"}, {
            "en": "ebian",
            "hk": "峨邊",
            "id": "101271406",
            "zh": "峨边"
        }, {"en": "mabian", "hk": "馬邊", "id": "101271407", "zh": "马边"}, {
            "en": "emeishan",
            "hk": "峨眉山",
            "id": "101271409",
            "zh": "峨眉山"
        }, {"en": "shizhong", "hk": "市中", "id": "101271410", "zh": "市中"}, {
            "en": "shawan",
            "hk": "沙灣",
            "id": "101271411",
            "zh": "沙湾"
        }, {"en": "wutongqiao", "hk": "五通橋", "id": "101271412", "zh": "五通桥"}, {
            "en": "jinkouhe",
            "hk": "金口河",
            "id": "101271413",
            "zh": "金口河"
        }, {"en": "emeishanshi", "hk": "峨眉山市", "id": "101271414", "zh": "峨眉山市"}],
        "en": "leshan",
        "hk": "樂山",
        "id": "327",
        "zh": "乐山"
    }, {
        "children": [{"en": "meishan", "hk": "眉山", "id": "101271501", "zh": "眉山"}, {
            "en": "renshou",
            "hk": "仁壽",
            "id": "101271502",
            "zh": "仁寿"
        }, {"en": "pengshan", "hk": "彭山", "id": "101271503", "zh": "彭山"}, {
            "en": "hongya",
            "hk": "洪雅",
            "id": "101271504",
            "zh": "洪雅"
        }, {"en": "danleng", "hk": "丹棱", "id": "101271505", "zh": "丹棱"}, {
            "en": "qingshen",
            "hk": "青神",
            "id": "101271506",
            "zh": "青神"
        }, {"en": "dongpo", "hk": "東坡", "id": "101271507", "zh": "东坡"}],
        "en": "meishan",
        "hk": "眉山",
        "id": "328",
        "zh": "眉山"
    }, {
        "children": [{"en": "liangshan", "hk": "涼山", "id": "101271601", "zh": "凉山"}, {
            "en": "muli",
            "hk": "木里",
            "id": "101271603",
            "zh": "木里"
        }, {"en": "yanyuan", "hk": "鹽源", "id": "101271604", "zh": "盐源"}, {
            "en": "dechang",
            "hk": "德昌",
            "id": "101271605",
            "zh": "德昌"
        }, {"en": "huili", "hk": "會理", "id": "101271606", "zh": "会理"}, {
            "en": "huidong",
            "hk": "會東",
            "id": "101271607",
            "zh": "会东"
        }, {"en": "ningnan", "hk": "寧南", "id": "101271608", "zh": "宁南"}, {
            "en": "puge",
            "hk": "普格",
            "id": "101271609",
            "zh": "普格"
        }, {"en": "xichang", "hk": "西昌", "id": "101271610", "zh": "西昌"}, {
            "en": "jinyang",
            "hk": "金陽",
            "id": "101271611",
            "zh": "金阳"
        }, {"en": "zhaojue", "hk": "昭覺", "id": "101271612", "zh": "昭觉"}, {
            "en": "xide",
            "hk": "喜德",
            "id": "101271613",
            "zh": "喜德"
        }, {"en": "mianning", "hk": "冕寧", "id": "101271614", "zh": "冕宁"}, {
            "en": "yuexi",
            "hk": "越西",
            "id": "101271615",
            "zh": "越西"
        }, {"en": "ganluo", "hk": "甘洛", "id": "101271616", "zh": "甘洛"}, {
            "en": "leibo",
            "hk": "雷波",
            "id": "101271617",
            "zh": "雷波"
        }, {"en": "meigu", "hk": "美姑", "id": "101271618", "zh": "美姑"}, {
            "en": "butuo",
            "hk": "布拖",
            "id": "101271619",
            "zh": "布拖"
        }], "en": "liangshan", "hk": "涼山", "id": "329", "zh": "凉山"
    }, {
        "children": [{"en": "yaan", "hk": "雅安", "id": "101271701", "zh": "雅安"}, {
            "en": "mingshan",
            "hk": "名山",
            "id": "101271702",
            "zh": "名山"
        }, {"en": "yingjing", "hk": "滎經", "id": "101271703", "zh": "荥经"}, {
            "en": "hanyuan",
            "hk": "漢源",
            "id": "101271704",
            "zh": "汉源"
        }, {"en": "shimian", "hk": "石棉", "id": "101271705", "zh": "石棉"}, {
            "en": "tianquan",
            "hk": "天全",
            "id": "101271706",
            "zh": "天全"
        }, {"en": "lushan", "hk": "蘆山", "id": "101271707", "zh": "芦山"}, {
            "en": "baoxing",
            "hk": "寶興",
            "id": "101271708",
            "zh": "宝兴"
        }, {"en": "yucheng", "hk": "雨城", "id": "101271709", "zh": "雨城"}],
        "en": "yaan",
        "hk": "雅安",
        "id": "330",
        "zh": "雅安"
    }, {
        "children": [{"en": "ganzi", "hk": "甘孜", "id": "101271801", "zh": "甘孜"}, {
            "en": "kangding",
            "hk": "康定",
            "id": "101271802",
            "zh": "康定"
        }, {"en": "luding", "hk": "瀘定", "id": "101271803", "zh": "泸定"}, {
            "en": "danba",
            "hk": "丹巴",
            "id": "101271804",
            "zh": "丹巴"
        }, {"en": "jiulong", "hk": "九龍", "id": "101271805", "zh": "九龙"}, {
            "en": "yajiang",
            "hk": "雅江",
            "id": "101271806",
            "zh": "雅江"
        }, {"en": "daofu", "hk": "道孚", "id": "101271807", "zh": "道孚"}, {
            "en": "luhuo",
            "hk": "爐霍",
            "id": "101271808",
            "zh": "炉霍"
        }, {"en": "xinlong", "hk": "新龍", "id": "101271809", "zh": "新龙"}, {
            "en": "dege",
            "hk": "德格",
            "id": "101271810",
            "zh": "德格"
        }, {"en": "baiyu", "hk": "白玉", "id": "101271811", "zh": "白玉"}, {
            "en": "shiqu",
            "hk": "石渠",
            "id": "101271812",
            "zh": "石渠"
        }, {"en": "seda", "hk": "色達", "id": "101271813", "zh": "色达"}, {
            "en": "litang",
            "hk": "理塘",
            "id": "101271814",
            "zh": "理塘"
        }, {"en": "batang", "hk": "巴塘", "id": "101271815", "zh": "巴塘"}, {
            "en": "xiangcheng",
            "hk": "鄉城",
            "id": "101271816",
            "zh": "乡城"
        }, {"en": "daocheng", "hk": "稻城", "id": "101271817", "zh": "稻城"}, {
            "en": "derong",
            "hk": "得榮",
            "id": "101271818",
            "zh": "得荣"
        }], "en": "ganzi", "hk": "甘孜", "id": "331", "zh": "甘孜"
    }, {
        "children": [{"en": "aba", "hk": "阿壩", "id": "101271901", "zh": "阿坝"}, {
            "en": "wenchuan",
            "hk": "汶川",
            "id": "101271902",
            "zh": "汶川"
        }, {"en": "lixian", "hk": "理縣", "id": "101271903", "zh": "理县"}, {
            "en": "maoxian",
            "hk": "茂縣",
            "id": "101271904",
            "zh": "茂县"
        }, {"en": "songfan", "hk": "松潘", "id": "101271905", "zh": "松潘"}, {
            "en": "jiuzhaigou",
            "hk": "九寨溝",
            "id": "101271906",
            "zh": "九寨沟"
        }, {"en": "jinchuan", "hk": "金川", "id": "101271907", "zh": "金川"}, {
            "en": "xiaojin",
            "hk": "小金",
            "id": "101271908",
            "zh": "小金"
        }, {"en": "heishui", "hk": "黑水", "id": "101271909", "zh": "黑水"}, {
            "en": "maerkang",
            "hk": "馬爾康",
            "id": "101271910",
            "zh": "马尔康"
        }, {"en": "rangtang", "hk": "壤塘", "id": "101271911", "zh": "壤塘"}, {
            "en": "nuoergai",
            "hk": "若爾蓋",
            "id": "101271912",
            "zh": "若尔盖"
        }, {"en": "hongyuan", "hk": "紅原", "id": "101271913", "zh": "红原"}],
        "en": "aba",
        "hk": "阿壩",
        "id": "332",
        "zh": "阿坝"
    }, {
        "children": [{"en": "deyang", "hk": "德陽", "id": "101272001", "zh": "德阳"}, {
            "en": "zhongjiang",
            "hk": "中江",
            "id": "101272002",
            "zh": "中江"
        }, {"en": "guanghan", "hk": "廣漢", "id": "101272003", "zh": "广汉"}, {
            "en": "shifang",
            "hk": "什邡",
            "id": "101272004",
            "zh": "什邡"
        }, {"en": "mianzhu", "hk": "綿竹", "id": "101272005", "zh": "绵竹"}, {
            "en": "luojiang",
            "hk": "羅江",
            "id": "101272006",
            "zh": "罗江"
        }, {"en": "jingyang", "hk": "旌陽", "id": "101272007", "zh": "旌阳"}],
        "en": "deyang",
        "hk": "德陽",
        "id": "333",
        "zh": "德阳"
    }, {
        "children": [{"en": "guangyuan", "hk": "廣元", "id": "101272101", "zh": "广元"}, {
            "en": "wangcang",
            "hk": "旺蒼",
            "id": "101272102",
            "zh": "旺苍"
        }, {"en": "qingchuan", "hk": "青川", "id": "101272103", "zh": "青川"}, {
            "en": "jiange",
            "hk": "劍閣",
            "id": "101272104",
            "zh": "剑阁"
        }, {"en": "cangxi", "hk": "蒼溪", "id": "101272105", "zh": "苍溪"}, {
            "en": "lizhou",
            "hk": "利州",
            "id": "101272106",
            "zh": "利州"
        }, {"en": "zhaohua", "hk": "昭化", "id": "101272107", "zh": "昭化"}, {
            "en": "chaotian",
            "hk": "朝天",
            "id": "101272108",
            "zh": "朝天"
        }], "en": "guangyuan", "hk": "廣元", "id": "334", "zh": "广元"
    }], "en": "sichuan", "hk": "四川", "id": "313", "zh": "四川"
}, {
    "children": [{
        "children": [{"en": "lasa", "hk": "拉薩", "id": "101140101", "zh": "拉萨"}, {
            "en": "dangxiong",
            "hk": "當雄",
            "id": "101140102",
            "zh": "当雄"
        }, {"en": "nimu", "hk": "尼木", "id": "101140103", "zh": "尼木"}, {
            "en": "linzhou",
            "hk": "林周",
            "id": "101140104",
            "zh": "林周"
        }, {"en": "duilongdeqing", "hk": "堆龍德慶", "id": "101140105", "zh": "堆龙德庆"}, {
            "en": "qushui",
            "hk": "曲水",
            "id": "101140106",
            "zh": "曲水"
        }, {"en": "dazi", "hk": "達孜", "id": "101140107", "zh": "达孜"}, {
            "en": "mozhugongka",
            "hk": "墨竹工卡",
            "id": "101140108",
            "zh": "墨竹工卡"
        }, {"en": "chengguan", "hk": "城關", "id": "101140109", "zh": "城关"}],
        "en": "lasa",
        "hk": "拉薩",
        "id": "336",
        "zh": "拉萨"
    }, {
        "children": [{"en": "rikaze", "hk": "日喀則", "id": "101140201", "zh": "日喀则"}, {
            "en": "lazi",
            "hk": "拉孜",
            "id": "101140202",
            "zh": "拉孜"
        }, {"en": "nanmulin", "hk": "南木林", "id": "101140203", "zh": "南木林"}, {
            "en": "nielamu",
            "hk": "聶拉木",
            "id": "101140204",
            "zh": "聂拉木"
        }, {"en": "anri", "hk": "定日", "id": "101140205", "zh": "定日"}, {
            "en": "jiangzi",
            "hk": "江孜",
            "id": "101140206",
            "zh": "江孜"
        }, {"en": "zhongba", "hk": "仲巴", "id": "101140208", "zh": "仲巴"}, {
            "en": "saga",
            "hk": "薩嘎",
            "id": "101140209",
            "zh": "萨嘎"
        }, {"en": "jilong", "hk": "吉隆", "id": "101140210", "zh": "吉隆"}, {
            "en": "angren",
            "hk": "昂仁",
            "id": "101140211",
            "zh": "昂仁"
        }, {"en": "dingjie", "hk": "定結", "id": "101140212", "zh": "定结"}, {
            "en": "sajia",
            "hk": "薩迦",
            "id": "101140213",
            "zh": "萨迦"
        }, {"en": "xietongmen", "hk": "謝通門", "id": "101140214", "zh": "谢通门"}, {
            "en": "gangba",
            "hk": "崗巴",
            "id": "101140216",
            "zh": "岗巴"
        }, {"en": "bailang", "hk": "白朗", "id": "101140217", "zh": "白朗"}, {
            "en": "yadong",
            "hk": "亞東",
            "id": "101140218",
            "zh": "亚东"
        }, {"en": "kangma", "hk": "康馬", "id": "101140219", "zh": "康马"}, {
            "en": "renbu",
            "hk": "仁布",
            "id": "101140220",
            "zh": "仁布"
        }, {"en": "sangzhuzi", "hk": "桑珠孜", "id": "101140215", "zh": "桑珠孜"}, {
            "en": "pali",
            "hk": "帕裡",
            "id": "101140207",
            "zh": "帕里"
        }], "en": "rikaze", "hk": "日喀則", "id": "337", "zh": "日喀则"
    }, {
        "children": [{"en": "shannan", "hk": "山南", "id": "101140301", "zh": "山南"}, {
            "en": "gongga",
            "hk": "貢嘎",
            "id": "101140302",
            "zh": "贡嘎"
        }, {"en": "zhanang", "hk": "扎囊", "id": "101140303", "zh": "扎囊"}, {
            "en": "jiacha",
            "hk": "加查",
            "id": "101140304",
            "zh": "加查"
        }, {"en": "langkazi", "hk": "浪卡子", "id": "101140305", "zh": "浪卡子"}, {
            "en": "cuona",
            "hk": "錯那",
            "id": "101140306",
            "zh": "错那"
        }, {"en": "longzi", "hk": "隆子", "id": "101140307", "zh": "隆子"}, {
            "en": "naidong",
            "hk": "乃東",
            "id": "101140309",
            "zh": "乃东"
        }, {"en": "sangri", "hk": "桑日", "id": "101140310", "zh": "桑日"}, {
            "en": "luozha",
            "hk": "洛扎",
            "id": "101140311",
            "zh": "洛扎"
        }, {"en": "cuomei", "hk": "措美", "id": "101140312", "zh": "措美"}, {
            "en": "qiongjie",
            "hk": "瓊結",
            "id": "101140313",
            "zh": "琼结"
        }, {"en": "qusong", "hk": "曲松", "id": "101140314", "zh": "曲松"}, {
            "en": "zedang",
            "hk": "澤當",
            "id": "101140308",
            "zh": "泽当"
        }], "en": "shannan", "hk": "山南", "id": "338", "zh": "山南"
    }, {
        "children": [{"en": "linzhi", "hk": "林芝", "id": "101140401", "zh": "林芝"}, {
            "en": "bomi",
            "hk": "波密",
            "id": "101140402",
            "zh": "波密"
        }, {"en": "milin", "hk": "米林", "id": "101140403", "zh": "米林"}, {
            "en": "chayu",
            "hk": "察隅",
            "id": "101140404",
            "zh": "察隅"
        }, {"en": "gongbujiangda", "hk": "工布江達", "id": "101140405", "zh": "工布江达"}, {
            "en": "langxian",
            "hk": "朗縣",
            "id": "101140406",
            "zh": "朗县"
        }, {"en": "motuo", "hk": "墨脫", "id": "101140407", "zh": "墨脱"}, {
            "en": "bayi",
            "hk": "巴宜",
            "id": "101140408",
            "zh": "巴宜"
        }], "en": "linzi", "hk": "林芝", "id": "339", "zh": "林芝"
    }, {
        "children": [{"en": "changdu", "hk": "昌都", "id": "101140501", "zh": "昌都"}, {
            "en": "dingqing",
            "hk": "丁青",
            "id": "101140502",
            "zh": "丁青"
        }, {"en": "bianba", "hk": "邊壩", "id": "101140503", "zh": "边坝"}, {
            "en": "luolong",
            "hk": "洛隆",
            "id": "101140504",
            "zh": "洛隆"
        }, {"en": "zuogong", "hk": "左貢", "id": "101140505", "zh": "左贡"}, {
            "en": "mangkang",
            "hk": "芒康",
            "id": "101140506",
            "zh": "芒康"
        }, {"en": "leiwuqi", "hk": "類烏齊", "id": "101140507", "zh": "类乌齐"}, {
            "en": "basu",
            "hk": "八宿",
            "id": "101140508",
            "zh": "八宿"
        }, {"en": "jiangda", "hk": "江達", "id": "101140509", "zh": "江达"}, {
            "en": "chaya",
            "hk": "察雅",
            "id": "101140510",
            "zh": "察雅"
        }, {"en": "gongjue", "hk": "貢覺", "id": "101140511", "zh": "贡觉"}, {
            "en": "karuo",
            "hk": "卡若",
            "id": "101140512",
            "zh": "卡若"
        }], "en": "changdu", "hk": "昌都", "id": "340", "zh": "昌都"
    }, {
        "children": [{"en": "naqu", "hk": "那曲", "id": "101140601", "zh": "那曲"}, {
            "en": "nima",
            "hk": "尼瑪",
            "id": "101140602",
            "zh": "尼玛"
        }, {"en": "jiali", "hk": "嘉黎", "id": "101140603", "zh": "嘉黎"}, {
            "en": "bange",
            "hk": "班戈",
            "id": "101140604",
            "zh": "班戈"
        }, {"en": "anduo", "hk": "安多", "id": "101140605", "zh": "安多"}, {
            "en": "suoxian",
            "hk": "索縣",
            "id": "101140606",
            "zh": "索县"
        }, {"en": "nierong", "hk": "聶榮", "id": "101140607", "zh": "聂荣"}, {
            "en": "baqing",
            "hk": "巴青",
            "id": "101140608",
            "zh": "巴青"
        }, {"en": "biru", "hk": "比如", "id": "101140609", "zh": "比如"}, {
            "en": "shuanghu",
            "hk": "雙湖",
            "id": "101140610",
            "zh": "双湖"
        }, {"en": "shenzha", "hk": "申扎", "id": "101140611", "zh": "申扎"}, {
            "en": "seni",
            "hk": "色尼",
            "id": "101140612",
            "zh": "色尼"
        }], "en": "naqu", "hk": "那曲", "id": "341", "zh": "那曲"
    }, {
        "children": [{"en": "ali", "hk": "阿里", "id": "101140701", "zh": "阿里"}, {
            "en": "gaize",
            "hk": "改則",
            "id": "101140702",
            "zh": "改则"
        }, {"en": "pulan", "hk": "普蘭", "id": "101140705", "zh": "普兰"}, {
            "en": "zhada",
            "hk": "札達",
            "id": "101140706",
            "zh": "札达"
        }, {"en": "gaer", "hk": "噶爾", "id": "101140707", "zh": "噶尔"}, {
            "en": "ritu",
            "hk": "日土",
            "id": "101140708",
            "zh": "日土"
        }, {"en": "geji", "hk": "革吉", "id": "101140709", "zh": "革吉"}, {
            "en": "cuoqin",
            "hk": "措勤",
            "id": "101140710",
            "zh": "措勤"
        }, {"en": "shiquanhe", "hk": "獅泉河", "id": "101140704", "zh": "狮泉河"}],
        "en": "ali",
        "hk": "阿里",
        "id": "342",
        "zh": "阿里"
    }], "en": "xizang", "hk": "西藏", "id": "335", "zh": "西藏"
}, {
    "children": [{
        "children": [{"en": "xian", "hk": "西安", "id": "101110101", "zh": "西安"}, {
            "en": "changan",
            "hk": "長安",
            "id": "101110102",
            "zh": "长安"
        }, {"en": "lintong", "hk": "臨潼", "id": "101110103", "zh": "临潼"}, {
            "en": "lantian",
            "hk": "藍田",
            "id": "101110104",
            "zh": "蓝田"
        }, {"en": "zhouzhi", "hk": "周至", "id": "101110105", "zh": "周至"}, {
            "en": "huyi",
            "hk": "鄠邑",
            "id": "101110106",
            "zh": "鄠邑"
        }, {"en": "gaoling", "hk": "高陵", "id": "101110107", "zh": "高陵"}, {
            "en": "xincheng",
            "hk": "新城",
            "id": "101110108",
            "zh": "新城"
        }, {"en": "beilin", "hk": "碑林", "id": "101110109", "zh": "碑林"}, {
            "en": "lianhu",
            "hk": "蓮湖",
            "id": "101110110",
            "zh": "莲湖"
        }, {"en": "baqiao", "hk": "灞橋", "id": "101110111", "zh": "灞桥"}, {
            "en": "weiyang",
            "hk": "未央",
            "id": "101110112",
            "zh": "未央"
        }, {"en": "yanta", "hk": "雁塔", "id": "101110113", "zh": "雁塔"}, {
            "en": "yanliang",
            "hk": "閻良",
            "id": "101110114",
            "zh": "阎良"
        }], "en": "xian", "hk": "西安", "id": "344", "zh": "西安"
    }, {
        "children": [{"en": "xianyang", "hk": "咸陽", "id": "101110200", "zh": "咸阳"}, {
            "en": "sanyuan",
            "hk": "三原",
            "id": "101110201",
            "zh": "三原"
        }, {"en": "liquan", "hk": "禮泉", "id": "101110202", "zh": "礼泉"}, {
            "en": "yongshou",
            "hk": "永壽",
            "id": "101110203",
            "zh": "永寿"
        }, {"en": "chunhua", "hk": "淳化", "id": "101110204", "zh": "淳化"}, {
            "en": "jingyang",
            "hk": "涇陽",
            "id": "101110205",
            "zh": "泾阳"
        }, {"en": "wugong", "hk": "武功", "id": "101110206", "zh": "武功"}, {
            "en": "qianxian",
            "hk": "乾縣",
            "id": "101110207",
            "zh": "乾县"
        }, {"en": "binxian", "hk": "彬縣", "id": "101110208", "zh": "彬县"}, {
            "en": "changwu",
            "hk": "長武",
            "id": "101110209",
            "zh": "长武"
        }, {"en": "xunyi", "hk": "旬邑", "id": "101110210", "zh": "旬邑"}, {
            "en": "xingping",
            "hk": "興平",
            "id": "101110211",
            "zh": "兴平"
        }, {"en": "qindou", "hk": "秦都", "id": "101110212", "zh": "秦都"}, {
            "en": "weicheng",
            "hk": "渭城",
            "id": "101110213",
            "zh": "渭城"
        }], "en": "xianyang", "hk": "咸陽", "id": "345", "zh": "咸阳"
    }, {
        "children": [{"en": "yanan", "hk": "延安", "id": "101110300", "zh": "延安"}, {
            "en": "yanchang",
            "hk": "延長",
            "id": "101110301",
            "zh": "延长"
        }, {"en": "yanchuan", "hk": "延川", "id": "101110302", "zh": "延川"}, {
            "en": "zichang",
            "hk": "子長",
            "id": "101110303",
            "zh": "子长"
        }, {"en": "yichuan", "hk": "宜川", "id": "101110304", "zh": "宜川"}, {
            "en": "fuxian",
            "hk": "富縣",
            "id": "101110305",
            "zh": "富县"
        }, {"en": "zhidan", "hk": "志丹", "id": "101110306", "zh": "志丹"}, {
            "en": "ansai",
            "hk": "安塞",
            "id": "101110307",
            "zh": "安塞"
        }, {"en": "ganquan", "hk": "甘泉", "id": "101110308", "zh": "甘泉"}, {
            "en": "luochuan",
            "hk": "洛川",
            "id": "101110309",
            "zh": "洛川"
        }, {"en": "huangling", "hk": "黃陵", "id": "101110310", "zh": "黄陵"}, {
            "en": "huanglong",
            "hk": "黃龍",
            "id": "101110311",
            "zh": "黄龙"
        }, {"en": "wuqi", "hk": "吳起", "id": "101110312", "zh": "吴起"}, {
            "en": "baota",
            "hk": "寶塔",
            "id": "101110313",
            "zh": "宝塔"
        }], "en": "yanan", "hk": "延安", "id": "346", "zh": "延安"
    }, {
        "children": [{"en": "yulin", "hk": "榆林", "id": "101110401", "zh": "榆林"}, {
            "en": "fugu",
            "hk": "府谷",
            "id": "101110402",
            "zh": "府谷"
        }, {"en": "shenmu", "hk": "神木", "id": "101110403", "zh": "神木"}, {
            "en": "jiaxian",
            "hk": "佳縣",
            "id": "101110404",
            "zh": "佳县"
        }, {"en": "dingbian", "hk": "定邊", "id": "101110405", "zh": "定边"}, {
            "en": "jingbian",
            "hk": "靖邊",
            "id": "101110406",
            "zh": "靖边"
        }, {"en": "hengshan", "hk": "橫山", "id": "101110407", "zh": "横山"}, {
            "en": "mizhi",
            "hk": "米脂",
            "id": "101110408",
            "zh": "米脂"
        }, {"en": "zizhou", "hk": "子洲", "id": "101110409", "zh": "子洲"}, {
            "en": "suide",
            "hk": "綏德",
            "id": "101110410",
            "zh": "绥德"
        }, {"en": "wubu", "hk": "吳堡", "id": "101110411", "zh": "吴堡"}, {
            "en": "qingjian",
            "hk": "清澗",
            "id": "101110412",
            "zh": "清涧"
        }, {"en": "yuyang", "hk": "榆陽", "id": "101110413", "zh": "榆阳"}],
        "en": "yulin",
        "hk": "榆林",
        "id": "347",
        "zh": "榆林"
    }, {
        "children": [{"en": "weinan", "hk": "渭南", "id": "101110501", "zh": "渭南"}, {
            "en": "tongguan",
            "hk": "潼關",
            "id": "101110503",
            "zh": "潼关"
        }, {"en": "dali", "hk": "大荔", "id": "101110504", "zh": "大荔"}, {
            "en": "baishui",
            "hk": "白水",
            "id": "101110505",
            "zh": "白水"
        }, {"en": "fuping", "hk": "富平", "id": "101110506", "zh": "富平"}, {
            "en": "pucheng",
            "hk": "蒲城",
            "id": "101110507",
            "zh": "蒲城"
        }, {"en": "chengcheng", "hk": "澄城", "id": "101110508", "zh": "澄城"}, {
            "en": "heyang",
            "hk": "合陽",
            "id": "101110509",
            "zh": "合阳"
        }, {"en": "hancheng", "hk": "韓城", "id": "101110510", "zh": "韩城"}, {
            "en": "huayin",
            "hk": "華陰",
            "id": "101110511",
            "zh": "华阴"
        }, {"en": "linwei", "hk": "臨渭", "id": "101110512", "zh": "临渭"}, {
            "en": "huazhou",
            "hk": "華州",
            "id": "101110513",
            "zh": "华州"
        }], "en": "weinan", "hk": "渭南", "id": "348", "zh": "渭南"
    }, {
        "children": [{"en": "shangluo", "hk": "商洛", "id": "101110601", "zh": "商洛"}, {
            "en": "luonan",
            "hk": "洛南",
            "id": "101110602",
            "zh": "洛南"
        }, {"en": "zhashui", "hk": "柞水", "id": "101110603", "zh": "柞水"}, {
            "en": "shangzhou",
            "hk": "商州",
            "id": "101110604",
            "zh": "商州"
        }, {"en": "zhenan", "hk": "鎮安", "id": "101110605", "zh": "镇安"}, {
            "en": "danfeng",
            "hk": "丹鳳",
            "id": "101110606",
            "zh": "丹凤"
        }, {"en": "shangnan", "hk": "商南", "id": "101110607", "zh": "商南"}, {
            "en": "shanyang",
            "hk": "山陽",
            "id": "101110608",
            "zh": "山阳"
        }], "en": "shangluo", "hk": "商洛", "id": "349", "zh": "商洛"
    }, {
        "children": [{"en": "ankang", "hk": "安康", "id": "101110701", "zh": "安康"}, {
            "en": "ziyang",
            "hk": "紫陽",
            "id": "101110702",
            "zh": "紫阳"
        }, {"en": "shiquan", "hk": "石泉", "id": "101110703", "zh": "石泉"}, {
            "en": "hanyin",
            "hk": "漢陰",
            "id": "101110704",
            "zh": "汉阴"
        }, {"en": "xunyang", "hk": "旬陽", "id": "101110705", "zh": "旬阳"}, {
            "en": "langao",
            "hk": "嵐皋",
            "id": "101110706",
            "zh": "岚皋"
        }, {"en": "pingli", "hk": "平利", "id": "101110707", "zh": "平利"}, {
            "en": "baihe",
            "hk": "白河",
            "id": "101110708",
            "zh": "白河"
        }, {"en": "zhenping", "hk": "鎮坪", "id": "101110709", "zh": "镇坪"}, {
            "en": "ningshan",
            "hk": "寧陝",
            "id": "101110710",
            "zh": "宁陕"
        }, {"en": "hanbin", "hk": "漢濱", "id": "101110711", "zh": "汉滨"}],
        "en": "ankang",
        "hk": "安康",
        "id": "350",
        "zh": "安康"
    }, {
        "children": [{"en": "hanzhong", "hk": "漢中", "id": "101110801", "zh": "汉中"}, {
            "en": "lueyang",
            "hk": "略陽",
            "id": "101110802",
            "zh": "略阳"
        }, {"en": "mianxian", "hk": "勉縣", "id": "101110803", "zh": "勉县"}, {
            "en": "liuba",
            "hk": "留壩",
            "id": "101110804",
            "zh": "留坝"
        }, {"en": "yangxian", "hk": "洋縣", "id": "101110805", "zh": "洋县"}, {
            "en": "chenggu",
            "hk": "城固",
            "id": "101110806",
            "zh": "城固"
        }, {"en": "xixiang", "hk": "西鄉", "id": "101110807", "zh": "西乡"}, {
            "en": "fuoping",
            "hk": "佛坪",
            "id": "101110808",
            "zh": "佛坪"
        }, {"en": "ningqiang", "hk": "寧強", "id": "101110809", "zh": "宁强"}, {
            "en": "nanzheng",
            "hk": "南鄭",
            "id": "101110810",
            "zh": "南郑"
        }, {"en": "zhenba", "hk": "鎮巴", "id": "101110811", "zh": "镇巴"}, {
            "en": "hantai",
            "hk": "漢台",
            "id": "101110812",
            "zh": "汉台"
        }], "en": "hanzhong", "hk": "漢中", "id": "351", "zh": "汉中"
    }, {
        "children": [{"en": "baoji", "hk": "寶雞", "id": "101110901", "zh": "宝鸡"}, {
            "en": "qianyang",
            "hk": "千陽",
            "id": "101110903",
            "zh": "千阳"
        }, {"en": "linyou", "hk": "麟游", "id": "101110904", "zh": "麟游"}, {
            "en": "qishan",
            "hk": "岐山",
            "id": "101110905",
            "zh": "岐山"
        }, {"en": "fengxiang", "hk": "鳳翔", "id": "101110906", "zh": "凤翔"}, {
            "en": "fufeng",
            "hk": "扶風",
            "id": "101110907",
            "zh": "扶风"
        }, {"en": "meixian", "hk": "眉縣", "id": "101110908", "zh": "眉县"}, {
            "en": "taibai",
            "hk": "太白",
            "id": "101110909",
            "zh": "太白"
        }, {"en": "fengxian", "hk": "鳳縣", "id": "101110910", "zh": "凤县"}, {
            "en": "longxian",
            "hk": "隴縣",
            "id": "101110911",
            "zh": "陇县"
        }, {"en": "chencang", "hk": "陳倉", "id": "101110912", "zh": "陈仓"}, {
            "en": "weibin",
            "hk": "渭濱",
            "id": "101110902",
            "zh": "渭滨"
        }, {"en": "jintai", "hk": "金台", "id": "101110913", "zh": "金台"}],
        "en": "baoji",
        "hk": "寶雞",
        "id": "352",
        "zh": "宝鸡"
    }, {
        "children": [{"en": "tongchuan", "hk": "銅川", "id": "101111001", "zh": "铜川"}, {
            "en": "yijun",
            "hk": "宜君",
            "id": "101111003",
            "zh": "宜君"
        }, {"en": "yaozhou", "hk": "耀州", "id": "101111004", "zh": "耀州"}, {
            "en": "wangyi",
            "hk": "王益",
            "id": "101111005",
            "zh": "王益"
        }, {"en": "yintai", "hk": "印台", "id": "101111006", "zh": "印台"}],
        "en": "tongchuan",
        "hk": "銅川",
        "id": "353",
        "zh": "铜川"
    }, {
        "children": [{"en": "yangling", "hk": "楊凌", "id": "101111101", "zh": "杨凌"}, {
            "en": "yangling",
            "hk": "楊陵",
            "id": "101111102",
            "zh": "杨陵"
        }], "en": "yangling", "hk": "楊凌", "id": "354", "zh": "杨凌"
    }], "en": "shaanxi", "hk": "陝西", "id": "343", "zh": "陕西"
}, {
    "children": [{
        "children": [{"en": "yinchuan", "hk": "銀川", "id": "101170101", "zh": "银川"}, {
            "en": "yongning",
            "hk": "永寧",
            "id": "101170102",
            "zh": "永宁"
        }, {"en": "lingwu", "hk": "靈武", "id": "101170103", "zh": "灵武"}, {
            "en": "helan",
            "hk": "賀蘭",
            "id": "101170104",
            "zh": "贺兰"
        }, {"en": "xingqing", "hk": "興慶", "id": "101170105", "zh": "兴庆"}, {
            "en": "xixia",
            "hk": "西夏",
            "id": "101170106",
            "zh": "西夏"
        }, {"en": "jinfeng", "hk": "金鳳", "id": "101170107", "zh": "金凤"}],
        "en": "yinchuan",
        "hk": "銀川",
        "id": "356",
        "zh": "银川"
    }, {
        "children": [{"en": "shizuishan", "hk": "石嘴山", "id": "101170201", "zh": "石嘴山"}, {
            "en": "huinong",
            "hk": "惠農",
            "id": "101170202",
            "zh": "惠农"
        }, {"en": "pingluo", "hk": "平羅", "id": "101170203", "zh": "平罗"}, {
            "en": "dawukou",
            "hk": "大武口",
            "id": "101170205",
            "zh": "大武口"
        }, {"en": "taole", "hk": "陶樂", "id": "101170204", "zh": "陶乐"}],
        "en": "shizuishan",
        "hk": "石嘴山",
        "id": "357",
        "zh": "石嘴山"
    }, {
        "children": [{"en": "wuzhong", "hk": "吳忠", "id": "101170301", "zh": "吴忠"}, {
            "en": "tongxin",
            "hk": "同心",
            "id": "101170302",
            "zh": "同心"
        }, {"en": "yanchi", "hk": "鹽池", "id": "101170303", "zh": "盐池"}, {
            "en": "qingtongxia",
            "hk": "青銅峽",
            "id": "101170306",
            "zh": "青铜峡"
        }, {"en": "litong", "hk": "利通", "id": "101170304", "zh": "利通"}, {
            "en": "hongsibao",
            "hk": "紅寺堡",
            "id": "101170305",
            "zh": "红寺堡"
        }], "en": "wuzhong", "hk": "吳忠", "id": "358", "zh": "吴忠"
    }, {
        "children": [{"en": "guyuan", "hk": "固原", "id": "101170401", "zh": "固原"}, {
            "en": "xiji",
            "hk": "西吉",
            "id": "101170402",
            "zh": "西吉"
        }, {"en": "longde", "hk": "隆德", "id": "101170403", "zh": "隆德"}, {
            "en": "jinyuan",
            "hk": "涇源",
            "id": "101170404",
            "zh": "泾源"
        }, {"en": "pengyang", "hk": "彭陽", "id": "101170406", "zh": "彭阳"}, {
            "en": "yuanzhou",
            "hk": "原州",
            "id": "101170405",
            "zh": "原州"
        }], "en": "guyuan", "hk": "固原", "id": "359", "zh": "固原"
    }, {
        "children": [{"en": "zhongwei", "hk": "中衛", "id": "101170501", "zh": "中卫"}, {
            "en": "zhongning",
            "hk": "中寧",
            "id": "101170502",
            "zh": "中宁"
        }, {"en": "haiyuan", "hk": "海原", "id": "101170504", "zh": "海原"}, {
            "en": "shapotou",
            "hk": "沙坡頭",
            "id": "101170503",
            "zh": "沙坡头"
        }], "en": "zhongwei", "hk": "中衛", "id": "360", "zh": "中卫"
    }], "en": "ningxia", "hk": "寧夏", "id": "355", "zh": "宁夏"
}, {
    "children": [{
        "children": [{"en": "lanzhou", "hk": "蘭州", "id": "101160101", "zh": "兰州"}, {
            "en": "gaolan",
            "hk": "皋蘭",
            "id": "101160102",
            "zh": "皋兰"
        }, {"en": "yongdeng", "hk": "永登", "id": "101160103", "zh": "永登"}, {
            "en": "yuzhong",
            "hk": "榆中",
            "id": "101160104",
            "zh": "榆中"
        }, {"en": "chengguan", "hk": "城關", "id": "101160105", "zh": "城关"}, {
            "en": "qilihe",
            "hk": "七里河",
            "id": "101160106",
            "zh": "七里河"
        }, {"en": "xigu", "hk": "西固", "id": "101160107", "zh": "西固"}, {
            "en": "anning",
            "hk": "安寧",
            "id": "101160108",
            "zh": "安宁"
        }, {"en": "honggu", "hk": "紅古", "id": "101160109", "zh": "红古"}],
        "en": "lanzhou",
        "hk": "蘭州",
        "id": "362",
        "zh": "兰州"
    }, {
        "children": [{"en": "dingxi", "hk": "定西", "id": "101160201", "zh": "定西"}, {
            "en": "tongwei",
            "hk": "通渭",
            "id": "101160202",
            "zh": "通渭"
        }, {"en": "longxi", "hk": "隴西", "id": "101160203", "zh": "陇西"}, {
            "en": "weiyuan",
            "hk": "渭源",
            "id": "101160204",
            "zh": "渭源"
        }, {"en": "lintao", "hk": "臨洮", "id": "101160205", "zh": "临洮"}, {
            "en": "zhangxian",
            "hk": "漳縣",
            "id": "101160206",
            "zh": "漳县"
        }, {"en": "minxian", "hk": "岷縣", "id": "101160207", "zh": "岷县"}, {
            "en": "anding",
            "hk": "安定",
            "id": "101160208",
            "zh": "安定"
        }], "en": "dingxi", "hk": "定西", "id": "363", "zh": "定西"
    }, {
        "children": [{"en": "pingliang", "hk": "平涼", "id": "101160301", "zh": "平凉"}, {
            "en": "jingchuan",
            "hk": "涇川",
            "id": "101160302",
            "zh": "泾川"
        }, {"en": "lingtai", "hk": "靈臺", "id": "101160303", "zh": "灵台"}, {
            "en": "chongxin",
            "hk": "崇信",
            "id": "101160304",
            "zh": "崇信"
        }, {"en": "huating", "hk": "華亭", "id": "101160305", "zh": "华亭"}, {
            "en": "zhuanglang",
            "hk": "莊浪",
            "id": "101160306",
            "zh": "庄浪"
        }, {"en": "jingning", "hk": "靜寧", "id": "101160307", "zh": "静宁"}, {
            "en": "kongtong",
            "hk": "崆峒",
            "id": "101160308",
            "zh": "崆峒"
        }], "en": "pingliang", "hk": "平涼", "id": "364", "zh": "平凉"
    }, {
        "children": [{"en": "qingyang", "hk": "慶陽", "id": "101160401", "zh": "庆阳"}, {
            "en": "huanxian",
            "hk": "環縣",
            "id": "101160403",
            "zh": "环县"
        }, {"en": "huachi", "hk": "華池", "id": "101160404", "zh": "华池"}, {
            "en": "heshui",
            "hk": "合水",
            "id": "101160405",
            "zh": "合水"
        }, {"en": "zhengning", "hk": "正寧", "id": "101160406", "zh": "正宁"}, {
            "en": "ningxian",
            "hk": "寧縣",
            "id": "101160407",
            "zh": "宁县"
        }, {"en": "zhenyuan", "hk": "鎮原", "id": "101160408", "zh": "镇原"}, {
            "en": "qingcheng",
            "hk": "慶城",
            "id": "101160409",
            "zh": "庆城"
        }, {"en": "xifeng", "hk": "西峰", "id": "101160402", "zh": "西峰"}],
        "en": "qingyang",
        "hk": "慶陽",
        "id": "365",
        "zh": "庆阳"
    }, {
        "children": [{"en": "wuwei", "hk": "武威", "id": "101160501", "zh": "武威"}, {
            "en": "minqin",
            "hk": "民勤",
            "id": "101160502",
            "zh": "民勤"
        }, {"en": "gulang", "hk": "古浪", "id": "101160503", "zh": "古浪"}, {
            "en": "tianzhu",
            "hk": "天祝",
            "id": "101160505",
            "zh": "天祝"
        }, {"en": "liangzhou", "hk": "涼州", "id": "101160504", "zh": "凉州"}],
        "en": "wuwei",
        "hk": "武威",
        "id": "366",
        "zh": "武威"
    }, {
        "children": [{"en": "jinchang", "hk": "金昌", "id": "101160601", "zh": "金昌"}, {
            "en": "yongchang",
            "hk": "永昌",
            "id": "101160602",
            "zh": "永昌"
        }, {"en": "jinchuan", "hk": "金川", "id": "101160603", "zh": "金川"}],
        "en": "jinchang",
        "hk": "金昌",
        "id": "367",
        "zh": "金昌"
    }, {
        "children": [{"en": "zhangye", "hk": "張掖", "id": "101160701", "zh": "张掖"}, {
            "en": "sunan",
            "hk": "肅南",
            "id": "101160702",
            "zh": "肃南"
        }, {"en": "minle", "hk": "民樂", "id": "101160703", "zh": "民乐"}, {
            "en": "linze",
            "hk": "臨澤",
            "id": "101160704",
            "zh": "临泽"
        }, {"en": "gaotai", "hk": "高台", "id": "101160705", "zh": "高台"}, {
            "en": "shandan",
            "hk": "山丹",
            "id": "101160706",
            "zh": "山丹"
        }, {"en": "ganzhou", "hk": "甘州", "id": "101160707", "zh": "甘州"}],
        "en": "zhangye",
        "hk": "張掖",
        "id": "368",
        "zh": "张掖"
    }, {
        "children": [{"en": "jiuquan", "hk": "酒泉", "id": "101160801", "zh": "酒泉"}, {
            "en": "jinta",
            "hk": "金塔",
            "id": "101160803",
            "zh": "金塔"
        }, {"en": "akesai", "hk": "阿克塞", "id": "101160804", "zh": "阿克塞"}, {
            "en": "guazhou",
            "hk": "瓜州",
            "id": "101160805",
            "zh": "瓜州"
        }, {"en": "subei", "hk": "肅北", "id": "101160806", "zh": "肃北"}, {
            "en": "yumen",
            "hk": "玉門",
            "id": "101160807",
            "zh": "玉门"
        }, {"en": "dunhuang", "hk": "敦煌", "id": "101160808", "zh": "敦煌"}, {
            "en": "suzhou",
            "hk": "肅州",
            "id": "101160802",
            "zh": "肃州"
        }], "en": "jiuquan", "hk": "酒泉", "id": "369", "zh": "酒泉"
    }, {
        "children": [{"en": "tianshui", "hk": "天水", "id": "101160901", "zh": "天水"}, {
            "en": "qingshui",
            "hk": "清水",
            "id": "101160903",
            "zh": "清水"
        }, {"en": "qinan", "hk": "秦安", "id": "101160904", "zh": "秦安"}, {
            "en": "gangu",
            "hk": "甘谷",
            "id": "101160905",
            "zh": "甘谷"
        }, {"en": "wushan", "hk": "武山", "id": "101160906", "zh": "武山"}, {
            "en": "zhangjiachuan",
            "hk": "張家川",
            "id": "101160907",
            "zh": "张家川"
        }, {"en": "maiji", "hk": "麥積", "id": "101160908", "zh": "麦积"}, {
            "en": "qinzhou",
            "hk": "秦州",
            "id": "101160902",
            "zh": "秦州"
        }], "en": "tianshui", "hk": "天水", "id": "370", "zh": "天水"
    }, {
        "children": [{"en": "linxia", "hk": "臨夏", "id": "101161101", "zh": "临夏"}, {
            "en": "kangle",
            "hk": "康樂",
            "id": "101161102",
            "zh": "康乐"
        }, {"en": "yongjing", "hk": "永靖", "id": "101161103", "zh": "永靖"}, {
            "en": "guanghe",
            "hk": "廣河",
            "id": "101161104",
            "zh": "广河"
        }, {"en": "hezheng", "hk": "和政", "id": "101161105", "zh": "和政"}, {
            "en": "dongxiang",
            "hk": "東鄉",
            "id": "101161106",
            "zh": "东乡"
        }, {"en": "jishishan", "hk": "積石山", "id": "101161107", "zh": "积石山"}],
        "en": "linxia",
        "hk": "臨夏",
        "id": "371",
        "zh": "临夏"
    }, {
        "children": [{"en": "baiyin", "hk": "白銀", "id": "101161301", "zh": "白银"}, {
            "en": "jingyuan",
            "hk": "靖遠",
            "id": "101161302",
            "zh": "靖远"
        }, {"en": "huining", "hk": "會寧", "id": "101161303", "zh": "会宁"}, {
            "en": "pingchuan",
            "hk": "平川",
            "id": "101161304",
            "zh": "平川"
        }, {"en": "jingtai", "hk": "景泰", "id": "101161305", "zh": "景泰"}],
        "en": "baiyin",
        "hk": "白銀",
        "id": "372",
        "zh": "白银"
    }, {
        "children": [{"en": "jiayuguan", "hk": "嘉峪關", "id": "101161401", "zh": "嘉峪关"}],
        "en": "jiayuguan",
        "hk": "嘉峪關",
        "id": "373",
        "zh": "嘉峪关"
    }, {
        "children": [{"en": "wudu", "hk": "武都", "id": "101161001", "zh": "武都"}, {
            "en": "chengxian",
            "hk": "成縣",
            "id": "101161002",
            "zh": "成县"
        }, {"en": "wenxian", "hk": "文縣", "id": "101161003", "zh": "文县"}, {
            "en": "dangchang",
            "hk": "宕昌",
            "id": "101161004",
            "zh": "宕昌"
        }, {"en": "kangxian", "hk": "康縣", "id": "101161005", "zh": "康县"}, {
            "en": "xihe",
            "hk": "西和",
            "id": "101161006",
            "zh": "西和"
        }, {"en": "lixian", "hk": "禮縣", "id": "101161007", "zh": "礼县"}, {
            "en": "huixian",
            "hk": "徽縣",
            "id": "101161008",
            "zh": "徽县"
        }, {"en": "liangdang", "hk": "兩當", "id": "101161009", "zh": "两当"}, {
            "en": "longnan",
            "hk": "隴南",
            "id": "101161010",
            "zh": "陇南"
        }], "en": "longnan", "hk": "隴南", "id": "374", "zh": "陇南"
    }, {
        "children": [{"en": "hezuo", "hk": "合作", "id": "101161201", "zh": "合作"}, {
            "en": "lintan",
            "hk": "臨潭",
            "id": "101161202",
            "zh": "临潭"
        }, {"en": "zhuoni", "hk": "卓尼", "id": "101161203", "zh": "卓尼"}, {
            "en": "zhouqu",
            "hk": "舟曲",
            "id": "101161204",
            "zh": "舟曲"
        }, {"en": "diebu", "hk": "迭部", "id": "101161205", "zh": "迭部"}, {
            "en": "maqu",
            "hk": "瑪曲",
            "id": "101161206",
            "zh": "玛曲"
        }, {"en": "luqu", "hk": "碌曲", "id": "101161207", "zh": "碌曲"}, {
            "en": "xiahe",
            "hk": "夏河",
            "id": "101161208",
            "zh": "夏河"
        }, {"en": "gannan", "hk": "甘南", "id": "101161209", "zh": "甘南"}],
        "en": "gannan",
        "hk": "甘南",
        "id": "375",
        "zh": "甘南"
    }], "en": "gansu", "hk": "甘肅", "id": "361", "zh": "甘肃"
}, {
    "children": [{
        "children": [{"en": "xining", "hk": "西寧", "id": "101150101", "zh": "西宁"}, {
            "en": "datong",
            "hk": "大通",
            "id": "101150102",
            "zh": "大通"
        }, {"en": "huangyuan", "hk": "湟源", "id": "101150103", "zh": "湟源"}, {
            "en": "huangzhong",
            "hk": "湟中",
            "id": "101150104",
            "zh": "湟中"
        }, {"en": "chengdong", "hk": "城東", "id": "101150105", "zh": "城东"}, {
            "en": "chengzhong",
            "hk": "城中",
            "id": "101150106",
            "zh": "城中"
        }, {"en": "chengxi", "hk": "城西", "id": "101150107", "zh": "城西"}, {
            "en": "chengbei",
            "hk": "城北",
            "id": "101150108",
            "zh": "城北"
        }], "en": "xining", "hk": "西寧", "id": "377", "zh": "西宁"
    }, {
        "children": [{"en": "yushu", "hk": "玉樹", "id": "101150601", "zh": "玉树"}, {
            "en": "chenduo",
            "hk": "稱多",
            "id": "101150602",
            "zh": "称多"
        }, {"en": "zhiduo", "hk": "治多", "id": "101150603", "zh": "治多"}, {
            "en": "zaduo",
            "hk": "雜多",
            "id": "101150604",
            "zh": "杂多"
        }, {"en": "nangqian", "hk": "囊謙", "id": "101150605", "zh": "囊谦"}, {
            "en": "qumacai",
            "hk": "曲麻萊",
            "id": "101150606",
            "zh": "曲麻莱"
        }], "en": "yushu", "hk": "玉樹", "id": "378", "zh": "玉树"
    }, {
        "children": [{"en": "pingan", "hk": "平安", "id": "101150201", "zh": "平安"}, {
            "en": "ledu",
            "hk": "樂都",
            "id": "101150202",
            "zh": "乐都"
        }, {"en": "minhe", "hk": "民和", "id": "101150203", "zh": "民和"}, {
            "en": "huzhu",
            "hk": "互助",
            "id": "101150204",
            "zh": "互助"
        }, {"en": "hualong", "hk": "化隆", "id": "101150205", "zh": "化隆"}, {
            "en": "xunhua",
            "hk": "循化",
            "id": "101150206",
            "zh": "循化"
        }, {"en": "haidong", "hk": "海東", "id": "101150207", "zh": "海东"}],
        "en": "haidong",
        "hk": "海東",
        "id": "379",
        "zh": "海东"
    }, {
        "children": [{"en": "tongren", "hk": "同仁", "id": "101150301", "zh": "同仁"}, {
            "en": "jianzha",
            "hk": "尖扎",
            "id": "101150302",
            "zh": "尖扎"
        }, {"en": "zeku", "hk": "澤庫", "id": "101150303", "zh": "泽库"}, {
            "en": "henan",
            "hk": "河南",
            "id": "101150304",
            "zh": "河南"
        }, {"en": "huangnan", "hk": "黃南", "id": "101150305", "zh": "黄南"}],
        "en": "huangnan",
        "hk": "黃南",
        "id": "380",
        "zh": "黄南"
    }, {
        "children": [{"en": "gonghe", "hk": "共和", "id": "101150401", "zh": "共和"}, {
            "en": "guide",
            "hk": "貴德",
            "id": "101150404",
            "zh": "贵德"
        }, {"en": "xinghai", "hk": "興海", "id": "101150406", "zh": "兴海"}, {
            "en": "guinan",
            "hk": "貴南",
            "id": "101150407",
            "zh": "贵南"
        }, {"en": "tongde", "hk": "同德", "id": "101150408", "zh": "同德"}, {
            "en": "hainan",
            "hk": "海南",
            "id": "101150402",
            "zh": "海南"
        }], "en": "hainan", "hk": "海南", "id": "381", "zh": "海南"
    }, {
        "children": [{"en": "maqin", "hk": "瑪沁", "id": "101150501", "zh": "玛沁"}, {
            "en": "banma",
            "hk": "班瑪",
            "id": "101150502",
            "zh": "班玛"
        }, {"en": "gande", "hk": "甘德", "id": "101150503", "zh": "甘德"}, {
            "en": "dari",
            "hk": "達日",
            "id": "101150504",
            "zh": "达日"
        }, {"en": "jiuzhi", "hk": "久治", "id": "101150505", "zh": "久治"}, {
            "en": "madu",
            "hk": "瑪多",
            "id": "101150506",
            "zh": "玛多"
        }, {"en": "guoluo", "hk": "果洛", "id": "101150507", "zh": "果洛"}],
        "en": "guoluo",
        "hk": "果洛",
        "id": "382",
        "zh": "果洛"
    }, {
        "children": [{"en": "delingha", "hk": "德令哈", "id": "101150701", "zh": "德令哈"}, {
            "en": "tianjun",
            "hk": "天峻",
            "id": "101150708",
            "zh": "天峻"
        }, {"en": "wulan", "hk": "烏蘭", "id": "101150709", "zh": "乌兰"}, {
            "en": "mangai",
            "hk": "茫崖",
            "id": "101150712",
            "zh": "茫崖"
        }, {"en": "dachaidan", "hk": "大柴旦", "id": "101150713", "zh": "大柴旦"}, {
            "en": "lenghu",
            "hk": "冷湖",
            "id": "101150716",
            "zh": "冷湖"
        }, {"en": "geermu", "hk": "格爾木", "id": "101150714", "zh": "格尔木"}, {
            "en": "dulan",
            "hk": "都蘭",
            "id": "101150715",
            "zh": "都兰"
        }, {"en": "haixi", "hk": "海西", "id": "101150702", "zh": "海西"}],
        "en": "haixi",
        "hk": "海西",
        "id": "383",
        "zh": "海西"
    }, {
        "children": [{"en": "haiyan", "hk": "海晏", "id": "101150801", "zh": "海晏"}, {
            "en": "menyuan",
            "hk": "門源",
            "id": "101150802",
            "zh": "门源"
        }, {"en": "qilian", "hk": "祁連", "id": "101150803", "zh": "祁连"}, {
            "en": "gangcha",
            "hk": "剛察",
            "id": "101150806",
            "zh": "刚察"
        }, {"en": "haibei", "hk": "海北", "id": "101150804", "zh": "海北"}],
        "en": "haibei",
        "hk": "海北",
        "id": "384",
        "zh": "海北"
    }], "en": "qinghai", "hk": "青海", "id": "376", "zh": "青海"
}, {
    "children": [{
        "children": [{"en": "wulumuqi", "hk": "烏魯木齊", "id": "101130101", "zh": "乌鲁木齐"}, {
            "en": "dabancheng",
            "hk": "達坂城",
            "id": "101130105",
            "zh": "达坂城"
        }, {"en": "tianshan", "hk": "天山", "id": "101130102", "zh": "天山"}, {
            "en": "shayibake",
            "hk": "沙依巴克",
            "id": "101130104",
            "zh": "沙依巴克"
        }, {"en": "xinshi", "hk": "新市", "id": "101130106", "zh": "新市"}, {
            "en": "shuimogou",
            "hk": "水磨溝",
            "id": "101130107",
            "zh": "水磨沟"
        }, {"en": "toutunhe", "hk": "頭屯河", "id": "101130111", "zh": "头屯河"}, {
            "en": "midong",
            "hk": "米東",
            "id": "101130112",
            "zh": "米东"
        }, {"en": "wulumuqixian", "hk": "烏魯木齊縣", "id": "101130113", "zh": "乌鲁木齐县"}, {
            "en": "xiaoquzi",
            "hk": "小渠子",
            "id": "101130103",
            "zh": "小渠子"
        }, {"en": "tianchi", "hk": "天池", "id": "101130109", "zh": "天池"}, {
            "en": "xibaiyanggou",
            "hk": "西白楊溝",
            "id": "101130114",
            "zh": "西白杨沟"
        }], "en": "wulumuqi", "hk": "烏魯木齊", "id": "386", "zh": "乌鲁木齐"
    }, {
        "children": [{"en": "kelamayi", "hk": "克拉瑪依", "id": "101130201", "zh": "克拉玛依"}, {
            "en": "wuerhe",
            "hk": "烏爾禾",
            "id": "101130202",
            "zh": "乌尔禾"
        }, {"en": "baijiantan", "hk": "白鹼灘", "id": "101130203", "zh": "白碱滩"}, {
            "en": "dushanzi",
            "hk": "獨山子",
            "id": "101130204",
            "zh": "独山子"
        }], "en": "kelamayi", "hk": "克拉瑪依", "id": "387", "zh": "克拉玛依"
    }, {
        "children": [{"en": "shihezi", "hk": "石河子", "id": "101130301", "zh": "石河子"}, {
            "en": "paotai",
            "hk": "炮臺",
            "id": "101130302",
            "zh": "炮台"
        }, {"en": "mosuowan", "hk": "莫索灣", "id": "101130303", "zh": "莫索湾"}],
        "en": "shihezi",
        "hk": "石河子",
        "id": "388",
        "zh": "石河子"
    }, {
        "children": [{"en": "changji", "hk": "昌吉", "id": "101130401", "zh": "昌吉"}, {
            "en": "hutubi",
            "hk": "呼圖壁",
            "id": "101130402",
            "zh": "呼图壁"
        }, {"en": "fukang", "hk": "阜康", "id": "101130404", "zh": "阜康"}, {
            "en": "jimusaer",
            "hk": "吉木薩爾",
            "id": "101130405",
            "zh": "吉木萨尔"
        }, {"en": "qitai", "hk": "奇台", "id": "101130406", "zh": "奇台"}, {
            "en": "manasi",
            "hk": "瑪納斯",
            "id": "101130407",
            "zh": "玛纳斯"
        }, {"en": "mulei", "hk": "木壘", "id": "101130408", "zh": "木垒"}, {
            "en": "caijiahu",
            "hk": "蔡家湖",
            "id": "101130409",
            "zh": "蔡家湖"
        }], "en": "changji", "hk": "昌吉", "id": "389", "zh": "昌吉"
    }, {
        "children": [{"en": "tulufan", "hk": "吐魯番", "id": "101130501", "zh": "吐鲁番"}, {
            "en": "tuokexun",
            "hk": "托克遜",
            "id": "101130502",
            "zh": "托克逊"
        }, {"en": "shanshan", "hk": "鄯善", "id": "101130504", "zh": "鄯善"}, {
            "en": "gaochang",
            "hk": "高昌",
            "id": "101130503",
            "zh": "高昌"
        }], "en": "tulufan", "hk": "吐魯番", "id": "390", "zh": "吐鲁番"
    }, {
        "children": [{"en": "alaer", "hk": "阿拉爾", "id": "101130701", "zh": "阿拉尔"}],
        "en": "alaer",
        "hk": "阿拉爾",
        "id": "391",
        "zh": "阿拉尔"
    }, {
        "children": [{"en": "akesu", "hk": "阿克蘇", "id": "101130801", "zh": "阿克苏"}, {
            "en": "wushi",
            "hk": "烏什",
            "id": "101130802",
            "zh": "乌什"
        }, {"en": "wensu", "hk": "溫宿", "id": "101130803", "zh": "温宿"}, {
            "en": "baicheng",
            "hk": "拜城",
            "id": "101130804",
            "zh": "拜城"
        }, {"en": "xinhe", "hk": "新和", "id": "101130805", "zh": "新和"}, {
            "en": "shaya",
            "hk": "沙雅",
            "id": "101130806",
            "zh": "沙雅"
        }, {"en": "kuche", "hk": "庫車", "id": "101130807", "zh": "库车"}, {
            "en": "keping",
            "hk": "柯坪",
            "id": "101130808",
            "zh": "柯坪"
        }, {"en": "awati", "hk": "阿瓦提", "id": "101130809", "zh": "阿瓦提"}],
        "en": "akesu",
        "hk": "阿克蘇",
        "id": "392",
        "zh": "阿克苏"
    }, {
        "children": [{"en": "kashi", "hk": "喀什", "id": "101130901", "zh": "喀什"}, {
            "en": "yingjisha",
            "hk": "英吉沙",
            "id": "101130902",
            "zh": "英吉沙"
        }, {"en": "tashikuergan", "hk": "塔什庫爾幹", "id": "101130903", "zh": "塔什库尔干"}, {
            "en": "maigaiti",
            "hk": "麥蓋提",
            "id": "101130904",
            "zh": "麦盖提"
        }, {"en": "shache", "hk": "莎車", "id": "101130905", "zh": "莎车"}, {
            "en": "yecheng",
            "hk": "葉城",
            "id": "101130906",
            "zh": "叶城"
        }, {"en": "zepu", "hk": "澤普", "id": "101130907", "zh": "泽普"}, {
            "en": "bachu",
            "hk": "巴楚",
            "id": "101130908",
            "zh": "巴楚"
        }, {"en": "yuepuhu", "hk": "岳普湖", "id": "101130909", "zh": "岳普湖"}, {
            "en": "jiashi",
            "hk": "伽師",
            "id": "101130910",
            "zh": "伽师"
        }, {"en": "shufu", "hk": "疏附", "id": "101130911", "zh": "疏附"}, {
            "en": "shule",
            "hk": "疏勒",
            "id": "101130912",
            "zh": "疏勒"
        }], "en": "kashi", "hk": "喀什", "id": "393", "zh": "喀什"
    }, {
        "children": [{"en": "tacheng", "hk": "塔城", "id": "101131101", "zh": "塔城"}, {
            "en": "yumin",
            "hk": "裕民",
            "id": "101131102",
            "zh": "裕民"
        }, {"en": "emin", "hk": "額敏", "id": "101131103", "zh": "额敏"}, {
            "en": "hebukesaier",
            "hk": "和布克賽爾",
            "id": "101131104",
            "zh": "和布克赛尔"
        }, {"en": "tuoli", "hk": "托里", "id": "101131105", "zh": "托里"}, {
            "en": "wusu",
            "hk": "烏蘇",
            "id": "101131106",
            "zh": "乌苏"
        }, {"en": "shawan", "hk": "沙灣", "id": "101131107", "zh": "沙湾"}],
        "en": "tacheng",
        "hk": "塔城",
        "id": "394",
        "zh": "塔城"
    }, {
        "children": [{"en": "hami", "hk": "哈密", "id": "101131201", "zh": "哈密"}, {
            "en": "balikun",
            "hk": "巴里坤",
            "id": "101131203",
            "zh": "巴里坤"
        }, {"en": "yiwu", "hk": "伊吾", "id": "101131204", "zh": "伊吾"}, {
            "en": "yizhou",
            "hk": "伊州",
            "id": "101131202",
            "zh": "伊州"
        }], "en": "hami", "hk": "哈密", "id": "395", "zh": "哈密"
    }, {
        "children": [{"en": "hetian", "hk": "和田", "id": "101131301", "zh": "和田"}, {
            "en": "pishan",
            "hk": "皮山",
            "id": "101131302",
            "zh": "皮山"
        }, {"en": "cele", "hk": "策勒", "id": "101131303", "zh": "策勒"}, {
            "en": "moyu",
            "hk": "墨玉",
            "id": "101131304",
            "zh": "墨玉"
        }, {"en": "luopu", "hk": "洛浦", "id": "101131305", "zh": "洛浦"}, {
            "en": "minfeng",
            "hk": "民豐",
            "id": "101131306",
            "zh": "民丰"
        }, {"en": "yutian", "hk": "於田", "id": "101131307", "zh": "于田"}],
        "en": "hetian",
        "hk": "和田",
        "id": "396",
        "zh": "和田"
    }, {
        "children": [{"en": "aletai", "hk": "阿勒泰", "id": "101131401", "zh": "阿勒泰"}, {
            "en": "habahe",
            "hk": "哈巴河",
            "id": "101131402",
            "zh": "哈巴河"
        }, {"en": "jimunai", "hk": "吉木乃", "id": "101131405", "zh": "吉木乃"}, {
            "en": "buerjin",
            "hk": "布爾津",
            "id": "101131406",
            "zh": "布尔津"
        }, {"en": "fuhai", "hk": "福海", "id": "101131407", "zh": "福海"}, {
            "en": "fuyun",
            "hk": "富蘊",
            "id": "101131408",
            "zh": "富蕴"
        }, {"en": "qinghe", "hk": "青河", "id": "101131409", "zh": "青河"}],
        "en": "aletai",
        "hk": "阿勒泰",
        "id": "397",
        "zh": "阿勒泰"
    }, {
        "children": [{"en": "kuerle", "hk": "庫爾勒", "id": "101130601", "zh": "库尔勒"}, {
            "en": "luntai",
            "hk": "輪台",
            "id": "101130602",
            "zh": "轮台"
        }, {"en": "yuli", "hk": "尉犁", "id": "101130603", "zh": "尉犁"}, {
            "en": "ruoqiang",
            "hk": "若羌",
            "id": "101130604",
            "zh": "若羌"
        }, {"en": "qiemo", "hk": "且末", "id": "101130605", "zh": "且末"}, {
            "en": "hejing",
            "hk": "和靜",
            "id": "101130606",
            "zh": "和静"
        }, {"en": "yanqi", "hk": "焉耆", "id": "101130607", "zh": "焉耆"}, {
            "en": "shuo",
            "hk": "和碩",
            "id": "101130608",
            "zh": "和硕"
        }, {"en": "bohu", "hk": "博湖", "id": "101130612", "zh": "博湖"}, {
            "en": "bayinguoleng",
            "hk": "巴音郭楞",
            "id": "101130609",
            "zh": "巴音郭楞"
        }, {"en": "bayinbuluke", "hk": "巴音布魯克", "id": "101130610", "zh": "巴音布鲁克"}, {
            "en": "tieganlike",
            "hk": "鐵幹裏克",
            "id": "101130611",
            "zh": "铁干里克"
        }, {"en": "tazhong", "hk": "塔中", "id": "101130613", "zh": "塔中"}, {
            "en": "baluntai",
            "hk": "巴侖臺",
            "id": "101130614",
            "zh": "巴仑台"
        }], "en": "bayinguoleng", "hk": "巴音郭楞", "id": "398", "zh": "巴音郭楞"
    }, {
        "children": [{"en": "yining", "hk": "伊寧", "id": "101131001", "zh": "伊宁"}, {
            "en": "chabuchaer",
            "hk": "察布查爾",
            "id": "101131002",
            "zh": "察布查尔"
        }, {"en": "nileke", "hk": "尼勒克", "id": "101131003", "zh": "尼勒克"}, {
            "en": "yiningxian",
            "hk": "伊寧縣",
            "id": "101131004",
            "zh": "伊宁县"
        }, {"en": "gongliu", "hk": "鞏留", "id": "101131005", "zh": "巩留"}, {
            "en": "xinyuan",
            "hk": "新源",
            "id": "101131006",
            "zh": "新源"
        }, {"en": "zhaosu", "hk": "昭蘇", "id": "101131007", "zh": "昭苏"}, {
            "en": "tekesi",
            "hk": "特克斯",
            "id": "101131008",
            "zh": "特克斯"
        }, {"en": "huocheng", "hk": "霍城", "id": "101131009", "zh": "霍城"}, {
            "en": "huoerguosi",
            "hk": "霍爾果斯",
            "id": "101131010",
            "zh": "霍尔果斯"
        }, {"en": "kuitunshi", "hk": "奎屯", "id": "101131011", "zh": "奎屯"}, {
            "en": "yili",
            "hk": "伊犁",
            "id": "101131012",
            "zh": "伊犁"
        }], "en": "yili", "hk": "伊犁", "id": "399", "zh": "伊犁"
    }, {
        "children": [{"en": "bole", "hk": "博樂", "id": "101131601", "zh": "博乐"}, {
            "en": "wenquan",
            "hk": "溫泉",
            "id": "101131602",
            "zh": "温泉"
        }, {"en": "jinghe", "hk": "精河", "id": "101131603", "zh": "精河"}, {
            "en": "alashankou",
            "hk": "阿拉山口",
            "id": "101131606",
            "zh": "阿拉山口"
        }, {"en": "boertala", "hk": "博爾塔拉", "id": "101131604", "zh": "博尔塔拉"}],
        "en": "boertala",
        "hk": "博爾塔拉",
        "id": "400",
        "zh": "博尔塔拉"
    }, {
        "children": [{"en": "atushi", "hk": "阿圖什", "id": "101131501", "zh": "阿图什"}, {
            "en": "wuqia",
            "hk": "烏恰",
            "id": "101131502",
            "zh": "乌恰"
        }, {"en": "aketao", "hk": "阿克陶", "id": "101131503", "zh": "阿克陶"}, {
            "en": "aheqi",
            "hk": "阿合奇",
            "id": "101131504",
            "zh": "阿合奇"
        }, {"en": "kezhou", "hk": "克州", "id": "101131505", "zh": "克州"}],
        "en": "kezhou",
        "hk": "克州",
        "id": "401",
        "zh": "克州"
    }, {
        "children": [{"en": "tumushuke", "hk": "圖木舒克", "id": "101131701", "zh": "图木舒克"}],
        "en": "tumushuke",
        "hk": "圖木舒克",
        "id": "402",
        "zh": "图木舒克"
    }, {
        "children": [{"en": "wujiaqu", "hk": "五家渠", "id": "101131801", "zh": "五家渠"}],
        "en": "wujiaqu",
        "hk": "五家渠",
        "id": "403",
        "zh": "五家渠"
    }, {
        "children": [{"en": "tiemenguan", "hk": "鐵門關", "id": "101131901", "zh": "铁门关"}],
        "en": "tiemenguan",
        "hk": "鐵門關",
        "id": "404",
        "zh": "铁门关"
    }, {
        "children": [{"en": "kunyu", "hk": "昆玉", "id": "101131920", "zh": "昆玉"}],
        "en": "kunyu",
        "hk": "昆玉",
        "id": "405",
        "zh": "昆玉"
    }, {
        "children": [{"en": "beitun", "hk": "北屯", "id": "101132101", "zh": "北屯"}],
        "en": "beitun",
        "hk": "北屯",
        "id": "406",
        "zh": "北屯"
    }, {
        "children": [{"en": "shuanghe", "hk": "雙河", "id": "101132201", "zh": "双河"}],
        "en": "shuanghe",
        "hk": "雙河",
        "id": "407",
        "zh": "双河"
    }, {
        "children": [{"en": "kekedala", "hk": "可克達拉", "id": "101132301", "zh": "可克达拉"}],
        "en": "kekedala",
        "hk": "可克達拉",
        "id": "408",
        "zh": "可克达拉"
    }], "en": "xinjiang", "hk": "新疆", "id": "385", "zh": "新疆"
}]
